{"title": "Artichoke soup with Parmesan sticks", "time": 65, "yields": "6 serving(s)", "ingredients": ["600g Jerusalem artichoke , scrubbed and quartered (the artichokes can also be peeled)", "1 small potato (about 100-140g/4-5 oz) quartered", "1 large onion , chopped", "600ml vegetable chicken stock (use bought fresh, or make up with a stock cube)", "450ml milk", "grissini sticks", "3 heaped tbsp finely grated Parmesan (or vegetarian alternative)", "142ml carton single or whipping cream", "1-2 tbsp milk", "2 tsp snipped chives , optional"], "instructions": "Up to a month before, put all the soup ingredients in a pan and bring to a simmer. Continue to simmer, covered, for about 20-30 mins or until the artichokes and potatoes have become very tender. Liquidise the soup in batches until completely smooth. If you want to thin it, add more stock. Pour the soup into a rigid plastic container and leave to cool before covering and freezing.\nThe day before serving, transfer the soup to the fridge to defrost overnight.\nOn the day, heat oven to 190C/fan 170C/gas 5. Heat the soup and check the seasoning. While the soup is warming, put the grissini sticks on a baking tray. Scatter them with 1 tbsp of the Parmesan and put in the oven until warm and the cheese has melted, about 8-10 mins.\nMeanwhile, pour the cream into a small pan and simmer to reduce by a third. Stir in remaining Parmesan and let it melt. (For a little extra body, add a tbsp or two of soup.) Stir in 1-2 tbsp milk to cool it down, then blitz with a stick blender, if you like, for a frothy finish. (To avoid any splashes, transfer the cream to a larger pan or deep bowl to do this.) Ladle the soup between soup bowls, topping each with the warmed cream and a sprinkling of chives if using. Serve with the warm grissini sticks.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-327788_11-2a8ff4b.jpg", "nutrients": {"calories": "136 calories", "fatContent": "1 grams fat", "saturatedFatContent": "1 grams saturated fat", "carbohydrateContent": "27 grams carbohydrates", "fiberContent": "2 grams fiber", "proteinContent": "6 grams protein", "sodiumContent": "0.43 milligram of sodium"}}