{"title": "Beef ragout", "time": 235, "yields": "8 serving(s)", "ingredients": ["1.2kg beef shin, cut into chunks", "4-5 tbsp olive oil", "2 onions, finely chopped", "3 carrots, finely chopped", "4 celery sticks, finely chopped", "4 garlic cloves, sliced", "3 tbsp tomato purée", "400ml red wine", "2 rosemary sprigs", "2 bay leaves", "2 x 400g cans chopped tomatoes", "500ml beef stock", "parmesan, grated, and pappardelle (see 'Goes well with', below), to serve"], "instructions": "Heat the oven to 160C/140C fan/gas 3 and season the beef all over. Heat 1 tbsp oil in a flameproof casserole over a medium-high heat and brown the beef until dark, about 15 mins, in batches if you need to, using 1 tbsp oil for each batch. Drain the beef in a colander to remove the fat while you cook the rest.\nWipe out the pan with kitchen paper, then add about 2 tbsp oil, the onions, carrots, celery and garlic with a pinch of salt and cook for 8-10 mins over a low-medium heat. Stir in the tomato purée and cook for a further 3 mins. Add the wine, herbs, tomatoes and stock, season and bring to the boil, stir the beef back into the sauce and reduce to a simmer. Cover and put in the oven for 2 hrs 30 mins, then remove the lid, stir and put back in the oven, uncovered, for 30 mins. Stir or use a fork to roughly shred the beef, and season. Serve now, or chill until serving – it tastes better if made a day ahead.\nWhen ready to serve, gently reheat the ragout over a medium heat. Cook the pasta in a large pan of salted water for 3 mins, drain then tip into the ragout, toss together with some of the parmesan and leave for 1 min. Ladle the pasta into bowls, scatter over the remaining parmesan and serve.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/beef-ragout-c9c8bd0.jpg", "nutrients": {"calories": "396 calories", "fatContent": "20 grams fat", "saturatedFatContent": "6 grams saturated fat", "carbohydrateContent": "9 grams carbohydrates", "sugarContent": "8 grams sugar", "fiberContent": "3 grams fiber", "proteinContent": "34 grams protein", "sodiumContent": "0.2 milligram of sodium"}}