{"title": "Crab lasagne", "time": 70, "yields": "2 item(s)", "ingredients": ["600ml milk", "¼ tsp ground nutmeg", "85g butter , plus extra for greasing", "50g plain flour", "227ml pot double cream", "100g parmesan , grated", "1 egg , beaten", "3 x 100g pots brown and white crabmeat", "2 x 500g packs trimmed leek , well washed and finely sliced", "12 sheets fresh lasagne", "400g chunky skinless cod fillet, cubed"], "instructions": "Tip the milk, nutmeg, 50g of the butter and the flour into a non-stick pan. Heat while whisking or stirring until thickened. Remove from the heat and stir in the cream with plenty of seasoning. Measure 450ml of the sauce and beat half the Parmesan and the egg into it. Once cool, stir the crabmeat into the remaining sauce.\nMelt the remaining butter in a very large pan or wok, add the leeks and cook for about 10 mins, stirring frequently, until softened and cooked down.\nLightly grease 2 x 20cm square ovenproof dishes – trim the lasagne sheets to fit, if you need to.\nSpoon a quarter of the leeks into each dish and spread out. Top each with 2 lasagne sheets, then cover with the crab mixture and scatter over the chunks of fish. Top each with another 2 sheets, then cover with the leeks and the last of the sheets followed by the cheese sauce, then the remaining Parmesan.\nTo freeze: Wrap the dishes in several layers of cling film, then foil. Use within 2 months. Thaw overnight in the fridge. Heat oven to 180C/160C fan/gas 4. Unwrap the lasagnes and bake for 40 mins. (A freshly made version will take the same time.) Serve with a salad.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/crab-lasagne-5556e42.jpg", "nutrients": {"calories": "612 calories", "fatContent": "34 grams fat", "saturatedFatContent": "19 grams saturated fat", "carbohydrateContent": "42 grams carbohydrates", "sugarContent": "10 grams sugar", "fiberContent": "8 grams fiber", "proteinContent": "34 grams protein", "sodiumContent": "1 milligram of sodium"}}