{"title": "Hand-cut pappardelle", "time": 65, "yields": "8 serving(s)", "ingredients": ["750g ‘00’ pasta flour", "5 whole large eggs and 6 large egg yolks, both lightly beaten", "semolina flour , for dusting", "a pasta machine"], "instructions": "Tip the ‘00’ flour into a large food processor with a pinch of salt and the beaten eggs and yolks. Pulse in short bursts, being careful not to overheat the motor, and scrape the sides with a spatula between pulses to incorporate any dry flour. Stop pulsing when the mixture has come together in even crumbs. Tip onto a work surface and knead for 5-10 mins until you have a smooth, firm dough. If it’s very dry, you may need to add a splash of water to bring it together. Shape into a ball, wrap and chill for at least 1 hr and up to two days.\nKeeping the rest of the dough well covered, roll a quarter into a rectangle that will fit through the widest setting on your pasta machine. Pass the dough through the machine, reducing the width down to level three. This means it won’t be super thin, but will have a nice bite to it when cooked.\nUnfold the dough onto a work surface dusted with semolina. Cut it into smaller 25cm sheets, then cut each of the sheets lengthways into 2.5cm-thick pappardelle strips. Toss the strips in semolina. Repeat the rolling and cutting with the remaining dough, a quarter at a time. Once all cut, leave to dry for a few mins on a parchment-lined tray generously dusted with semolina – this will make it easier to handle. Cook the pasta in a large pan of salted water for 3 mins, then drain to serve.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/hand-cut-pappardelle-d42271a.jpg", "nutrients": {"calories": "478 calories", "fatContent": "11 grams fat", "saturatedFatContent": "4 grams saturated fat", "carbohydrateContent": "73 grams carbohydrates", "sugarContent": "1 grams sugar", "fiberContent": "4 grams fiber", "proteinContent": "20 grams protein", "sodiumContent": "0.3 milligram of sodium"}}