{"title": "Italian broccoli & salmon bake", "time": 65, "yields": "4 serving(s)", "ingredients": ["250g penne", "300g broccoli, cut into large florets", "25g butter", "25g plain flour", "600ml milk", "100g mascarpone", "8 sundried tomatoes (preserved in olive oil), drained and thickly sliced", "2 tbsp small capers (optional) rinsed to remove excess salt or vinegar", "8 anchovy fillets, halved (optional)", "10 large fresh basil leaves, roughly torn", "4 fresh skinless salmon fillets", "50g mature cheddar, finely grated"], "instructions": "Preheat the oven to 190C/gas 5/fan 170C and get out an ovenproof dish (measuring 20 by 30cm, and about 5cm deep). Meanwhile, put a large pan of water on to boil for the pasta. When it is boiling rapidly, tip in the pasta with a generous sprinkling of salt. Give it a stir, return to the boil and cook for 6 minutes. Add the broccoli, then return the water to the boil and cook for 4 minutes more, until the broccoli is on the firm side of just tender. Drain well.\nWhile the pasta is cooking, put the butter, flour and milk in a large pan and heat, whisking or stirring continuously, until it thickens to make a smooth sauce. Remove from the heat and stir in the mascarpone, sun-dried tomatoes, capers (if using), anchovies (if using) and basil, then add the pasta and broccoli and season well.\nHalve the salmon fillets widthways (you will see that there is an obvious divide on each fillet) then place the pieces in a single layer on the base of the ovenproof dish. Spoon the broccoli mixture on top, then scatter with the grated cheddar. (You can chill this for up to 4 hours if you want to get ahead.)\nBake for 30 minutes until the mixture is just starting to bubble round the edges and the mixture is pale golden – don’t let it go too dark or the fish will overcook.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-227467_12-0d8623c.jpg", "nutrients": {"calories": "817 calories", "fatContent": "42 grams fat", "saturatedFatContent": "18 grams saturated fat", "carbohydrateContent": "64 grams carbohydrates", "fiberContent": "5 grams fiber", "proteinContent": "49 grams protein", "sodiumContent": "1.3 milligram of sodium"}}