{"title": "Next level spaghetti Bolognese", "time": 260, "yields": "8 serving(s)", "ingredients": ["olive oil", "400g beef mince", "400g Italian pork sausages, skinned and crumbled", "200g smoked pancetta", "1 onion, finely chopped", "1 carrot, finely chopped", "2 celery sticks, finely chopped", "4 garlic cloves, chopped", "1 sprig thyme", "small bunch fresh basil, small leaves picked and reserved", "2 bay leaves", "2 tsp dried oregano", "handful dried porcini mushrooms", "1 tsp golden caster sugar", "1 tbsp tomato purée", "½ tsp Thai fish sauce", "1 tbsp red wine vinegar", "100ml whole milk", "4 x 400g cans chopped tomatoes", "200ml white wine", "100g parmesan, grated, rind removed and kept", "spaghetti, to serve"], "instructions": "Heat a drizzle of olive oil in a large non-stick frying pan and crumble in the mince and sausagemeat. Spend a good 30 mins cooking the mince – it will release lots of liquid, which you want to evaporate, and then eventually it will end up sizzling in its own fat. If the pan becomes too dry, drizzle in a little more olive oil. Towards the end, continue stirring the mince until it becomes speckled with crisp brown bits.\nHeat oven to 140C/120C fan/gas 2. While the mince is browning, heat a drizzle more oil in a casserole dish and sizzle the pancetta for 5 mins until it starts to brown and release its fat, then throw in the vegetables and herbs, and finely crumble over the dried porcini. Cook gently for 5 mins until soft and starting to brown. Sprinkle over the sugar, then stir in the tomato purée and splash in the fish sauce and vinegar. Simmer down until gloopy, then stir through the meat and pour in the milk and tomatoes. Rinse out the tomato tins with the wine and stir into the pan. Season, then nestle in the parmesan rind. Bring to a simmer, then cover and cook in the oven for 3 hrs.\nWhen cooked, tip as many portions of Bolognese as you need into a sauté pan. Cook the pasta until very al dente, then tong into the pan with a bit of the water and finish cooking with the sauce for 2 mins. Stir through the parmesan and a drizzle more olive oil. Twirl the pasta and Bolognese into bowls, scatter with basil and serve with more parmesan.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/spaghetti-bolognese-1130fa2.jpg", "nutrients": {"calories": "500 calories", "fatContent": "32 grams fat", "saturatedFatContent": "13 grams saturated fat", "carbohydrateContent": "17 grams carbohydrates", "sugarContent": "13 grams sugar", "fiberContent": "5 grams fiber", "proteinContent": "29 grams protein", "sodiumContent": "1.7 milligram of sodium"}}