{"title": "Porchetta ragu", "time": 200, "yields": "8 serving(s)", "ingredients": ["2 tbsp olive oil", "800g pork shoulder, diced", "3 pork sausages", "1 onion, chopped", "1 carrot, chopped", "1 celery stick, chopped", "2 large garlic cloves, crushed", "2 tsp fennel seeds, crushed", "pinch of chilli flakes (optional)", "200ml white wine", "2 bay leaves", "2 rosemary sprigs, leaves picked and finely chopped", "½ bunch of thyme", "100ml chicken stock", "3 tbsp tomato purée", "2 x 400g cans chopped tomatoes", "2 tbsp double cream", "1 lemon, zested", "½ bunch of parsley, finely chopped", "500g rigatoni pasta", "grated parmesan, to serve"], "instructions": "Heat half the oil in a large casserole over a medium-high heat, and fry the diced pork for 5 mins, stirring often until browned. Transfer to a bowl using a slotted spoon and set aside. Squeeze the sausagemeat from the skins into the pan, and fry for 2-3 mins until browned. Scoop into the bowl with the diced pork.\nReduce the heat to low and fry the onion, carrot and celery for 5 mins in the remaining oil. Add the garlic, fennel seeds and chilli flakes and fry for 1 min more. Return the meat to the pan along with the wine. Bring to a simmer and cook until the liquid has reduced by about half. Add the bay, rosemary, thyme, stock, tomato purée and chopped tomatoes, and return to a simmer. Season. Cover and cook over a low heat for 2 hrs 30 mins, or until the pork is falling apart.\nRemove the lid, discard the bay and turn up the heat slightly. Simmer for 5-10 mins, or until slightly reduced, stirring often. Stir in the cream, lemon zest and parsley. Season to taste.\nCook the pasta following pack instructions. Toss with the ragu, and serve sprinkled with parmesan.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/11/Porchetta-ragu-97ba640.jpg", "nutrients": {"calories": "514 calories", "fatContent": "21 grams fat", "saturatedFatContent": "7 grams saturated fat", "carbohydrateContent": "49 grams carbohydrates", "sugarContent": "8 grams sugar", "fiberContent": "6 grams fiber", "proteinContent": "27 grams protein", "sodiumContent": "0.5 milligram of sodium"}}