{"title": "Sausage pasta bake", "time": 120, "yields": "4 serving(s)", "ingredients": ["400g rigatoni or penne", "125g ball mozzarella, chopped into chunks", "2 tbsp olive oil", "6 pork sausages", "4 garlic cloves, sliced", "pinch of chilli flakes (optional)", "1 tbsp tomato purée", "1 tbsp red wine vinegar", "2 x 400g cans chopped tomatoes", "1 tbsp butter", "1 tbsp plain flour", "350ml milk", "50g parmesan, grated, plus extra to serve"], "instructions": "To make the ragu, heat the oil in a large shallow pan or flameproof casserole. Squeeze the sausagemeat from its skins in small balls straight into the pan. Sizzle for 10 mins until browned (don’t worry if the meat breaks up). Add the garlic and sizzle for another minute until starting to turn golden, then stir in the chilli flakes, if using, the tomato purée and vinegar. Tip in the tomatoes and bring to a simmer. Reduce the heat to low and bubble for 30 mins.\nMeanwhile, make the white sauce. Melt the butter in a saucepan and stir in the flour to make a loose paste. Sizzle for a minute, then gradually whisk in the milk. Simmer gently for 10 mins, whisking occasionally to ensure the sauce stays smooth. Season and whisk in the parmesan. Remove from the heat and set aside.\nCook the pasta in a large saucepan of boiling water for 9 mins, or a minute less than pack instructions. Drain and return to the pan. Scrape most of the white sauce into the pasta and stir to coat. Tip in most of the ragu and most of the mozzarella and stir until just combined. Pour the pasta mixture into a large baking dish and spoon over the remaining white sauce and ragu. Dot with the rest of the mozzarella and sprinkle with extra parmesan. Leave to cool completely, then wrap and chill for up to a day, or freeze for up to two months. Defrost in the fridge for 24 hrs before baking.\nHeat the oven to 190C/170C fan/gas 5. Bake for 25-30 mins until the top is slightly crisp at the edges and the cheese is melted. Leave to rest for 5-10 mins, then take the baking dish straight to the table for people to scoop onto their plates.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2021/03/Sausage-pasta-bake-f71108a.jpg", "nutrients": {"calories": "883 calories", "fatContent": "39 grams fat", "saturatedFatContent": "17 grams saturated fat", "carbohydrateContent": "94 grams carbohydrates", "sugarContent": "16 grams sugar", "fiberContent": "9 grams fiber", "proteinContent": "36 grams protein", "sodiumContent": "1.4 milligram of sodium"}}