{"title": "Slow cooker lasagne", "time": 255, "yields": "4 serving(s)", "ingredients": ["2 tsp rapeseed oil", "2 onions, finely chopped", "4 celery sticks (about 175g), finely diced", "4 carrots (320g), finely diced", "2 garlic cloves, chopped", "400g lean (5% fat) mince beef", "400g can chopped tomatoes", "2 tbsp tomato purée", "2 tsp vegetable bouillon", "1 tbsp balsamic vinegar", "1 tbsp fresh thyme leaves", "6 wholewheat lasagne sheets (105g)", "400ml whole milk", "50g wholemeal flour", "1 bay leaf", "generous grating of nutmeg", "15g finely grated parmesan"], "instructions": "Heat the slow cooker if necessary. Heat the oil in a large non-stick pan and fry the onions, celery, carrots and garlic for 5-10 mins, stirring frequently until softened and starting to colour. Tip in the meat and break it down with a wooden spoon, stirring until it browns. Pour in the tomatoes with a quarter of a can of water, the tomato purée, bouillon, balsamic vinegar, thyme and plenty of black pepper, return to the boil and cook for 5 mins more.\nSpoon half the mince in the slow cooker and top with half the lasagne, breaking it where necessary so it covers as much of the meat layer as possible. Top with the rest of the meat, and then another layer of the lasagne. Cover and cook on Low while you make the sauce.\nTip the milk and flour into a pan with the bay leaf and nutmeg and cook on the hob, whisking continuously until thickened. Carry on cooking for a few mins to cook the flour. Remove the bay leaf and stir in the cheese. Pour onto the pasta and spread out with a spatula, then cover and cook for 3 hours until the meat is cooked and the pasta is tender. Allow to settle for 10 mins before serving with salad.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/beeflasagne-101bf4f.jpg", "nutrients": {"calories": "448 calories", "fatContent": "12 grams fat", "saturatedFatContent": "6 grams saturated fat", "carbohydrateContent": "46 grams carbohydrates", "sugarContent": "19 grams sugar", "fiberContent": "9 grams fiber", "proteinContent": "33 grams protein", "sodiumContent": "0.71 milligram of sodium"}}