{"title": "Slow-cooker vegetable lasagne", "time": 210, "yields": "4 serving(s)", "ingredients": ["1 tbsp rapeseed oil", "2 onions, sliced", "2 large garlic cloves, chopped", "2 large courgettes, diced (400g)", "1 red and 1 yellow pepper, deseeded and roughly sliced", "400g can chopped tomatoes", "2 tbsp tomato purée", "2 tsp vegetable bouillon", "15g fresh basil, chopped plus a few leaves", "1 large aubergine, sliced across length or width for maximum surface area", "6 wholewheat lasagne sheets (105g)", "125g vegetarian buffalo mozzarella, chopped"], "instructions": "Heat 1 tbsp rapeseed oil in a large non-stick pan and fry 2 sliced onions and 2 chopped large garlic cloves for 5 mins, stirring frequently until softened.\nTip in 2 diced large courgettes, 1 red and 1 yellow pepper, both roughly sliced, and 400g chopped tomatoes with 2 tbsp tomato purée, 2 tsp vegetable bouillon and 15g chopped basil.\nStir well, cover and cook for 5 mins. Don't be tempted to add more liquid as plenty of moisture will come from the vegetables once they start cooking.\nSlice 1 large aubergine. Lay half the slices of aubergine in the base of the slow cooker and top with 3 sheets of lasagne.\nAdd a third of the ratatouille mixture, then the remaining aubergine slices, 3 more lasagne sheets, then the remaining ratatouille mixture.\nCover and cook on High for 2½ - 3 hours until the pasta and vegetables are tender. Turn off the machine.\nScatter 125g vegetarian buffalo mozzarella over the vegetables then cover and leave for 10 mins to settle and melt the cheese.\nScatter with extra basil and serve with a handful of rocket.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/vegelasagne-43d04d5.jpg", "nutrients": {"calories": "325 calories", "fatContent": "11 grams fat", "saturatedFatContent": "5 grams saturated fat", "carbohydrateContent": "36 grams carbohydrates", "sugarContent": "17 grams sugar", "fiberContent": "11 grams fiber", "proteinContent": "15 grams protein", "sodiumContent": "0.44 milligram of sodium"}}