{"title": "Spaghetti & meatballs", "time": 60, "yields": "10 item(s)", "ingredients": ["8 good-quality pork sausages", "1 kg beef mince", "1 onion, finely chopped", "½ a large bunch flat-leaf parsley, finely chopped", "85g parmesan, grated, plus extra to serve (optional)", "100g fresh breadcrumbs", "2 eggs, beaten with a fork", "olive oil, for roasting", "spaghetti, to serve (about 100g per portion)", "3 tbsp olive oil", "4 garlic cloves, crushed", "4 x 400g cans chopped tomatoes", "125ml red wine (optional)", "3 tbsp caster sugar", "½ a large bunch of flat-leaf parsley, finely chopped", "few basil leaves (optional)"], "instructions": "First, make the meatballs. Split the skins of the sausages and squeeze out the meat into a large mixing bowl.\nAdd the mince, onion, parsley, parmesan, breadcrumbs, eggs and lots of seasoning. Get your hands in and mix together really well – the more you squeeze and mash the mince, the more tender the meatballs will be.\nHeat the oven to 220C/200C fan/gas 7. Roll the mince mixture into about 50 golf-ball-sized meatballs. Set aside any meatballs for freezing, allowing about five per portion, then spread the rest out in a large roasting tin – the meatballs will brown better if spaced out a bit.\nDrizzle with a little oil (about 1 tsp per portion), shake to coat, then roast for 20-30 mins until browned.\nMeanwhile, make the sauce. Heat the olive oil in a large saucepan. Add the garlic cloves and sizzle for 1 min.\nStir in the chopped tomatoes, red wine, if using, caster sugar, parsley and seasoning. Simmer for 15-20 mins until slightly thickened.\nStir in a few basil leaves, if using, spoon out any portions for freezing, then add the cooked meatballs to the pan to keep warm while you cook the spaghetti in a pan of boiling, salted water.\nSpoon the sauce and meatballs over spaghetti, or stir them all together and serve with extra parmesan and a few basil leaves, if you like.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1035708_10-fdc5ae0.jpg", "nutrients": {"calories": "870 calories", "fatContent": "37 grams fat", "saturatedFatContent": "13 grams saturated fat", "carbohydrateContent": "95 grams carbohydrates", "sugarContent": "13 grams sugar", "fiberContent": "5 grams fiber", "proteinContent": "46 grams protein", "sodiumContent": "1.3 milligram of sodium"}}