{"title": "Special seafood & saffron pasta", "time": 50, "yields": "2 serving(s)", "ingredients": ["3 firm tomatoes", "200g fusilli lunghi or another long, thin pasta shape", "2 tbsp olive oil", "3 garlic cloves , thinly sliced", "100g king prawn , deveined", "100g scallop , halved if very large", "300g mussel , shells cleaned", "150ml white wine", "good pinch saffron , mixed with 3 tbsp hot water", "zest 1 lemon , plus juice ½", "4 tbsp single cream", "small pack parsley , chopped", "2 tbsp pine nuts , toased"], "instructions": "Bring a large pan of salted water to the boil and have a bowl of cold water to hand. Cut a small cross in the base of each tomato and add to the hot water, then after 15 secs, scoop out with a slotted spoon (but keep the water boiling for the pasta) and plunge into the cold water. Leave the tomatoes to cool for 30 secs, then remove. Use a small sharp knife to peel away the skin, starting at the base where you made the cross. Cut each tomato into quarters then cut out and discard the seeds and any membrane. Cut into small dice, then set aside.\nAdd the pasta to the boiling water and cook for 2 mins less than it says on the pack. Meanwhile, heat the oil in a large frying pan (you’ll need to use one with a lid) and add the garlic, sizzle for 2 mins until just starting to turn golden, then push to one side of the pan. Increase the heat and add the prawns and scallops, fry for 1-2 mins until the prawns are pink and the scallops are just turning golden, then scoop out of the pan and set aside on a plate. Add the mussels, white wine, saffron (with its soaking liquid) and some seasoning. Cover the pan with a lid and leave to steam for 3 mins until the mussels open (discard any which stay closed).\nAdd the lemon zest and juice and the cream to the sauce and check the seasoning. Drain the pasta and add this too, along with the prawns, scallops and diced tomato. Toss everything together, and bubble for another 2 mins, or until the pasta has absorbed some of the sauce and is cooked through. Scatter with parsley and pine nuts and give everything a final toss together.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/seafood-pasta-926dfcf.jpg", "nutrients": {"calories": "758 calories", "fatContent": "32 grams fat", "saturatedFatContent": "6 grams saturated fat", "carbohydrateContent": "64 grams carbohydrates", "sugarContent": "9 grams sugar", "fiberContent": "3 grams fiber", "proteinContent": "43 grams protein", "sodiumContent": "1 milligram of sodium"}}