{"title": "Stuffed pasta bake bolognese", "time": 150, "yields": "6 serving(s)", "ingredients": ["250g large pasta shells or conchiglioni", "200g mascarpone", "2 x 125g balls mozzarella , drained and finely chopped", "large bunch basil , roughly chopped, plus a few whole leaves to serve", "3 garlic cloves , crushed", "parmesan , to serve", "1 tbsp olive oil", "1 onion , finely diced", "1 celery stick , finely diced", "1 carrot , finely diced", "400g beef mince", "2 garlic cloves , crushed", "250ml red wine", "1 tbsp tomato purée", "3 bay leaves", "2 x 400g cans chopped tomatoes", "pinch of sugar", "1-2 tsp balsamic vinegar"], "instructions": "To make the bolognese, heat the oil in a wide ovenproof pan over a medium heat. Fry the onion, celery and carrot with some seasoning for 20 mins until soft and lightly golden. Tip in the beef mince, turn up the heat and fry, stirring regularly, for another 10 mins until the mince browns. Add the garlic, fry for a minute, then pour in the wine and bubble for a few mins more, scraping the pan to release any bits. Stir through the purée, bay leaves and tomatoes, with a canful of water. Simmer for 1½ hrs, covered for the first hour, then remove the lid and bubble until the tomatoes have broken down. Season with salt, pepper, the sugar and balsamic vinegar.\nTip the pasta shells into a large heatproof bowl with a pinch of salt, and pour over a kettle of boiled water. Cover and leave to soften for 15-20 mins – they need to retain some firmness so you can fill them.\nHeat the oven to 200C/180C fan/gas 4 and drain the pasta. Use a fork to mash the mascarpone with the mozzarella, chopped basil, garlic and some black pepper in a bowl.\nThe bolognese should be a little wetter than you’d like as the pasta shells will absorb some of the liquid as it bakes. Remove from the heat, giving it a final stir. Using a teaspoon, fill the pasta shells with some of the mascarpone mixture, pressing the mix in with your index finger. Nestle the shells into the sauce, filled-side up. Bake for 20-30 mins until the top is golden and bubbling, and the pasta is tender. Grate over some parmesan and finish with a few basil leaves.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/stuffed-pasta-bake-bolognese-6995b2b.jpg", "nutrients": {"calories": "630 calories", "fatContent": "37 grams fat", "saturatedFatContent": "21 grams saturated fat", "carbohydrateContent": "34 grams carbohydrates", "sugarContent": "10 grams sugar", "fiberContent": "4 grams fiber", "proteinContent": "30 grams protein", "sodiumContent": "0.7 milligram of sodium"}}