{"title": "One-pan Thai green salmon", "time": 60, "yields": "4 serving(s)", "ingredients": ["2 tbsp vegetable oil", "2 shallots , thickly sliced", "1 green chilli , deseeded if you like, and sliced, plus extra to serve", "300g baby new potatoes , quartered", "1 lemongrass stalk, bashed", "4 tbsp Thai green curry paste", "400g can coconut milk", "200-300ml vegetable stock", "1-2 tbsp fish sauce", "½-1 tbsp brown or palm sugar", "1 courgette , trimmed and peeled into ribbons", "100g baby spinach", "4 skinless salmon fillets", "3 limes , 2 juiced plus 1 cut into wedges to serve", "3 spring onions , finely sliced (optional)", "handful of coriander or Thai basil, roughly chopped, to serve", "cooked jasmine rice or rice noodles, to serve (optional)"], "instructions": "Heat the oven to 200C/180C fan/ gas 6. Put the oil in a deep roasting tin or dish about 30 x 25cm and toss through the shallots, chilli, potatoes and lemongrass. Roast for 10 mins until fragrant, keeping an eye on the shallots to ensure they don’t burn. Remove from the oven and stir in the curry paste to coat everything. Return to the oven for 2 mins until its aroma is released before mixing in the coconut milk and 200ml stock. Put back in the oven again for 15-20 mins until the sauce is slightly thickened and the potatoes are turning tender.\nSeason to taste with the fish sauce and sugar, then stir through the courgette ribbons and spinach. Add another 50ml-100ml stock now if the sauce is too thick, but be aware that the courgette and spinach will release some water as well. Nestle the salmon fillets in the sauce and bake for a further 10-15 mins until the salmon is cooked to your liking.\nAdd the lime juice and taste the sauce for a balance of sweet and sour, adding more lime juice and fish sauce, if you like. Scatter over the spring onions, if using, along with the herbs and chilli. For a more filling meal, serve with rice or noodles and the lime wedges on the side.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/thai-salmon-8afcbd5.jpg", "nutrients": {"calories": "667 calories", "fatContent": "46 grams fat", "saturatedFatContent": "19 grams saturated fat", "carbohydrateContent": "21 grams carbohydrates", "sugarContent": "8 grams sugar", "fiberContent": "4 grams fiber", "proteinContent": "41 grams protein", "sodiumContent": "1.2 milligram of sodium"}}