{"title": "Vegan meatballs", "time": 85, "yields": "4 serving(s)", "ingredients": ["30g dried porcini mushrooms", "3 tbsp olive oil", "1 onion , very finely chopped", "2 garlic cloves , crushed", "1 tsp sweet smoked paprika", "1 x 400g can black beans , drained and rinsed", "50g rolled oats", "2 tbsp brown rice miso", "50g fresh breadcrumbs", "spaghetti or soft polenta, to serve", "2 tbsp olive oil", "1 onion , very finely chopped", "1 large garlic clove , crushed", "Small pinch of chilli flakes", "2 x 400g cans chopped tomatoes", "1 tbsp soft brown sugar", "½ small bunch of basil , finely chopped"], "instructions": "Tip the dried porcini into a bowl and cover with boiling water. Leave to soak for 20 mins.\nMeanwhile heat 1 tbsp of olive oil a frying pan. Add the onion and fry over a low heat for 10 mins or until softened and translucent. Add the garlic and paprika and cook for 1 min.\nTip the black beans and oats into a food processor and blitz until you have a chunky, textured mixture. Tip the beans into a mixing bowl and stir through the miso, breadcrumbs and cooked onion mix. Strain and finely chop the porcini mushrooms and add those (keep the liquid for soup or risottos). Season and roll into 12 balls and chill in the fridge while you make the sauce.\nHeat 2 tbsp oil in a saucepan. Add the onion and fry over a low heat for 10 mins or until softened and translucent. Add the garlic and chilli and cook for 1 min. Stir through the tomatoes and sugar and season to taste. Simmer uncovered for 20 mins.\nHeat the oven to 180C/160C fan/gas 4. Heat the remaining 2 tbsp oil for the meatballs in a non-stick frying pan over a medium heat. Add the balls and fry for 5 mins until evenly brown. Transfer to a baking tray and put in the oven to cook through for 12 mins.\nAdd the cooked meatballs to the pan of sauce and toss everything to coat, then scatter with the basil. Serve with spaghetti or soft polenta.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/vegan-meatballs-cc1ede5.jpg", "nutrients": {"calories": "400 calories", "fatContent": "17 grams fat", "saturatedFatContent": "2 grams saturated fat", "carbohydrateContent": "45 grams carbohydrates", "sugarContent": "18 grams sugar", "fiberContent": "9 grams fiber", "proteinContent": "12 grams protein", "sodiumContent": "1.43 milligram of sodium"}}