{"title": "Bakewell cheesecake", "time": 105, "yields": "10 serving(s)", "ingredients": ["200g/7oz almond biscuits", "100g toasted flaked almond", "½ tsp almond extract", "100g butter , melted", "3 x 300g packs full-fat soft cheese", "250g caster sugar", "4 tbsp plain flour", "1 tsp vanilla extract", "3 large eggs", "200ml tub soured cream", "just over half a 300g jar cherry jam", "icing sugar and cream , to serve"], "instructions": "Heat oven to 200C/180C fan/gas 6. Line the base and sides of a 23cm springform tin with baking parchment. Bash the biscuits and 75g of the flaked almonds to crumbs – try double-bagging in food bags and crushing with a rolling pin. Mix with the almond extract and melted butter, then press into the base of the prepared tin and bake for 10 mins. Set aside to cool while you make the filling.\nIn your largest bowl, whisk the cheese with an electric whisk until creamy. Add the sugar and whisk to combine. Whisk in the flour, then the vanilla, the eggs, one at a time, and finally the soured cream.\nDollop spoonfuls of mixture into the tin, dotting in tbsps of jam as you go. Smooth the top as gently as you can.\nCarefully place tin on the middle shelf of the oven and bake for 10 mins. Scatter with remaining almonds. Decrease oven to 110C/90C fan/gas ¼ and bake for a further 35 mins. Turn off the oven, keep the door closed and leave cheesecake to cool for 1 hr. Open oven door and leave it ajar for another hour (you can use your oven gloves to wedge it open). Cool for a third hour at room temp, then cover and chill overnight.\nRemove from the tin and carefully peel off the parchment. Dust with icing sugar and serve with cream.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-851503_11-c14f7dd.jpg", "nutrients": {"calories": "740 calories", "fatContent": "51 grams fat", "saturatedFatContent": "27 grams saturated fat", "carbohydrateContent": "57 grams carbohydrates", "sugarContent": "37 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "13 grams protein", "sodiumContent": "0.9 milligram of sodium"}}