{"title": "Baked vegan cheesecake with raspberries & clementine", "time": 115, "yields": "8 serving(s)", "ingredients": ["100g unsalted cashews", "175g coconut cream", "150g vegan soft cheese", "1 tbsp cornflour", "2 tsp vanilla bean paste", "70ml maple syrup", "50g coconut oil, melted", "½ lemon, juiced", "200g raspberries", "2 tbsp caster sugar", "50g shelled pistachios, roughly chopped", "50g candied clementine peel", "200g porridge oats", "75g caster sugar", "4 tbsp coconut oil, melted"], "instructions": "Put the cashews in a large heatproof bowl and cover with boiling water from the kettle. Leave to soften for 1 hr.\nHeat the oven to 200C/180C fan/gas 6. Line the base of a 20cm (4cm deep) round cake tin with baking parchment. To make the base, put the oats, sugar and a pinch of salt in a food processor and blitz to a fine powder. Pulse in the coconut oil until combined, then gradually pulse in 3-4 tbsp water until it comes together into a dough – it should be crumbly, not sticky.\nPress the dough into the base and up the side of the tin using the back of a spoon. Bake for 20-25 mins until golden. Leave to cool.\nReduce the oven to 180C/160C fan/gas 4. Drain the cashews, then transfer to a blender along with the coconut cream, soft cheese, cornflour, vanilla, maple syrup, coconut oil, lemon juice and a pinch of salt. Blitz on high speed until the mixture is creamy and smooth.\nPour the cashew and soft cheese mixture over the base and bake for 1 hr-1 hr 15 mins until the edge is just coloured and the centre has mostly set with just a slight wobble. Leave to cool completely (it will sink slightly as it cools), then chill for at least 3 hrs, or overnight.\nPut the raspberries and sugar in a heatproof bowl and microwave for 1 min 30 seconds on high. Stir and leave to cool completely, then pour this over the cheesecake. Scatter over the pistachios and candied clementine peel. Will keep chilled for up to three days.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/11/Baked-vegan-cheesecake-da116a3.jpg", "nutrients": {"calories": "554 calories", "fatContent": "34 grams fat", "saturatedFatContent": "22 grams saturated fat", "carbohydrateContent": "52 grams carbohydrates", "sugarContent": "27 grams sugar", "fiberContent": "4 grams fiber", "proteinContent": "8 grams protein", "sodiumContent": "0.28 milligram of sodium"}}