{"title": "Blueberry swirl cheesecake", "time": 80, "yields": "14 serving(s)", "ingredients": ["300g digestive biscuit", "140g butter , melted", "275g golden caster sugar", "100g blueberry", "1 tsp cornflour", "3 x 300g packs full-fat cream cheese", "4 tbsp plain flour", "2 tsp vanilla extract", "3 large eggs", "200ml pot soured cream"], "instructions": "Heat oven to 200C/180C fan/gas 6. Line a 20 x 30cm rectangular tin with baking parchment. Put the biscuits in a food processor and blitz to a fine crumb. Add the butter and blitz again to combine. Tip into the tin, press down firmly with the back of a spoon to cover the base, then bake for 10 mins. Leave to cool.\nMeanwhile, tip 25g of the sugar and the blueberries into a small pan. Mix the cornflour with 1 tbsp cold water and add this to the pan. Heat gently until the sugar dissolves. Increase the heat and bubble for 1-2 mins until saucy. Set aside to cool.\nIn a large bowl, whisk the cream cheese with an electric hand-held whisk until smooth. Add the remaining sugar and whisk again. Add the flour, vanilla, eggs and soured cream, and whisk until smooth and well combined.\nPour half the cheesecake mixture over the biscuit base, then spoon half the blueberry sauce on top in small blobs. Cover with the remaining cheesecake mix and smooth the surface with a spatula. Drizzle the remaining blueberry sauce over the top, then use the end of the spoon to ripple it into the cheesecake. Bake for 10 mins, then lower the heat to 110C/90C fan/gas ¼ and bake for a further 30 mins. Turn off the oven and leave the cheesecake inside for 1 hr, then leave for 1 hr more with the door ajar. Finally, leave at room temperature until completely cool, then chill for at least 3 hrs or, even better, overnight. Slice into 14 bars. Will keep in the fridge for up to 5 days.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/cheesecake-4f3f6e3.jpg", "nutrients": {"calories": "606 calories", "fatContent": "47 grams fat", "saturatedFatContent": "28 grams saturated fat", "carbohydrateContent": "39 grams carbohydrates", "sugarContent": "24 grams sugar", "proteinContent": "6 grams protein", "sodiumContent": "1 milligram of sodium"}}