{"title": "Burnt Basque cheesecake", "time": 40, "yields": "15 serving(s)", "ingredients": ["butter, for the tin", "800g soft cheese", "225g caster sugar", "2 tbsp plain flour", "200g soured cream", "4 medium eggs", "2 tsp vanilla"], "instructions": "Heat the oven to 240C/220C fan/ gas 9 ensuring plenty of space above the middle shelf. Butter a deep 20cm, loose-bottom or springform cake tin. Lay two large sheets of baking parchment, one on top of the other, one sheet turned 45 degrees, so the corners point in different directions. Push the parchment into the tin, pressing into the corners and making sure plenty of paper is sticking out above the rim. Press the creases up the sides, but don’t worry about lining the tin too neatly – the grooves in the parchment give this cheesecake its characteristic look.\nTip the soft cheese and sugar into a large bowl or a stand mixer. Beat together using an electric whisk (or stand mixer) for a minute or 2, until the grains of sugar have dissolved – check this by rubbing a little of the mixture between your fingertips. If it feels grainy, keep mixing for another minute or so.\nTip in the flour, soured cream, eggs, vanilla and ¼ tsp salt to the bowl and mix again until you have a smooth consistency. Pour into your lined cake tin, scraping out every last bit of cheesecake mixture. Give the tin a sharp bang on the worktop to remove any air bubbles, then bake for 30 mins.\nOnce cooked, the cheesecake should be deeply caramelised on the outside and puffed up like a soufflé. It will still have a wobble when you shake the tin. Leave it to cool completely in the tin – it will sink as it cools. Chill for at least 1 hr before serving. Will keep in the fridge for up to two days.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2021/07/Burnt-Basque-cheesecake-8da80ff.jpg", "nutrients": {"calories": "252 calories", "fatContent": "17 grams fat", "saturatedFatContent": "11 grams saturated fat", "carbohydrateContent": "19 grams carbohydrates", "sugarContent": "17 grams sugar", "sodiumContent": "0.4 milligram of sodium"}}