{"title": "Caramel cheesecake", "time": 25, "yields": "8 serving(s)", "ingredients": ["50g unsalted butter", "140g plain digestive biscuit", "4 gelatine leaves (I used Supercook), cut into wide strips (or 1 x 11g sachet, see Know-how, below)", "400g crème fraîche", "100g light muscovado sugar", "50g dark muscovado sugar", "1 tsp vanilla extract", "400g ricotta", "50g fudge , finely sliced", "icing sugar , for dusting"], "instructions": "Gently melt the butter in a small pan over a low heat. Place the digestives in a plastic bag and crush to fine crumbs using a rolling pin; you can also do this in a food processor. Tip them into the pan with the melted butter, stir to coat, then transfer to a 20cm springform cake tin (9cm deep). Using the back of a spoon, press them into the base, making sure you seal the edges. Place in the fridge while you prepare the next stage.\nIf using leaf gelatine, place in a bowl, cover with cold water, soak for 5 mins, then drain. Pour 3 tbsp boiling water over the soaked gelatine and stir to dissolve. If using a sachet, see Know-how, below.\nPlace the crème fraîche in a small pan with the muscovado sugars and a pinch of sea salt, then gently heat, stirring constantly with a wooden spoon until the mixture liquefies and the sugar has dissolved. Give the mixture a quick whisk to get rid of any lumps. It should be warm, roughly the same temperature as the gelatine solution. Stir the gelatine and vanilla extract into the crème fraîche mixture, transfer to a bowl and cool.\nPlace the ricotta in a food processor and whizz until smooth, then add the crème fraîche mixture and whizz again. Pour this on top of the cheesecake base. Cover with cling film and chill overnight.\nRun a knife around the sides of the tin, then undo the clip and remove it. Transfer to a plate or leave the cheesecake on the base for ease of serving. Pile the fudge flakes in the centre and dust with icing sugar. Cover and chill until required.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-23000_11-19dc48b.jpg", "nutrients": {"calories": "498 calories", "fatContent": "35 grams fat", "saturatedFatContent": "22 grams saturated fat", "carbohydrateContent": "40 grams carbohydrates", "sugarContent": "30 grams sugar", "proteinContent": "8 grams protein", "sodiumContent": "0.59 milligram of sodium"}}