{"title": "Cheesecake biscuit beach", "time": 335, "yields": "20 serving(s)", "ingredients": ["375g slightly salted butter", "750g of assorted biscuits, plus extra for the surrounding sand (we used digestive, malted milk, shortbread and ginger biscuits)", "oil , for greasing", "500g full-fat cream cheese", "1 tbsp vanilla extract", "200g icing sugar", "300ml pot double cream", "10 waffle cones (we used Carousel cornets, available from Sainsbury’s)", "100g slightly salted butter , softened", "100g golden caster sugar", "100g self raising flour", "1 tsp vanilla extract", "2 eggs , beaten", "4 chocolate Flakes", "150g punnet raspberries", "hundreds and thousands , to decorate", "500g assorted biscuits", "ice cream , to serve (optional)"], "instructions": "First make your sandcastle and cheesecake icing. Gently heat the butter in a saucepan. Meanwhile, tip the biscuits into a food processor and pulse until you have fine, sand-like crumbs. Add the butter and blitz again until well combined. Set aside while you make the cheesecake icing.\nPut the cream cheese in a large bowl and, using an electric whisk, beat for a few secs until smooth. Add the vanilla extract, sift over the icing sugar and mix well. Pour in the cream and whisk until the mixture is smooth and thick enough to pipe. Transfer to a piping bag fitted with a large star nozzle.\nBrush your sandcastle mould with a little oil, then line the base with a circle of baking parchment. Fill with some of the buttery biscuit sand, so that it comes 2.5cm up the side, and pack down. To create a hole for the cheesecake icing centre to go into, find a glass that will sit on top of the biscuit sand in your mould, and leave about 1.5cm space around the edge. Grease the glass with a little oil and pop inside the sandcastle container. Pack more of the biscuit sand around the glass until the mould is full, then reserve any leftover sand. Chill for 1 hr. Give the glass a wiggle and remove from the mould – if it doesn’t come out easily, fill with hot water and leave for a few mins. Slide the glass out and tip the water away. Pipe icing into the cavity, dropping in a couple handfuls of raspberries as you go – make sure you reserve about 20 raspberries for decorating the cupcakes and filling the whole cone. Keep the remaining icing in the piping bag and chill. Tip in a little more buttery sand to cover the icing, packing the mixture firmly into the container, then chill for at least 1 hr or until set.\nMake the cone cakes. To make the mini cones and waffle cupcake cases, place a folded tea towel on your work surface and lay a waffle cone on top. Use the tea towel to support the cone and, with a serrated knife, gently score around the middle of the cone. Repeat with another 8 cones (you need to keep 1 cone whole for the top of the sandcastle). Very carefully cut each cone in half along the scored line, trying not to break or shatter them. You will end up with 9 mini cones from the bottom of the cone, and 9 waffle cupcake cases from the top of the cone. If any of the cones do shatter, just add them to the sand mix in step 7.\nHeat oven to 180C/160C fan/gas 4. To make the mini cone cakes, line a 12-hole muffin tin with 9 scrunched-up nests of foil. Place the mini cones into the centre of the foil nests and mould the foil around the tips to support them and keep them upright. Put 25g butter, 25g sugar, 25g flour, 1⁄4 tsp vanilla extract and 25g of the beaten egg into a large bowl. Using an electric whisk, beat together until everything is combined. Transfer the mixture to a disposable piping bag and snip off 1cm from the end. Pipe the mixture into the mini cones, making sure you only fill them three-quarters full, as the sponge will rise up in the oven – you may have a little mixture leftover. Bake for 10-12 mins until lightly golden and a skewer inserted into the centre comes out clean. Leave to cool.\nTo make the waffle cone cupcakes, line a 12-hole mini muffin tin with circles of baking parchment. Place the 9 waffle cupcake cases in the tin. Put the remaining 75g butter, 75g sugar, 75g flour, 3⁄4 tsp vanilla extract and the remaining beaten egg in a large bowl and beat together with an electric whisk until well combined. Transfer to a piping bag and use to fill the larger cone cases, again only filling three-quarters full. Bake for 18-20 mins until lightly golden and a skewer inserted into the centre comes out clean. Set aside to cool, remembering to peel off the discs of baking parchment before icing.\nNext make the biscuit sand. Now make the sand for your beach. Pulse the biscuits, and any broken cones, in a food processor until they resemble fine crumbs, then set aside. Cut 3 Flakes down to size so that you have half a Flake for the upturned ice cream, 9 medium pieces of Flake for the cupcakes, and mini pieces of Flake for the cones. Some Flakes may break so there’s spare – they’re easier to cut when they’re at room temperature.\nAssemble your beach scene. Once the cakes have cooled and the sandcastle has set, you’ll be ready to assemble the beach scene. Carefully turn the sandcastle out onto a clean surface or tray and surround with the biscuit sand. You’ll need to bash the bottom of the container with a rolling pin (or see tip, opposite) if your sandcastle doesn’t come out easily.\nPop a raspberry on each cupcake and pipe some icing over the top. Sprinkle with Hundreds & Thousands and insert a medium-sized piece of Flake. Pipe icing onto the mini cones, scatter with Hundreds & Thousands, and top with a mini Flake. Insert the mini cones and cupcakes into the sand, in and around the main sandcastle, using the sand to support them.\nTo make the upside-down cone, pipe some icing into your reserved whole waffle cone, dropping in the remaining raspberries as you go. Set the cone upside down on the top of the sandcastle and pipe icing around it to create the effect of a dropped ice cream. Sprinkle with Hundreds & Thousands and insert the half piece of Flake. Serve the biscuit beach with scoops of your favourite ice cream, if you like.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/beach-d8654ad.jpg", "nutrients": {"calories": "758 calories", "fatContent": "56 grams fat", "saturatedFatContent": "34 grams saturated fat", "carbohydrateContent": "57 grams carbohydrates", "sugarContent": "31 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "6 grams protein", "sodiumContent": "1.2 milligram of sodium"}}