{"title": "Chocolate orange cheesecake", "time": 115, "yields": "10 serving(s)", "ingredients": ["200g dark chocolate digestive biscuits, roughly broken", "75g butter, melted, plus extra for greasing", "4 large eggs", "2 large egg yolks", "2 x 280g tubs full-fat cream cheese", "150ml tub double cream", "140g golden caster sugar", "finely grated zest 1.5 oranges", "4 tbsp orange liqueur, such as Cointreau", "50g orange milk chocolate, grated", "50g almond milk chocolate, grated"], "instructions": "Lightly grease and line a 20cm springform cake tin. To make the base, put the biscuits and butter in a food processor, pulse into fine crumbs, then tip into the tin. Spread evenly over the base and press down firmly with the back of a spoon. Put the tin in the freezer and leave to set for 30 mins.\nPut a large piece of foil (extra-wide foil if possible) on the work surface, or criss-cross two pieces of small foil. Place the cake tin in the centre of the foil and bring up the sides to create a foil bowl around the cheesecake. Place in a medium-sized roasting tin.\nHeat oven to 180C/160C fan/gas 4. To make the filling, put the eggs and egg yolks in a food processor and blitz until well combined. Add the cheese, cream, sugar, orange zest and orange liqueur to the food processor and pulse until only just combined. Pour the cheesecake filling gently onto the chilled base.\nAdd enough just-boiled water to the roasting tin to rise roughly 2cm up the sides. Carefully place the roasting tin in the centre of the oven and bake for about 1 hr 15 mins. The cheesecake is ready when it is very lightly browned and only just set.\nTake out of the oven and sprinkle with the grated chocolate. Leave to cool in the water bath for 15 mins. Lift the cake tin from the water and leave to cool for a further 1 hr. Cover with cling film and chill the cheesecake overnight before serving.\nTo serve, run a round-bladed knife around the cheesecake and carefully release it from the tin. Using a palette knife, slide the cheesecake onto a flat serving plate or cake stand and cut into wedges to serve.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chocolate-orange-cheesecake-8a0cc9c.jpg", "nutrients": {"calories": "575 calories", "fatContent": "43 grams fat", "saturatedFatContent": "26 grams saturated fat", "carbohydrateContent": "33 grams carbohydrates", "sugarContent": "25 grams sugar", "proteinContent": "10 grams protein", "sodiumContent": "0.8 milligram of sodium"}}