{"title": "Cookie dough cheesecake", "time": 130, "yields": "15 serving(s)", "ingredients": ["sunflower or veg oil , for the tin", "200g milk chocolate , chopped", "100g dark chocolate , chopped", "500g soft cheese", "3 large eggs , at room temperature", "200g golden caster sugar", "200ml soured cream", "3 tbsp plain flour", "1 tsp vanilla paste", "225g light brown soft sugar", "225g golden caster sugar", "250g salted butter , softened", "2 egg yolks (freeze the whites for another recipe)", "2 tbsp vanilla paste", "3 tbsp milk", "225g plain flour", "225g self-raising flour", "200g dark chocolate chips", "100g dark chocolate , chopped", "100g milk chocolate , chopped", "300ml double cream", "2 tbsp caster sugar", "chocolate mini eggs , chocolate nests and white chocolate buttons (see tips, below)"], "instructions": "Line the base of a deep 20cm loose-bottomed cake tin with baking parchment, then line the sides using a strip of parchment that comes above the tin by about 7cm (as the cheesecake will rise in the oven). Lightly oil the parchment.\nMake the cookie dough by beating both sugars and the butter in a stand mixer for 5 mins, or until light and fluffy. Tip in the egg yolks, vanilla paste and milk, then beat again until well combined. Divide the mixture between two mixing bowls, then beat the plain flour into one half of the mixture and the self-raising into the other. Divide the chocolate chips between the two bowls and beat both again until the chocolate chips are evenly distributed. Will keep covered in the fridge for up to three days.\nPut the self-raising flour mixture in the fridge while you press the plain flour cookie dough into the base of your prepared cake tin. Keep chilled in the fridge while you prepare the rest of the cheesecake.\nHeat the oven to 180C/160C fan/gas 4. Line two baking sheets with baking parchment, then take the cookie dough made with the self-raising flour out of the fridge. Pinch pieces of the dough and roll into balls the size of marbles until you have used all the dough. Space them apart on the baking sheets and bake for 5-7 mins or until golden brown. Leave on a wire rack to cool.\nTo make the main part of the cheesecake, melt both the milk and dark chocolate pieces in a heatproof bowl set over a saucepan of barely simmering water, then set aside to cool down a little. Beat the soft cheese in a large bowl to loosen it, then beat in one egg at a time. Whisk in the sugar, soured cream, flour and vanilla for 5 mins or until light and frothy. Leave for 20 mins to come to room temperature, then slowly pour in the chocolate and gently fold it in until the mixture is even in colour.\nHeat the oven to 170C/150C fan/gas 3½. Remove the cake tin from the fridge and pour the chocolate and cheese mixture over the cookie dough base. Bake for 40 mins or until set on top with a slight wobble in the centre, then turn the oven off and leave the cheesecake inside to cool down slowly for 3 hrs (it will dip slightly in the middle). Chill in the fridge until completely cold.\nFor the ganache, put the dark and milk chocolate in a heatproof bowl. Put the cream and sugar in a saucepan and set over a medium heat until steaming (don’t let it boil), then pour over the chocolate. Whisk to melt the chocolate and create a smooth, glossy mixture. Chill in the fridge for 1 hr or until the ganache is thick and spoonable.\nWhen the cheesecake is cold, place on a serving plate or cake stand, then swirl over the ganache. Decorate with the choc chip cookies and some chocolate mini eggs, chocolate nests and white chocolate buttons, if you like.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/cookie-dough-cheesecake-c6a4b77.jpg", "nutrients": {"calories": "774 calories", "fatContent": "25 grams fat", "saturatedFatContent": "27 grams saturated fat", "carbohydrateContent": "81 grams carbohydrates", "sugarContent": "58 grams sugar", "fiberContent": "3 grams fiber", "proteinContent": "9 grams protein", "sodiumContent": "0.7 milligram of sodium"}}