{"title": "Double chocolate cheesecake", "time": 75, "yields": "16 serving(s)", "ingredients": ["85g hot melted butter , plus a little extra for greasing", "14 plain chocolate digestives, finely crushed", "3 x 300g packs full-fat Philadelphia cheese , at room temperature", "200g golden caster sugar", "4 tbsp cocoa , sifted", "2 tsp vanilla extract", "3 tbsp Tia Maria", "3 large eggs", "284ml pot soured cream", "100g bar dark coffee chocolate , melted (we used Lindt Excellence Coffee Intense)", "2-3 tbsp milk", "284ml pot double cream", "chocolate curls to decorate (optional)"], "instructions": "Heat oven to 180C/fan 160C/gas 4. Line the base of a 25cm springform tin with baking parchment. Mix the melted butter and biscuit crumbs until well blended, then press firmly onto the base of the tin. Bake for 10 mins.\nTurn oven temperature up to 240C/fan 220C/gas 9. Beat the cream cheese and sugar with an electric whisk until smooth and creamy, then whisk in the cocoa, vanilla, Tia Maria, eggs, soured cream and half the melted chocolate. Stir enough milk into the remaining chocolate to make a sauce consistency, then set aside until ready to decorate the cheesecake.\nPut a little melted butter on some kitchen paper and use it to butter the sides of the cake tin. Pour in the cheese mixture, then smooth the top. Bake for 10 mins, then turn the heat down to 110C/fan 90C/gas ¼ for 25-30 mins. The filling should be set, but with a wobble in the centre. Turn off the oven, open the door a crack, then leave the cheesecake to cool in the oven for 2 hrs. Chill until ready to serve.\nTo decorate the cheesecake, carefully remove it from the tin and strip the lining paper from the base. Lightly whip the cream until it just holds its shape, then swirl it on top and drizzle with the reserved chocolate sauce, rippling the sauce through the cream with the end of a spoon. Serve as is or pile with chocolate curls. To make the chocolate curls: run a swivel potato peeler firmly down the smooth back of a slab of chocolate so that curls of chocolate flake away from the bar.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-14393_11-919171e.jpg", "nutrients": {"calories": "490 calories", "fatContent": "39 grams fat", "saturatedFatContent": "22 grams saturated fat", "carbohydrateContent": "29 grams carbohydrates", "sugarContent": "23 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "7 grams protein", "sodiumContent": "0.88 milligram of sodium"}}