{"title": "Espresso martini cheesecake", "time": 50, "yields": "12 serving(s)", "ingredients": ["70g salted butter, plus extra for the tin", "100g dark chocolate digestive biscuits", "150g almond cantuccini or biscotti", "150g dark chocolate, chopped", "500g full-fat soft cheese", "180g icing sugar", "300ml double cream", "30ml espresso or strong coffee", "50ml coffee liqueur", "1 tsp vanilla bean paste, or 1 vanilla pod, split and seeds scraped out", "50ml coffee liqueur", "50ml espresso or strong coffee", "50g golden caster sugar", "200g soured cream", "30g chocolate-coated coffee beans"], "instructions": "Butter a 20 x 25 x 4.5cm loose- bottomed cake tin or a roughly 23cm loose-bottomed square cake tin and line with baking parchment. Melt the butter in a pan over a low heat, then pour into a large bowl and set aside.\nPut the digestive biscuits and cantuccini or biscotti in a food processor and blitz to fine crumbs. Alternatively, put them in a sealed sandwich bag and bash to crumbs with a rolling pin. Tip into the bowl containing the butter and stir to combine. Transfer the buttery crumbs to the prepared tin and firmly press into the base. Chill for 30 mins, or freeze for 10 mins.\nMelt the chocolate in a heatproof bowl set over a pan of simmering water, making sure the bottom of the bowl doesn’t touch the water. Stir until smooth, then leave to cool to room temperature, about 15 mins.\nDivide the soft cheese, icing sugar and double cream equally between two bowls. To one bowl, add the cooled melted chocolate and beat with an electric whisk until thick and creamy. To the second bowl, add the coffee, coffee liqueur and vanilla, and beat until thick and creamy, about 3-5 mins (the coffee mixture will not get quite as thick). Spoon the chocolate mixture over the biscuit base and level with a palette knife. Freeze for 30 mins, or until starting to firm up. Spoon over the coffee mixture, level the surface and return to the freezer for at least another 24 hrs. Will keep frozen, well covered, for up to two weeks.\nOn the day you want to serve the cheesecake, make the coffee syrup. Pour the coffee liqueur, coffee and sugar into a small saucepan. Bring to a simmer and cook for 5 mins, or until syrupy enough to coat the back of a spoon. Leave to cool completely.\nTake the cheesecake out of the freezer 1 hr before serving. Once defrosted, the cheesecake will keep in the fridge for up to three days. Spread the soured cream over the top, drizzle with the coffee syrup, then scatter over the coffee beans. Cut into 12 squares and serve straightaway (after about 5 mins the syrup will crack the soured cream).", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/10/Espresso-martini-cheesecake-698fda2.jpg", "nutrients": {"calories": "548 calories", "fatContent": "38 grams fat", "saturatedFatContent": "23 grams saturated fat", "carbohydrateContent": "40 grams carbohydrates", "sugarContent": "32 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "6 grams protein", "sodiumContent": "0.5 milligram of sodium"}}