{"title": "Eton mess cheesecake", "time": 20, "yields": "10 serving(s)", "ingredients": ["100g butter , plus extra for the tin", "200g digestive biscuits", "375g mascarpone", "420g full-fat cream cheese", "150g icing sugar , plus 2 tbsp for the strawberries", "1 vanilla pod , seeds scraped, pod reserved", "225ml double cream", "600g strawberries , hulled, larger ones cut in half", "1 tbsp balsamic vinegar", "10 shop-bought mini meringues", "edible flowers to decorate (optional)"], "instructions": "Butter a 20cm springform cake tin and line the base with baking parchment. Put the biscuits in a plastic bag and use a rolling pin to bash them into crumbs – or blitz in a food processor. Melt the butter, then stir it into the biscuit crumbs, mixing thoroughly. Tip into the tin, press down to create a firm layer and put in the fridge for 1 hr to set.\nUsing an electric whisk, beat the cheeses, sugar, vanilla seeds and a pinch of salt until thick and smooth. Pour in the double cream and whisk until only just combined. Spoon the filling onto the base, smooth the top and return to the fridge for at least 4 hrs or overnight.\nHalf an hour before serving, put the strawberries in a bowl with 2 tbsp icing sugar, the balsamic and scraped vanilla pod. Mix once, then leave the strawberries to soften slightly and release their juices. Push 1/4 of the strawberries through a sieve along with the juices to create a thick purée – or blitz in a food processor.\nTo serve, run a knife around the outside of the cheesecake, release it from the tin, then top with the strawberries dotted with the meringues, crushing some as you go. Drizzle over the purée and decorate with flowers, if using.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/eton-mess-cheesecake-2e7d0a8.jpg", "nutrients": {"calories": "669 calories", "fatContent": "52 grams fat", "saturatedFatContent": "32 grams saturated fat", "carbohydrateContent": "43 grams carbohydrates", "sugarContent": "33 grams sugar", "fiberContent": "3 grams fiber", "proteinContent": "6 grams protein", "sodiumContent": "0.8 milligram of sodium"}}