{"title": "Hot cross bun cheesecakes", "time": 55, "yields": "6 serving(s)", "ingredients": ["150g ginger biscuits", "25g sultanas", "25g mixed peel", "50g butter", "½ tsp cinnamon", "280g pack cream cheese", "25g caster sugar", "1 tsp vanilla extract", "½ tsp cinnamon", "100g mascarpone", "2 eggs , lightly beaten", "150g icing sugar", "½ orange , zest and juice"], "instructions": "Heat oven to 180C/160C fan/gas 4. Butter 6 x 150ml capacity ramekins. Place the ginger biscuits in a food processor and blitz until chopped into very small pieces then add the sultanas and mixed peel and blitz again just once or twice to combine.\nMelt the butter in a pan, then mix in the cinnamon followed by the biscuit mixture. Divide equally between the ramekins, so the base of each is covered with a layer about 1cm thick. Press down a little with the back of a teaspoon then bake them on a tray in the oven for 10 mins until crisp and golden. Leave to cool, then turn oven down to 150C/130C fan /gas 2.\nWhisk together all the cheesecake filling ingredients until smooth. Place the ramekins on a baking tray and pour some mixture into each one, filling to about 1cm below the rim. Carefully slide them into the oven and cook for 25-30 mins until just set. The mixture should still be ever so slightly wobbly when gently tapped. Don’t worry if it dips a little or cracks. Remove from the oven and leave to cool completely before covering with cling film and putting in the fridge. You can make to this point up to 2 days ahead.\nTo make the decoration, place the icing sugar into a large bowl and add enough orange juice to make a stiff paste. Transfer to a disposable piping bag and snip off the end. Run a small knife around the edge of the cheesecakes and turn them out onto a board so that the biscuit layer is facing upwards. Use the orange icing mixture to pipe a cross on the top of each one then use a cake slice or palette knife to place onto plates then sprinkle with the orange zest before serving.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/hot-cross-bun-cheesecake-473e493.jpg", "nutrients": {"calories": "533 calories", "fatContent": "31 grams fat", "saturatedFatContent": "19 grams saturated fat", "carbohydrateContent": "55 grams carbohydrates", "sugarContent": "44 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "7 grams protein", "sodiumContent": "0.9 milligram of sodium"}}