{"title": "Lemon meringue cheesecake", "time": 140, "yields": "14 serving(s)", "ingredients": ["rapeseed oil , for greasing", "300g pack ginger nuts , bashed to crumbs", "100g butter , melted", "3 x 280g tubs full-fat cream cheese", "300g golden caster sugar", "3 tbsp plain flour", "2 tsp vanilla extract", "zest 3 lemons , juice of 1", "3 large eggs , plus 1 yolk (save the white)", "300ml soured cream", "2 x 312g jars lemon curd (we used Tiptree)", "1 large egg , plus 3 large yolks (save the whites)", "juice 1 lemon", "3 tbsp plain flour", "4 large eggs whites (from above)", "300g caster sugar", "1 tbsp liquid glucose"], "instructions": "Heat oven to 160C/140C fan/gas 3. Grease a 25cm loose-bottomed or springform round tin with a little oil, and line the base and sides with a double layer of baking parchment. Mix the biscuit crumbs and melted butter, then press into the bottom of the tin. Bake for 10 mins.\nTo make the filling, beat the cream cheese for 1-2 mins with an electric hand whisk in your largest mixing bowl until creamy. Add the sugar, flour, vanilla, lemon zest and juice with a pinch of salt. Finally, whisk in the eggs and soured cream until blended. Pour the filling into the tin and tap a few times sharply on the counter to get rid of any bubbles. Bake for 40 mins.\nWhisk together the ingredients for the lemon layer. Gently spoon the mixture over the cheesecake and pop back in the oven for 40 mins more until firm at the edges but still a bit wobbly in the middle. Turn off the oven and leave the cheesecake in until it is cold, then chill for at least 2 hrs or overnight.\nA few hours before you want to serve, make the meringue. Put the egg whites in a big mixing bowl and put the sugar in a small saucepan with 100ml water and the liquid glucose. Place over a low-medium heat until the sugar has melted, then increase the heat and boil with a sugar thermometer in the pan. When the thermometer reaches 100C, beat the whites with an electric whisk until stiff peaks form. Keep boiling the sugar syrup until it reaches soft-ball stage – 113C on the thermometer. Remove from the heat and, while beating the whites, pour in the syrup in a slow, steady stream – avoid hitting the whisk blades. Keep beating until the meringue is stiff. Use a large spoon to pile on top of the cheesecake, then use a blowtorch to caramelise the meringue, or bake at 200C/180C fan/gas 6 for 5 mins or so. Chill until ready to serve.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/lemon-meringue-cheesecake-f27beae.png", "nutrients": {"calories": "767 calories", "fatContent": "38 grams fat", "saturatedFatContent": "22 grams saturated fat", "carbohydrateContent": "97 grams carbohydrates", "sugarContent": "73 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "8 grams protein", "sodiumContent": "0.9 milligram of sodium"}}