{"title": "Lime semifreddo cheesecake", "time": 30, "yields": "8 serving(s)", "ingredients": ["140g digestive biscuits , roughly broken", "75g butter , melted", "300g condensed milk", "200g full-fat cream cheese", "150ml double cream", "finely grated zest 3 limes , plus extra to serve", "3 tbsp lime juice (from 2 limes)", "200g fresh or frozen cranberries", "100g golden caster sugar", "1 tbsp ground arrowroot or cornflour"], "instructions": "Line a 900g loaf tin with a large piece of foil. Press down well into the base and sides of the tin, and leave plenty overhanging the edges. Put the biscuits in a freezer bag and bash to crumbs with a rolling pin. Mix with the melted butter and tip the crumbs into the prepared tin – press firmly into the base to create an even layer. Chill while the filling is made.\nUse an electric whisk on a medium setting to beat the condensed milk, cheese and cream together until smooth and thickened – this will take around 2 mins. Add the grated zest and juice, and beat slowly until the cheese mixture forms soft peaks.\nSpoon the lime mixture over the biscuit base. Cover lightly with the overhanging foil and seal firmly to keep out as much air as possible. Wrap in a second layer of foil, pop into a large freezer bag and freeze overnight.\nTo make the cranberry compote, put the cranberries, sugar and 150ml cold water in a saucepan and bring to a simmer. Cook for 5 mins, stirring occasionally, until the cranberries are softened but holding their shape. Mix the arrowroot or cornflour with 2 tbsp cold water until smooth, then stir into the fruit. Cook for another 2 mins, stirring regularly. Leave to cool, then cover and chill. Can be frozen at this stage.\nTurn out the frozen cheesecake onto a platter or board and leave to thaw for 30 mins, then carefully peel off the foil. Warm the cranberry compote gently and serve with the sliced semifreddo.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/lime-semifreddo-cheesecake-8cc4d6f.jpg", "nutrients": {"calories": "517 calories", "fatContent": "33 grams fat", "saturatedFatContent": "20 grams saturated fat", "carbohydrateContent": "48 grams carbohydrates", "sugarContent": "36 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "7 grams protein", "sodiumContent": "0.7 milligram of sodium"}}