{"title": "Peach streusel cheesecake", "time": 135, "yields": "12 serving(s)", "ingredients": ["vegetable oil, for the tin", "200g digestive biscuits", "2 tbsp caster sugar", "85g unsalted butter, melted", "700g cream cheese", "250g mascarpone", "280ml soured cream", "250g golden caster sugar", "3 large eggs", "1 tbsp vanilla bean paste", "3 tbsp plain flour", "115g plain flour", "60g light brown soft sugar", "1 tsp ground cinnamon", "45g unsalted butter, melted", "20g roasted hazelnuts, roughly chopped", "3 ripe, firm peaches", "30g light brown soft sugar", "1 lemon, juiced", "1 tsp vanilla bean paste"], "instructions": "Heat the oven to 180C/160C fan/gas 4. Oil and line a 20cm round springform, deep tin so that the parchment comes 5cm above the rim. Blitz the biscuits in a food processor to a fine crumb, or put in a tightly sealed sandwich bag and bash with a rolling pin. Tip into a bowl and stir through the sugar and butter, then tightly pack into the tin. Bake for 10 mins, then leave to cool completely.\nFor the streusel, mix together the flour, sugar, cinnamon and a pinch of salt in a large bowl. Gradually drizzle in the melted butter, stirring with a fork to combine, until the mixture has formed into clumps. Mix the streusel with the nuts and chill until needed.\nBeat together the cream cheese, mascarpone, soured cream, golden caster sugar, eggs and vanilla in a large bowl using a wooden spoon until smooth. Gently fold through the flour using a large metal spoon. Pour the mixture gently into the tin. Top with the streusel and bake for 1 hr-1 hr 15 mins or until set with a vigorous wobble in the middle. Turn off the oven and open the oven door, leave to cool for 2 hrs, then transfer to the fridge to chill overnight.\nDestone and slice the peaches into quarters. Line a roasting tin with baking parchment and put the peaches in the tin. Sprinkle over the sugar, lemon and vanilla, and cover with a layer of parchment. Bake for 15-20 mins or until soft but holding their shape. Leave to cool completely.\nGently push the cheesecake out of the tin and top with the peaches. Slice and serve. Will keep for three days in the fridge.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2021/05/Peach-streusel-cheesecake2-220cd28.jpg", "nutrients": {"calories": "698 calories", "fatContent": "44 grams fat", "saturatedFatContent": "26 grams saturated fat", "carbohydrateContent": "63 grams carbohydrates", "sugarContent": "42 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "10 grams protein", "sodiumContent": "0.7 milligram of sodium"}}