{"title": "Peach Melba cheesecake", "time": 30, "yields": "10 serving(s)", "ingredients": ["100g butter , melted, plus a little extra for the tin", "200g crunchy biscuit (we used Fox's butter biscuits)", "600g soft cheese", "100g icing sugar , plus extra to taste", "2 tsp vanilla extract", "300ml pot double cream", "450g raspberry", "3 really ripe peaches , peeled if you like, or 6 canned peach halves (juice saved), diced into raspberry-sized chunks"], "instructions": "Line the base and sides of a 20cm loose-bottomed or springform tin with baking parchment – use smudges of butter to help the paper stay in place around the sides. Put the biscuits in a plastic food bag and crush to crumbs using a rolling pin, then mix thoroughly with the melted butter. Tip into the prepared tin and press down firmly to create an even base. Chill while you prepare the filling.\nPut the soft cheese, icing sugar and vanilla in a bowl, then beat with an electric mixer until smooth. Tip in the cream and continue beating until mixture is combined. Scatter over 100g of the raspberries and half of the peach chunks. Using a spatula, fold in with just a few folds – as you assemble the cheesecake they’ll ripple through more.\nSpoon the cream mixture onto the biscuit base, working from the edges inwards. Smooth the top of the cheesecake down with the back of a dessertspoon or spatula. Leave to set in the fridge overnight.\nIn a food processor, blitz 250g of the remaining raspberries, sieve, stir back in 1 tsp of the seeds, if you like, and sweeten to taste with icing sugar. Add enough water or canned peach juice to make it saucy and chill until serving.\nBring the cheesecake to room temperature about 30 mins before serving. If using a loose-bottomed tin, unmould by placing on top of a can, then gradually pull down the sides of the tin. Slip the cheesecake onto a serving plate, removing the lining paper and base. Scatter the remaining raspberries and peach chunks over the cheesecake, dribble over some of the sauce and serve the rest alongside.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1030452_11-330e0c9.jpg", "nutrients": {"calories": "562 calories", "fatContent": "47 grams fat", "saturatedFatContent": "30 grams saturated fat", "carbohydrateContent": "28 grams carbohydrates", "sugarContent": "20 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "7 grams protein", "sodiumContent": "0.9 milligram of sodium"}}