{"title": "Pink strawberry cheesecake", "time": 45, "yields": "8 serving(s)", "ingredients": ["200g digestive biscuit", "100g unsalted butter , melted", "3 sheets of leaf gelatine", "142ml carton single cream", "300g full-fat soft cheese", "100g golden caster sugar", "finely grated zest of half a lemon", "3 tbsp lemon juice", "300g strawberry , hulled and chopped", "142ml carton whipping or double cream", "1 medium egg white", "250g strawberries , hulled and chopped, plus about 200g/8oz extra to decorate", "finely grated zest of half a lemon", "3 tbsp lemon juice", "2 tbsp golden caster sugar , or more to taste"], "instructions": "Seal the biscuits in a plastic bag and crush them to fine crumbs with a rolling pin. Tip into a bowl and stir in the melted butter, mixing thoroughly so that all the crumbs are soaked. Now tip the mixture into a loose-bottomed 24cm round cake tin, at least 5cm deep, and press down with the back of a metal spoon to make an even layer over the bottom of the tin. Chill in the fridge while you make the filling.\nSubmerge the gelatine leaves in a dish of cold water, and leave to soak and soften for 5 minutes. Pour the single cream into a pan and bring just to the boil, then take off the heat. Take the gelatine leaves out of the water, give them a good squeeze to get rid of excess water, and stir one by one into the cream (they will dissolve instantly). Leave to cool for a few minutes.\nBeat the cheese in a bowl with the sugar, lemon zest and juice until smooth and creamy. Mix in the cream and gelatine mixture and the chopped strawberries.\nIn another bowl, lightly whip the whipping or double cream so it falls in soft peaks, then fold it into the strawberry mixture. Whisk the egg white in a clean bowl until it forms stiff peaks, then fold gently into the cheese mixture. Pour into the cake tin and smooth down lightly. Chill for at least 21⁄2 hours until set.\nTo make the sauce, blitz all the ingredients in a food processor or blender. Taste and add more sugar if needed, then pour into a jug and keep in the fridge until you’re ready to serve. (Both cheesecake and sauce can be made a day ahead.)\nTo serve, run a knife between the cheesecake and the tin to loosen it, remove it from the tin, then take it off its base and put it on a serving plate. Halve the extra strawberries lengthways, pile them in the middle and serve with the jug of sauce.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-22873_11-c139b9f.jpg", "nutrients": {"calories": "519 calories", "fatContent": "38 grams fat", "saturatedFatContent": "15 grams saturated fat", "carbohydrateContent": "40 grams carbohydrates", "sugarContent": "21 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "8 grams protein", "sodiumContent": "0.78 milligram of sodium"}}