{"title": "Pumpkin cheesecake", "time": 145, "yields": "14 serving(s)", "ingredients": ["80g butter, melted, plus extra for the tin", "275g digestive or ginger biscuits", "1 large egg white (use the egg yolk in the filling, below)", "800g full-fat soft cheese", "425g can pumpkin purée", "200g light brown soft sugar", "50g plain flour", "5 large eggs, plus 1 large yolk", "400ml whipping cream", "ground cinnamon or pumpkin spice, for dusting", "25g pecans, chopped", "3 tbsp caramel sauce"], "instructions": "Heat the oven to 220C/200C fan/gas 7. Butter a deep 22cm loose-bottomed cake tin and line with baking parchment. Wrap the base and side of the tin with three layers of cling film, followed by three layers of foil (this helps keep it waterproof during baking). Fold a clean tea towel and put it in the base of a large roasting tin.\nBlitz the biscuits to crumbs in a food processor. Add the melted butter and pulse to coat the crumbs. Tip the mixture into the prepared cake tin, spreading up to the side and pressing down with the back of a spoon. Bake for 10 mins. Remove from the oven, brush with the egg white and bake for another 3 mins (this will help stop the base from becoming soggy).\nTo make the filling, put the soft cheese in a bowl or the bowl of a stand mixer, and beat with an electric whisk or the mixer until loosened. Add the pumpkin purée, sugar and flour and beat again until combined. With the motor running, gradually add the eggs and egg yolk until the mixture is smooth and creamy. Pour the filling over the baked biscuit base, then sit the cake tin on the tea towel in the roasting tin. Pour a kettleful of just-boiled water into the roasting tin so the water comes halfway up the side of the cake tin.\nBake for 10 mins, then reduce the oven temperature to 110C/90C fan/gas ¼. Bake for a further 1 hr 30 mins until the cheesecake is set with just a slight wobble in the middle when you gently shake the tin. Turn off the oven, then open the oven door slightly and leave the cheesecake to cool inside for 2 hrs until completely cool. Remove from the oven and chill overnight.\nCarefully remove the cold cheesecake from the tin and transfer to a cake stand or serving plate. Whip the cream to soft peaks using an electric whisk, and spoon in big dollops over the cheesecake. Dust with a little cinnamon or pumpkin spice, sprinkle over the chopped pecans and drizzle with the caramel sauce before serving.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/10/Pumpkin-Cheese-Cake-e52ba8f.jpg", "nutrients": {"calories": "396 calories", "fatContent": "25 grams fat", "saturatedFatContent": "14 grams saturated fat", "carbohydrateContent": "32 grams carbohydrates", "sugarContent": "20 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "9 grams protein", "sodiumContent": "0.87 milligram of sodium"}}