{"title": "Rainbow cheesecake", "time": 90, "yields": "12 serving(s)", "ingredients": ["170g butter , plus extra for the tin", "140g Oreo biscuits (or similar) cream removed", "140g digestive biscuits , crushed to fine crumbs", "600g full-fat soft cheese", "170g golden caster sugar", "2 tbsp plain flour", "1½ tsp vanilla extract", "2 large eggs", "200g soured cream", "gel food colourings (red, orange, yellow, green, blue and purple)", "double cream , whipped to decorate (optional)"], "instructions": "Heat the oven to 180C/160C fan/gas 4. Line the base of a 20cm springform tin with a square piece of baking parchment or foil, then clip the side on, so the paper or foil is secure and the excess sticks out.\nFor the base, melt 85g of the butter in a medium pan. Stir in the dark biscuit crumbs so the mixture is evenly damp and firmly press into the bottom of the tin. Melt the remaining butter and stir in the digestive crumbs. Firmly press on top of the first layer, then bake for 10 mins. Leave to cool.\nMeanwhile, increase the oven temperature to fan 220C/200C fan/gas 7. For the filling, whisk the soft cheese with the sugar, flour, vanilla extract and a pinch of salt. Whisk in the eggs and soured cream but don’t over-beat. The batter should be smooth and very thick. Divide the filling equally between six bowls and colour each one (purple, blue, green, yellow, orange and red).\nButter the sides of the tin and put on a baking sheet. Spoon in the red filling and carefully spread it out in an even layer, then repeat with the orange, yellow, green, blue and finally, purple. Bake for 10 minutes.\nReduce the oven temperature to 110C/90C fan/gas 1 /4 and bake for 35-40 mins more. If you gently shake the tin, the filling should have a very slight wobble in the centre; if it looks liquid, cook for another 5 mins. Turn off the oven and cool with the door slightly ajar. Chill the cooled cheesecake until you want to serve it. Will keep in the fridge for up to three days. Decorate just before serving.\nWhip the cream until thick and just holding its shape. Use a piping bag fitted with a star nozzle to pipe blobs or rosettes on top of the cheesecake around the edge. You can also make rainbow rosettes, with the gel colourings by first using a paint brush to paint stripes down the inside of the piping bag.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/rainbow-cheesecake-228ad61.jpg", "nutrients": {"calories": "461 calories", "fatContent": "33 grams fat", "saturatedFatContent": "19 grams saturated fat", "carbohydrateContent": "34 grams carbohydrates", "sugarContent": "23 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "6 grams protein", "sodiumContent": "0.89 milligram of sodium"}}