{"title": "Rhubarb & gingernut cheesecake", "time": 45, "yields": "10 serving(s)", "ingredients": ["500g forced rhubarb , chopped into 4cm lengths", "150g caster sugar", "1 blood orange , zested and juiced", "1 vanilla pod", "100g butter , melted, plus extra for the tin", "200g gingernut biscuits", "500g mascarpone or soft cheese", "100g quark or thick natural yogurt", "1 tbsp pistachios , chopped"], "instructions": "Heat oven to 200C/180C fan/gas 6. Line a large baking tray with baking parchment and fill with the rhubarb. Scatter over the sugar and orange zest and pour over the juice. Scrape the seeds from the vanilla pod in there too, throwing the spent pod on top. Cover with foil and roast for 20 mins. Remove from the oven. Purée a third of the rhubarb, reserving the rest for the top.\nButter a 20cm springform cake tin and line it with baking parchment. To make the base, put the biscuits in a bag and smash them with a rolling pin, or put them in a food processor and grind to crumbs. Tip into a mixing bowl, and stir in a pinch of sea salt. Pour the butter over the crumbs. Mix it together with a fork and tip it into the tin. Tap the side of the tin with your hand to even the crumbs out, and gently compress it with the back of a large spoon until it’s packed in and level. You want it fairly well packed so that it holds together. Put in the fridge to chill.\nTo make the filling, put the cheese and quark or yogurt into a mixing bowl, or the bowl of a stand mixer, and beat it together. Mix until combined and thickened, then fold through the rhubarb purée.\nPile the mixture on top of the biscuit base and smooth it down. Cover with cling film and chill overnight until set. Remove the rhubarb from its syrup with a slotted spoon, tip the syrup into a pan and bring to the boil. Reduce for about 3-5 mins until the syrup is more concentrated. Allow to cool.\nCarefully remove the cheesecake from its tin. Pile the rhubarb on top and drizzle over some syrup (you can save the rest for drizzling over porridge), then scatter with the pistachios to serve.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/cheesecake-3b4b65e.jpg", "nutrients": {"calories": "466 calories", "fatContent": "34 grams fat", "saturatedFatContent": "21 grams saturated fat", "carbohydrateContent": "33 grams carbohydrates", "sugarContent": "24 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "6 grams protein", "sodiumContent": "0.5 milligram of sodium"}}