{"title": "Salted caramel cheesecake", "time": 65, "yields": "12 serving(s)", "ingredients": ["50g butter, melted, plus extra for the tin", "200g chocolate digestives", "750g (3 tubs) cream cheese", "300g caramel sauce (dulce de leche) from a tin or jar", "1 tsp vanilla extract", "150g golden caster sugar", "2 tbsp plain flour", "4 medium eggs"], "instructions": "Heat oven to 180C/160C fan/gas 4. Butter a 23cm springform cake tin and line the base with baking parchment. Tip the biscuits into a food processor, blitz to crumbs and pour in the melted butter. (You could also tip the biscuits into a bag, bash with a rolling pin into crumbs and mix in the butter.) Press the biscuit mixture into the base of the tin – the easiest way to do this is by flattening it with your hand under a sheet of cling film. Place the tin on a tray and bake for 10 mins, then remove from the oven to cool.\nMeanwhile, scrape the cream cheese into a bowl with 3 tbsp of the caramel sauce, the vanilla, sugar and flour, and beat until smooth. Beat in the eggs, one at a time, until you have a thick, smooth custard consistency. Tip over the base, scraping the bowl clean, and bake in the oven for 10 mins. Reduce the temperature to 140C/120C fan/gas 1 and continue to bake for 25-30 mins until there is a slight wobble in the centre. Turn off the heat and leave the door just slightly ajar – a tea towel holding the door open is ideal. This should leave you with a completely smooth top, but if there are a couple of small cracks, don’t worry. Leave the cheesecake in the oven until completely cool (overnight is fine), then chill until needed. Will keep in the fridge for two days.\nOn the day, loosen the sides of the cheesecake from the tin with a knife and remove the base (although I usually serve it straight from the tin base). Add a large pinch of flaky sea salt to the rest of the caramel sauce, then spoon it over the cake and swirl with the back of the spoon. The cheesecake will sit happily on a stand at room temperature for a couple of hours. Just before serving, sprinkle with extra sea salt, if you like.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/salted-caramel-cheesecake-9ba0ecf.jpg", "nutrients": {"calories": "435 calories", "fatContent": "26 grams fat", "saturatedFatContent": "16 grams saturated fat", "carbohydrateContent": "41 grams carbohydrates", "sugarContent": "31 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "9 grams protein", "sodiumContent": "0.7 milligram of sodium"}}