{"title": "Spiced maple & pecan cheesecake bars", "time": 90, "yields": "14 serving(s)", "ingredients": ["250g pack ginger nut biscuits", "140g salted butter , melted", "200g pecans", "3 x 250g tubs cream cheese", "300ml pot soured cream", "150ml maple syrup (buy a 330ml bottle)", "85g light muscovado sugar", "3 medium eggs", "2 tsp vanilla extract", "4 tbsp plain flour", "2 tsp ground cinnamon", "½ whole nutmeg , grated", "remaining maple syrup (roughly 175ml)", "100g salted butter", "3 tbsp light muscovado sugar", "100g pecans , roughly broken"], "instructions": "Heat oven to 200C/180C fan/gas 6. Line a 20 x 30cm brownie tin with baking parchment – if using a loose-bottomed tin, make sure you line it really well, as the cheesecake mixture is very runny (this recipe will also work in a deep 23cm cake tin). Put the biscuits in a food processor and blitz to fine crumbs, add the butter and pecans, and blitz again until well combined and the pecans are finely chopped but still have a little texture. Tip into the baking tin and press to an even, compact layer with the back of a spoon. Bake for 10 mins, then remove from the oven and set aside to cool.\nBeat the cream cheese and soured cream in a large bowl until smooth and combined. Add the maple syrup, sugar, eggs, vanilla, flour and spices, and blend again until smooth. Pour onto the biscuit base, put in the centre of the oven and bake for 15 mins.\nLower the heat to 110C/90C fan/gas 1/2 and continue cooking for a further 30 mins. Turn off the oven and leave the cheesecake inside for 1 hr, then leave for 1 hr more with the door ajar. Finally, leave at room temperature until completely cool, then chill for at least 3 hrs or, even better, overnight.\nTo make the topping, melt the remaining maple syrup with the butter, sugar and a good pinch of salt. Bubble for 2-3 mins, then stir in the pecans and leave to cool and thicken a little. Before serving, remove the cheesecake from the tin, spoon the maple-pecan caramel over the top of the cheesecake (reheat it if it’s started to set too much), then cut into bars. Leftovers will keep in the fridge for up to 3 days.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/spiced-maple-pecan-cheesecake-bars-990ddca.jpg", "nutrients": {"calories": "682 calories", "fatContent": "55 grams fat", "saturatedFatContent": "28 grams saturated fat", "carbohydrateContent": "40 grams carbohydrates", "sugarContent": "28 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "7 grams protein", "sodiumContent": "0.8 milligram of sodium"}}