{"title": "Tea & biscuits cheesecake bars", "time": 50, "yields": "14 serving(s)", "ingredients": ["10 Yorkshire tea bags , or another good strong tea", "400ml double cream", "500g mascarpone cheese", "280g cream cheese (not low fat)", "150g icing sugar", "1 tsp vanilla extract", "400g digestive biscuits , plus extra to serve", "200g butter , melted", "50g butter", "100g light brown sugar", "cook’s muslin"], "instructions": "Cut open the tea bags and tip the contents into a jug. Pour over 100ml boiling water, brew for a few mins, then scrape this mixture into a muslin cloth and tie to create a giant tea bag. Pour 300ml double cream into a pan and add the muslin tea bag. Bring to a simmer, then immediately remove from the heat and put in the fridge to chill and infuse.\nMeanwhile, make the base. Blitz the biscuits to crumbs, then pour in the melted butter and pulse again to combine. Tip into a lined 20 x 30cm brownie tin, preferably loose bottomed. Spread and press down firmly with the back of a spoon. Put in the fridge alongside the infusing cream and make yourself a nice cup of tea while you wait.\nTo make the cheesecake, use an electric whisk to beat the cheeses, icing sugar, vanilla and a pinch of salt until thick and smooth. Remove the giant tea bag from the double cream, squeeze gently and discard. Pour 200ml into the cheesecake mix and whisk until just combined, reserving the remaining tea-infused cream for the biscuit sauce.\nWhisk the remaining 100ml double cream (which has not been infused) until it holds soft peaks, then fold gently into the cheesecake mixture. Tip onto the top of the base, spread with a spatula and smooth the top. Return to the fridge to set for at least 4 hrs or overnight.\nTo make the sauce, melt the butter in a pan over a medium heat, cook, whisking constantly, for 2-3 mins until it’s browning and smelling really nutty. Take off the heat, add the sugar and whisk, then add the remaining 100ml infused cream and a big pinch of salt and cook for 2 mins. This is best served warm, so if you’re making it ahead, leave to cool then reheat with a splash more cream.\nTo serve, drizzle over the warm sauce, and top with some crushed biscuits. Use a warmed knife to slice into 12 bars. Leftovers will keep in the fridge for up to three days.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/tea-biscuits-cheesecake-bars-4701f29.jpg", "nutrients": {"calories": "688 calories", "fatContent": "57 grams fat", "saturatedFatContent": "35 grams saturated fat", "carbohydrateContent": "38 grams carbohydrates", "sugarContent": "5 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "5 grams protein", "sodiumContent": "0.9 milligram of sodium"}}