{"title": "Tropical cheesecake bars", "time": 90, "yields": "14 serving(s)", "ingredients": ["200g ginger biscuits", "200g digestive biscuits", "200g butter , melted", "3 x 280g cream cheese", "200g caster sugar", "50g plain flour", "zest 1 lemon", "3 large eggs , beaten", "200ml double cream", "100g fresh mango , chopped into small cubes", "4 passion fruits", "3 tbsp lemon curd", "50g mango and pineapple slices", "mint leaves"], "instructions": "Heat oven to 200C/180C fan/gas 6. Line the base and sides of a 20 x 30cm rectangular tin with baking parchment. Put the biscuits into a large food bag and bash with something heavy like a rolling pin, alternatively blitz in a food processor. Put the biscuit crumbs into a large bowl and pour over the melted butter, stir well to combine then tip into your prepared tin. Press the mixture down well with the back of a spoon to form a compressed layer. Bake in the preheated oven for 10 mins. Take it out of the oven to cool and turn the oven down to 120C/100C fan/gas ½.\nIn another large bowl whisk together the remaining cheesecake ingredients until smooth, you can do this with electric beaters or with a balloon whisk. Pour onto the biscuit base then scatter over the mango pieces here and there, pushing some of them into the cheesecake and letting others sit proud on the surface. Bake for 1hr then prop the oven door open and leave to cool for a further 30 mins. Once cold, chill the whole cheesecake in the fridge overnight.\nWhen you’re ready to serve, push the passion fruit flesh through a sieve to get rid of the seeds then mix the resulting pulp with the lemon curd. Drizzle the mixture over the cheesecake and decorate with fresh mango, pineapple and mint leaves.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/cheesecake-bars-09a24de.jpg", "nutrients": {"calories": "567 calories", "fatContent": "41 grams fat", "saturatedFatContent": "24 grams saturated fat", "carbohydrateContent": "42 grams carbohydrates", "sugarContent": "27 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "7 grams protein", "sodiumContent": "1.1 milligram of sodium"}}