{"title": "White chocolate berry cheesecake", "time": 385, "yields": "8 serving(s)", "ingredients": ["2 x 150g bars white chocolate", "2 x 300g tubs soft cheese (we used Philadelphia)", "284ml pot double cream", "50g caster sugar", "170g punnet raspberries", "5 tbsp raspberry jam", "85g amaretti biscuits", "200g small strawberries", "a few blueberries (optional)"], "instructions": "Break the chocolate into a glass bowl, then put it over a pan of just simmering water to melt, making sure the bottom of the bowl doesn’t touch the water. Line a lightly oiled 900g loaf tin with cling film.\nWhisk the cheese, cream and sugar together, preferably with electric beaters, then stir into the almost-cool melted white chocolate until well combined.\nStir 50g raspberries with 2 tbsp of the jam. Spoon half the cheese mixture into the loaf tin, then spoon the jammy raspberries down the centre. Top with the rest of the cheese mixture, level the top, then press in the biscuits. Cover and chill for 6 hrs or overnight.\nSet aside about 6 strawberries. Halve the rest, then warm in a pan with the remaining jam until soft. Whizz in a food processor or with a hand blender, then rub through a sieve to remove the seeds and make a sauce. Add a drop of water if the sauce is too thick.\nTo serve, carefully turn the tin onto a plate, lift it away and strip off the cling film. Halve the remaining strawberries, then arrange on top of the cake with the remaining raspberries and blueberries (if using). Pour over a little sauce and serve the rest separately for drizzling over.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-45905_12-243db72.jpg", "nutrients": {"calories": "667 calories", "fatContent": "50 grams fat", "saturatedFatContent": "29 grams saturated fat", "carbohydrateContent": "49 grams carbohydrates", "sugarContent": "44 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "9 grams protein", "sodiumContent": "1.01 milligram of sodium"}}