{"title": "White chocolate & raspberry ripple baked cheesecake", "time": 130, "yields": "10 serving(s)", "ingredients": ["225g digestive biscuits", "15g freeze-dried raspberries (optional)", "115g butter, melted", "250g fresh or frozen raspberries", "½ lemon, juiced", "175g caster sugar, plus 2 tsp", "600g full-fat soft cheese", "3 large eggs, plus 2 egg yolks", "175g double cream", "1 tbsp vanilla bean paste", "350g white chocolate"], "instructions": "Heat the oven to 180C/160C fan/gas 4, and line the base of a 23cm springform cake tin with baking parchment. Tip the biscuits and freeze-dried raspberries, if using, into a food processor, and blitz to fine crumbs. Pulse in the butter to coat the crumbs, then tip the mixture into the prepared tin and press into an even layer using the back of a spoon. Chill until needed.\nFor the filling, put the raspberries, lemon juice and 2 tsp caster sugar in a pan over a medium heat. Cook for 4-5 mins until the berries have softened and become juicy. Transfer to a food processor and blitz until smooth. Tip into a bowl and leave to cool. If you prefer a smooth purée, sieve the mixture through a fine mesh sieve and discard the pips.\nBeat the soft cheese using an electric whisk until loosened, then whisk in 175g sugar, the eggs, yolks, cream and vanilla until smooth. Melt the white chocolate in a heatproof bowl in the microwave in 20-second bursts, or over a pan of simmering water, ensuring the bottom of the bowl doesn’t touch the water. Slowly pour a third of the sweetened soft cheese mixture into the melted chocolate, whisking continuously until combined, then pour that into the rest of the soft cheese mixture. Whisk until fully combined.\nRemove the tin from the fridge, and tightly wrap the bottom of the tin with foil to prevent any leaking. Sit the tin in a deep roasting tin. Pour the cheesecake mixture over the biscuit base. Spoon over the raspberry purée, and swirl it into the cheesecake mix using a skewer.\nPut the roasting tin in the oven, then pour enough hot water into the roasting tin to come 2½cm up the side of the cake tin. Bake for 1 hr 15 mins-1 hr 30 mins, or until the edge of the cheesecake is set, but the centre has a slight wobble (it will continue to set in the fridge).\nPut the tin on a wire rack, then run a small, sharp knife around the edge. Leave to cool completely in the tin, then chill for at least 6 hrs before removing from the tin.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2021/03/White-chocolate-and-raspberry-ripple-baked-cheesecake-2c6ebf3.jpg", "nutrients": {"calories": "741 calories", "fatContent": "52 grams fat", "saturatedFatContent": "30 grams saturated fat", "carbohydrateContent": "56 grams carbohydrates", "sugarContent": "46 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "11 grams protein", "sodiumContent": "1.1 milligram of sodium"}}