{"title": "White chocolate, mascarpone & pistachio cheesecake", "time": 80, "yields": "12 serving(s)", "ingredients": ["butter , for the tin", "100g white chocolate", "200g digestive biscuits , crushed", "500g mascarpone", "200g full-fat yogurt", "3 eggs", "100g caster sugar", "1 lemon , zested, 1/2 juiced", "½ tsp vanilla bean paste", "50g shelled pistachios , roughly chopped", "1 tbsp icing sugar (optional)", "mixed berries , to serve (optional)"], "instructions": "Line the base of a deep 20cm springform cake tin with baking parchment and butter the base and sides. Melt the white chocolate in a large heatproof bowl set over a pan of just simmering water (ensure the bottom of the bowl doesn’t touch the water). Alternatively, melt the chocolate in a microwave in short bursts. When the chocolate is completely smooth, stir in the biscuits and a small pinch of salt. Press into the base of the tin, all the way to the edges, ensuring the base is even. Put in the fridge to chill for at least 20 mins.\nHeat the oven to 140C/120C fan/gas 1. Beat the mascarpone, yogurt, eggs, caster sugar, lemon zest and juice and vanilla bean paste together with an electric whisk until smooth, then tip over the biscuit base. Transfer the tin to a baking tray and bake for 45 mins until almost set, with just a slight wobble in the middle. Turn the oven off with the cheesecake inside, and leave the door ajar. Leave the cheesecake to cool completely.\nOnce completely cool and set, loosen the sides and base of the tin with a knife, and carefully transfer the cheesecake to a serving plate. Scatter over the pistachios and dust with the icing sugar, then serve with the berries on the side.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/white-chcoloate-marscapone-and-pistachio-cheesecake-661ace2.jpg", "nutrients": {"calories": "399 calories", "fatContent": "28 grams fat", "saturatedFatContent": "16 grams saturated fat", "carbohydrateContent": "28 grams carbohydrates", "sugarContent": "20 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "7 grams protein", "sodiumContent": "0.4 milligram of sodium"}}