{"title": "Barbecued chicken fajita skewers", "time": 40, "yields": "8 serving(s)", "ingredients": ["2 limes , plus wedges to serve", "1 tsp dried oregano", "1 tsp ground cumin", "1 tsp smoked paprika", "1 tsp olive oil", "2 garlic cloves , crushed or finely grated", "4 chicken breasts", "3 mixed coloured peppers", "1 red onion", "2 ripe avocados", "1 lime", "6 cherry tomatoes , halved", "warmed tortillas , chopped coriander, soured cream or yogurt, plus chilli sauce for the grown-ups, to serve"], "instructions": "Make the marinade. In a large bowl, juice both the limes. Add the oregano, spices, olive oil and garlic, and mix together. Dice the chicken, then get your child to stir it through the marinade, and set aside.\nPrepare the vegetables. Deseeding the peppers and halving the onion is tricky, so do this yourself. Children aged from about seven or above can cut them into chunks using a child-friendly knife.\nMake your skewers. Carefully thread alternate pieces of chicken, peppers and onion onto your skewers. Smaller children might find this a little hard, so the best way is to stab the ingredients and push them up the skewers. When you've used up all the ingredients, set aside. Can be made several hours ahead and chilled until ready to cook.\nPrepare the guacamole. Stone and peel the avocados, then tip into a bowl with the other ingredients. Get your child to use a potato masher to mash everything together and tip into a serving dish.\nCook the skewers. Heat a barbecue or griddle pan. Cook the skewers for 10-12 mins, turning, until they are cooked all the way through. A child from the age of eight can watch over a griddle and turn the skewers with a pair of tongs. Serve the skewers on heated tortillas with the guacamole, soured cream, chopped coriander, lime wedges on the side and chilli sauce for those who like a touch of spice.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/fajiyas-8436bbe.png", "nutrients": {"calories": "365 calories", "fatContent": "18 grams fat", "saturatedFatContent": "4 grams saturated fat", "carbohydrateContent": "14 grams carbohydrates", "sugarContent": "11 grams sugar", "fiberContent": "8 grams fiber", "proteinContent": "34 grams protein", "sodiumContent": "0.2 milligram of sodium"}}