{"title": "Lighter chicken tacos", "time": 60, "yields": "4 serving(s)", "ingredients": ["2 tsp rapeseed oil", "1 tsp ground cumin", "1 tsp smoked paprika", "450g skinless chicken breasts, preferably organic", "4 medium tomatoes, preferably on the vine, halved", "1 red pepper, quartered", "1 small red onion, cut into 8 wedges", "¼ tsp rapeseed oil", "2 tsp lime juice", "¼ tsp ground cumin", "good pinch of chilli flakes", "2 medium-sized ripe avocados, stoned, peeled and roughly chopped", "4 tsp lime juice", "2 spring onions, ends trimmed, finely chopped", "3 tbsp chopped coriander", "good pinch of chilli flakes", "8 corn tacos shells", "8 tsp 0% Greek yogurt", "2 Little Gem lettuces, shredded", "chopped coriander", "lime wedges, for squeezing over"], "instructions": "Mix the oil with the cumin and paprika on a large plate. Sit the chicken on the plate and rub the spiced oil all over it. Season with pepper and a pinch of salt, then cover and set aside while you prepare the salsa.\nHeat the grill to high for 10 mins. Meanwhile, line a large baking tray with foil and lay the tomatoes (cut-side up) on it, along with the pepper and red onion. Brush the oil over the onion, and season the tomatoes and onion with pepper. Grill for 12-15 mins, turning the tomatoes and onion halfway through, until well charred. Remove (leaving the grill on) and set aside to cool – put the pepper in a bowl and cover with cling film so that it’s easier to skin later.\nFor the guacamole, put the avocado in a bowl and briefly mash with a fork, leaving some chunky pieces for texture. Gently mix in the lime juice, spring onions, coriander and chilli flakes. Season with pepper and a pinch of salt.\nRe-line the baking tray with foil and lay the chicken on it, plump-side up. Grill for about 10 mins until cooked – there is no need to turn it. Meanwhile, scoop out and discard as much of the seeds and juice from the tomatoes as you can (so the salsa isn’t too wet), leaving the pulp and charred skin. When the pepper is cool enough to handle, peel off and discard the skin. Chop the tomatoes and onion, and dice the pepper. Combine in a bowl with the lime juice, cumin, chilli flakes, some pepper and a pinch of salt.\nWhen the chicken is cooked, remove from the grill, cover loosely with foil and set aside for 5 mins.\nHeat oven to 180C/160C fan/gas 4. Cut the chicken into chunky slices and spoon over the juices. When ready to serve, lay the taco shells on a baking sheet and warm through for 2-3 mins. Serve the chicken, taco shells, yogurt, lettuce, coriander and lime wedges in separate bowls, so that everyone can build their own tacos.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/lighter-chicken-tacos-b95f484.jpg", "nutrients": {"calories": "477 calories", "fatContent": "24.1 grams fat", "saturatedFatContent": "5.4 grams saturated fat", "carbohydrateContent": "26.2 grams carbohydrates", "sugarContent": "9.1 grams sugar", "fiberContent": "9.5 grams fiber", "proteinContent": "34.1 grams protein", "sodiumContent": "0.6 milligram of sodium"}}