{"title": "Pea & mint fishcakes", "time": 45, "yields": "8 serving(s)", "ingredients": ["500g meaty white fish (cod or haddock work well)", "2 tbsp vegetable oil, plus a drizzle", "350g potatoes, boiled and mashed", "1 spring onion, finely chopped", "1 egg", "1-2 tbsp breadcrumbs (optional)", "green salad, tartare sauce and lemon wedges, to serve", "100g peas", "small bunch of mint, leaves picked", "25g pine nuts", "½ lemon, juiced", "3 tbsp extra virgin olive oil", "½ garlic clove, crushed", "25g parmesan, grated", "10 tbsp flour, seasoned", "2 eggs, beaten", "12 tbsp breadcrumbs"], "instructions": "Heat the oven to 190C/170C fan/gas 5. Put the fish in a roasting tin, drizzle over some oil and cook for 10-15 mins until cooked through. Allow to cool, then flake into chunks, removing any skin and bones.\nFor the pesto, blitz together all the ingredients with a pinch each of salt and pepper, adding 1 tbsp water if it looks too thick.\nMix the fish, mashed potato, pesto, spring onion and egg with a little more seasoning, being careful not to break up the fish too much. Mix in 1-2 tbsp breadcrumbs if the mixture feels too wet. Shape into 6-8 cakes, put on a tray and chill in the fridge for 1 hr.\nFor the crumb, prepare a bowl of seasoned flour, a bowl of beaten egg and a bowl of breadcrumbs. Coat the fishcakes in the flour, then the egg, then breadcrumbs. Set aside. Can be frozen for up to one month. Defrost thoroughly before cooking.\nHeat the 2 tbsp vegetable oil in a frying pan and fry the fishcakes (you may have to do it in batches) until golden brown, about 3-4 mins on each side. Serve with salad, tartare sauce and lemon wedges.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/10/Pea-Mint-Pesto-Fishcakes-6cea3d8.jpg", "nutrients": {"calories": "383 calories", "fatContent": "13 grams fat", "saturatedFatContent": "2 grams saturated fat", "carbohydrateContent": "45 grams carbohydrates", "sugarContent": "2 grams sugar", "fiberContent": "3 grams fiber", "proteinContent": "21 grams protein", "sodiumContent": "0.4 milligram of sodium"}}