{"title": "Vegan spinach & cherry tomato quiche", "time": 85, "yields": "8 serving(s)", "ingredients": ["325g wholemeal flour", "2 tsp mustard powder", "90ml olive oil", "400g extra-firm tofu, drained", "3 tbsp nutritional yeast flakes", "¼ tsp ground turmeric", "¼ tsp ground white pepper", "½ tsp onion granules", "2 tsp cornflour", "125ml oat or soy milk", "small bunch of basil, leaves shredded, plus a few extra leaves to serve", "2 tsp olive oil", "100g baby leaf spinach", "225g cherry tomatoes, halved", "2 thyme sprigs, leaves picked", "green salad, to serve"], "instructions": "Heat the oven to 200C/180C fan/gas 6. To make the pastry, mix the flour and mustard powder with a generous pinch of salt in a large bowl. Drizzle in the olive oil, stirring continuously until evenly dispersed through the flour mixture. Slowly stir in 6-8 tbsp water to bring the pastry together.\nRoll the pastry out between two sheets of baking parchment into a 3mm-thick circle and use it to line a 22cm tart tin. Chill for 20 mins. Line the pastry case with baking parchment and fill with baking beans. Bake for 15 mins. Remove the parchment and beans and bake for another 10 mins until the pastry is golden and dry.\nReduce the oven temperature to 160C/140C fan/gas 3. For the filling, tip the tofu, nutritional yeast, turmeric, white pepper, onion granules, cornflour and 1 tsp salt into a food processor. Blitz together briefly, then, with the motor running, slowly add the milk until you have a smooth, thick filling (this may take a few minutes). If the food processor starts to strain, add an extra 1 tbsp milk. Scrape the filling into a large bowl and stir in the shredded basil leaves. Taste and adjust the seasoning, if needed.\nHeat the olive oil in a non-stick frying pan and cook the spinach, cherry tomatoes and thyme for 2-3 mins until the spinach has just wilted. Stir most of the tomatoes and spinach into the filling mixture, reserving a few tomatoes for the top of the quiche. Spoon the filling into the pastry case and smooth the surface with the back of the spoon. Press the reserved tomatoes into the top and bake for 30 mins until the quiche is golden and just set in the middle. Leave to cool for a few minutes, then scatter over a few extra basil leaves, slice and serve with a green salad.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2021/03/Vegan-spinach-and-cherry-tomato-quiche-19d179d.jpg", "nutrients": {"calories": "357 calories", "fatContent": "17 grams fat", "saturatedFatContent": "2 grams saturated fat", "carbohydrateContent": "32 grams carbohydrates", "sugarContent": "3 grams sugar", "fiberContent": "7 grams fiber", "proteinContent": "15 grams protein", "sodiumContent": "0.35 milligram of sodium"}}