{"title": "Beef shin pie", "time": 240, "yields": "6 serving(s)", "ingredients": ["3 tbsp plain flour, plus extra for dusting", "1.5kg beef shin, cut into 4cm chunks", "3 tbsp sunflower oil, plus extra for frying (optional)", "1 onion, chopped", "2 carrots, chopped", "2 celery sticks, chopped", "few thyme sprigs, plus a few extra leaves", "2 bay leaves", "1 litre beef stock", "500g block puff pastry", "1 egg, beaten"], "instructions": "Tip the flour onto a large plate and season well. Toss the beef shin in the flour in batches until all of it is completely coated in flour.\nHeat the sunflower oil in a flameproof casserole dish or large heavy-bottomed pan and brown the beef shin in batches, for 2-3 mins each until well-caramelised. Scoop out onto a plate using a slotted spoon.\nTip the onion, carrots, celery, thyme and bay into the pan along with more oil, if needed, and a large pinch of salt and pepper. Cook for 10 mins, scraping the bottom of the pan to release all the browned bits, until the vegetables are beginning to soften. Tip in the stock, cover and cook for 1 hr 30 mins, then remove the lid and cook for a further 1 hr 30 mins until the beef is meltingly tender and the gravy has thickened. Tip into a 28cm pie dish and, if freezing the pie ahead, leave to cool completely. If not, cool the filling for 1 hr.\nRoll the puff pastry out on a lightly floured work surface into a 5mm- thick circle that’s large enough to comfortably fit over the pie dish. Brush the edge of the dish with some of the beaten egg, then carefully lay the pastry circle on top. Trim any excess and crimp the edge of the pie. Use any leftover pastry to make decorations, if you like, and fix these to the top using a little beaten egg.\nCut a small steam hole in the middle using a sharp knife, then brush the whole pie with the rest of the beaten egg and sprinkle with thyme leaves. The unbaked pie will keep covered in the freezer for three months. Fully defrost overnight in the fridge before baking.\nHeat the oven to 200C/180C fan/ gas 6. Bake the pie for 30 mins (or 45 mins if it’s been frozen and defrosted) until the pastry is cooked and golden. Serve with vegetables and mashed potato, if you like.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2021/11/Beef-shin-pie-51271e0.jpg", "nutrients": {"calories": "755 calories", "fatContent": "41 grams fat", "saturatedFatContent": "16 grams saturated fat", "carbohydrateContent": "38 grams carbohydrates", "sugarContent": "4 grams sugar", "fiberContent": "5 grams fiber", "proteinContent": "55 grams protein", "sodiumContent": "1.4 milligram of sodium"}}