{"title": "Beef bourguignon cottage pie", "time": 220, "yields": "6 serving(s)", "ingredients": ["1 tbsp sunflower or vegetable oil", "200g pack bacon lardons", "900g braising steak , cut into 3cm chunks", "225g button mushrooms", "225g button onions or small shallots , peeled", "2 garlic cloves , crushed", "1 tbsp demerara sugar", "600ml red wine", "400g can beef consommé (or use 400ml/14floz beef stock)", "1-2 tbsp cornflour , loosened with 1-2 tbsp red wine or water", "1kg medium, floury potatoes , preferably Maris Piper or Desirée, quartered", "50g unsalted butter", "100ml milk"], "instructions": "(Up to a month ahead) heat the oil in a large pan. Fry the bacon lardons over a high heat for several mins until well coloured. Using a slotted spoon, remove from the pan, drain on kitchen paper and set aside. Season the beef, then fry in the fat left in the pan. Once coloured, add all the remaining ingredients for the beef, except the cornfl our and bacon, and bring to a simmer. Partly cover the pan with a lid and continue to cook for a further 2-2½ hrs or until the beef is tender.\nOnce cooked, tip everything into a colander set over another pan so you can catch the sauce. Tip the contents of the colander into a large pie dish, about 28cm x 23cm x 5cm. Re-boil the sauce and check for seasoning. Thicken with the loosened cornfl our, adding a little at a time and stirring until you have the desired coating consistency. Spoon enough sauce over the beef to barely cover and loosen it, then stir. Remaining sauce can be frozen, ready to re-heat and offer separately on the day.\nWhile the beef is cooling, make the mash. Boil the potatoes until tender, 15-20 mins, depending on size. Drain off the water and replace the lid. Shake the pan to break up the boiled potatoes. Add butter and milk a little at a time while mashing. Season.\nSpoon and spread the mashed potatoes on top of the cooled beef. Once covered, the mash can be marked with a spoon, palette knife or fork for a more interesting fi nish (see Gary’s tip, left). When cold, the cottage pie is ready to cover and freeze.\nThe day before serving, transfer the pie to the fridge to defrost overnight. (Or reheat from frozen on the day, see below.)\nOn the day, reheat the pie. Heat oven to 180C/fan 160C/gas 4. If thawed, bake for 50 mins-1 hr, or until heated through, then increase heat to 200C/fan 180C/gas 6 for the fi nal 10 mins for a golden brown topping. If cooking from frozen, cover with foil, then bake for 1¼ hrs; remove foil and bake uncovered for 1¼ hrs more, then increase heat as above for the last 10 mins.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-424726_11-eebfe03.jpg", "nutrients": {"calories": "653 calories", "fatContent": "30 grams fat", "saturatedFatContent": "14 grams saturated fat", "carbohydrateContent": "36 grams carbohydrates", "sugarContent": "3 grams sugar", "fiberContent": "3 grams fiber", "proteinContent": "44 grams protein", "sodiumContent": "2.26 milligram of sodium"}}