{"title": "Cheese & bacon lasagne", "time": 75, "yields": "6 serving(s)", "ingredients": ["3 large onions , halved and thinly sliced", "3 tbsp olive oil", "1 tsp dried oregano", "300g pack lean smoked back bacon , chopped", "2 x 400g cans chopped tomatoes in rich juice", "20 basil leaves , roughly torn, plus extra to serve if you like", "250g pack fresh egg lasagne (check pack for cooking instructions)", "600ml milk", "50g each butter and plain flour", "generous grating fresh nutmeg", "50g grated parmesan"], "instructions": "Fry the onions in the oil for about 15 mins until golden. Add the oregano and bacon and fry for 5 mins more, stirring frequently. Tip in the tomatoes, season and bubble uncovered for 5 mins. Remove from the heat and stir in the basil.\nMeanwhile, make the white sauce. Pour the milk into a pan and tip in the butter and flour. Whisk continuously over a moderate heat to incorporate the flour, then simmer, stirring until thickened. Season with salt, pepper and nutmeg.\nSpoon a third of the tomato sauce on the base of a lasagne dish. Top with a third of the lasagne sheets. Then top with a third sauce, a third lasagne, the last of the tomato sauce and finally the last sheets of lasagne. Pour over the white sauce and scatter with the cheese and an extra grating of nutmeg. Chill. If eating straight away, bake at 190C/170C fan/gas 5 for 40 mins until golden and bubbling. Scatter with basil, if you like, and serve with a salad and garlic bread.\nTo freeze, cool completely, then wrap in cling film, then foil. Will store for 3 months. To serve, thaw for 6 hrs in a cool place. Unwrap and bake at 190C/170C fan/gas 5 for 50-60 mins until thoroughly heated through.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-411672_12-20c6f3c.jpg", "nutrients": {"calories": "425 calories", "fatContent": "22 grams fat", "saturatedFatContent": "9 grams saturated fat", "carbohydrateContent": "37 grams carbohydrates", "sugarContent": "14 grams sugar", "fiberContent": "4 grams fiber", "proteinContent": "23 grams protein", "sodiumContent": "3.03 milligram of sodium"}}