{"title": "Cottage pie", "time": 145, "yields": "10 serving(s)", "ingredients": ["3 tbsp olive oil", "1 ¼kg beef mince", "2 onions, finely chopped", "3 carrots, chopped", "3 celery sticks, chopped", "2 garlic cloves, finely chopped", "3 tbsp plain flour", "1 tbsp tomato purée", "large glass red wine (optional)", "850ml beef stock", "4 tbsp Worcestershire sauce", "few thyme sprigs", "2 bay leaves", "1.8kg potatoes, chopped", "225ml milk", "25g butter", "200g strong cheddar, grated", "freshly grated nutmeg"], "instructions": "Heat 1 tbsp olive oil in a large saucepan and fry 1¼ kg beef mince until browned – you may need to do this in batches. Set aside as it browns.\nPut the other 2 tbsp olive oil into the pan, add 2 finely chopped onions, 3 chopped carrots and 3 chopped celery sticks and cook on a gentle heat until soft, about 20 mins.\nAdd 2 finely chopped garlic cloves, 3 tbsp plain flour and 1 tbsp tomato purée, increase the heat and cook for a few mins, then return the beef to the pan.\nPour over a large glass of red wine, if using, and boil to reduce it slightly before adding the 850ml beef stock, 4 tbsp Worcestershire sauce, a few thyme sprigs and 2 bay leaves.\nBring to a simmer and cook, uncovered, for 45 mins. By this time the gravy should be thick and coating the meat. Check after about 30 mins – if a lot of liquid remains, increase the heat slightly to reduce the gravy a little. Season well, then discard the bay leaves and thyme stalks.\nMeanwhile, make the mash. In a large saucepan, cover the 1.8kg potatoes which you've peeled and chopped, in salted cold water, bring to the boil and simmer until tender.\nDrain well, then allow to steam-dry for a few mins. Mash well with the 225ml milk, 25g butter, and three-quarters of the 200g strong cheddar cheese, then season with freshly grated nutmeg and some salt and pepper.\nSpoon the meat into 2 ovenproof dishes. Pipe or spoon on the mash to cover. Sprinkle on the remaining cheese.\nIf eating straight away, heat oven to 220C/200C fan/gas 7 and cook for 25-30 mins, or until the topping is golden.\nIf you want to use a slow cooker, brown your mince in batches then tip into your slow cooker and stir in the vegetables, flour, purée, wine, stock, Worcestershire sauce and herbs with some seasoning. Cover and cook on High for 4-5 hours. Make the mash following the previous steps, and then oven cook in the same way to finish.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1074465_10-0f090a9.jpg", "nutrients": {"calories": "600 calories", "fatContent": "34 grams fat", "saturatedFatContent": "16 grams saturated fat", "carbohydrateContent": "40 grams carbohydrates", "sugarContent": "7 grams sugar", "fiberContent": "4 grams fiber", "proteinContent": "37 grams protein", "sodiumContent": "1.15 milligram of sodium"}}