{"title": "Double bean & roasted pepper chilli", "time": 105, "yields": "8 serving(s)", "ingredients": ["2 onions, chopped", "2 celery sticks, finely chopped", "2 yellow or orange peppers, finely chopped", "2 tbsp sunflower oil or rapeseed oil", "2 x 460g jars roasted red peppers", "2 tsp chipotle paste", "2 tbsp red wine vinegar", "1 tbsp cocoa powder", "1 tbsp dried oregano", "1 tbsp sweet smoked paprika", "2 tbsp ground cumin", "1 tsp ground cinnamon", "2 x 400g cans chopped tomatoes", "400g can refried beans", "3 x 400g cans kidney beans, drained and rinsed", "2 x 400g cans black beans, drained and rinsed"], "instructions": "Put the onions, celery and chopped peppers with the oil in your largest flameproof casserole dish or heavy-based saucepan, and fry gently over a low heat until soft but not coloured.\nDrain both jars of peppers over a bowl to catch the juices. Put a quarter of the peppers into a food processor with the chipotle paste, vinegar, cocoa, dried spices and herbs. Whizz to a purée, then stir into the softened veg and cook for a few mins.\nAdd the tomatoes and refried beans with 1 can water and the reserved pepper juice. Simmer for 1 hr until thickened, smoky and the tomato chunks have broken down to a smoother sauce.\nAt this stage you can cool and chill the sauce if making ahead. Otherwise add the kidney and black beans, and the remaining roasted peppers, cut into bite-sized pieces, then reheat. (This makes a large batch, so once the sauce is ready it might be easier to split it between two pans when you add the beans and peppers.) Once bubbling and the beans are hot, season to taste and serve.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chilli-16e065a.jpg", "nutrients": {"calories": "327 calories", "fatContent": "6 grams fat", "saturatedFatContent": "1 grams saturated fat", "carbohydrateContent": "41 grams carbohydrates", "sugarContent": "9 grams sugar", "fiberContent": "18 grams fiber", "proteinContent": "19 grams protein", "sodiumContent": "0.6 milligram of sodium"}}