{"title": "Friday night fish pie", "time": 95, "yields": "2 item(s)", "ingredients": ["1½kg potato, chopped into chunks", "50g butter", "1½l full-fat milk", "800g skinless white fish", "600g skinless smoked haddock fillet", "1 onion, quartered", "2 bay leaves", "140g butter", "140g plain flour", "nutmeg, to season", "small bunch parsley, leaves only, finely chopped", "200g cooked, peeled prawns", "6 eggs, hard-boiled and quartered (just 3 eggs if you are freezing one of the pies, as the eggs can't be frozen)"], "instructions": "Simmer the potatoes for about 20 mins until tender, then drain and mash with most of the butter, plenty of seasoning and a little milk. Season and set aside.\nMeanwhile, cut the fish into 2cm cubes. Bring the milk just to a simmer in a large frying pan – when you see a few small bubbles, add the fish, onion and bay leaves, then cover and cook for 6-8 mins. Lift the fish out onto a plate and strain the milk into a jug.\nMelt the butter in a pan, stir in the flour and cook for 1 min over a medium heat. Take off the heat, pour in a little poaching milk, then stir until blended. Continue to add the milk gradually, mixing well until you have a smooth sauce. Return to the heat, bring to the boil, then simmer for 5 mins, stirring continuously, until it coats the back of a spoon. Remove from the heat, season with salt, pepper and nutmeg, then mix in the parsley.\nHeat oven to 200C/180C fan/gas 6. Divide the fish between 2 ovenproof dishes, about 1.3 litres each and strain any juices into the sauce. Scatter over the prawns, then add the eggs to both dishes if eating straightaway, or to just one dish if freezing the other. Pour the sauce over both. Spoon half of the mash over one dish so it covers everything, making sure it reaches the sides. Rough up the top with a fork and dot with remaining butter. Bake for 30 mins until the top is golden. Freeze the remaining fish and mash (see tips, below).", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-133464_12-8433b65.jpg", "nutrients": {"calories": "562 calories", "fatContent": "24 grams fat", "saturatedFatContent": "13 grams saturated fat", "carbohydrateContent": "45 grams carbohydrates", "sugarContent": "9 grams sugar", "fiberContent": "3 grams fiber", "proteinContent": "45 grams protein", "sodiumContent": "2.25 milligram of sodium"}}