{"title": "One-pot chicken & bacon stew", "time": 110, "yields": "8 serving(s)", "ingredients": ["3 tbsp olive oil", "16 chicken pieces on the bone (about 3kg/6lb 8oz in total)", "140g smoked bacon, chopped or lardons or cubetti di pancetta", "4 medium carrots, thickly sliced", "2 onions, roughly chopped", "2 tbsp plain flour", "1 tbsp tomato purée", "75ml white wine or cider vinegar", "1l chicken stock", "2 bay leaves", "4 tbsp double cream or crème fraîche", "600g small new potatoes, halved", "12 large white mushrooms, quartered", "chopped herbs, such as parsley, tarragon or chives"], "instructions": "Heat oven to 200C/180C fan/gas 6. Heat the oil in a large flameproof casserole with a lid. Fry the chicken pieces in batches for 5 mins on each side until well browned, then transfer to a plate. Sizzle the bacon in the casserole for a few mins until beginning to crisp. Stir in the carrots and onions, then cook for 5 mins until starting to soften. Stir in the flour and tomato purée and cook for 1 min more. Finally, splash in the vinegar and stir well.\nPour in the stock and bring to a simmer. Add the bay, cream and seasoning. Slide in the chicken pieces and scatter over the potatoes, turning everything over a few times so that the potatoes are immersed in the sauce. Put the lid on and place in the oven. After 40 mins, remove from the oven and stir in the mushrooms. Cover again and cook in the oven for 10 mins more until the chicken is cooked through and tender but not completely falling off the bone. You can now turn off the heat, and chill and freeze some or all of it (see freezing tips, below). If eating straight away, cook for 10 mins more, then sprinkle over the herbs and serve.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-513824_11-86a4347.jpg", "nutrients": {"calories": "736 calories", "fatContent": "46 grams fat", "saturatedFatContent": "14 grams saturated fat", "carbohydrateContent": "21 grams carbohydrates", "sugarContent": "7 grams sugar", "fiberContent": "4 grams fiber", "proteinContent": "60 grams protein", "sodiumContent": "1.74 milligram of sodium"}}