{"title": "Pork goulash with herby dumplings", "time": 115, "yields": "10 serving(s)", "ingredients": ["2 tbsp olive oil", "1 ½kg pork tenderloin, cut into strips", "2 onions, cut into thin wedges", "4 garlic cloves, crushed", "1-2 tbsp smoked paprika", "500ml beef stock", "2 x cans chopped tomato", "1 tbsp sugar", "3 peppers, chopped", "250g self-raising flour", "140g shredded suet", "1 ½ tsp baking powder", "small bunch oregano, most leaves chopped"], "instructions": "Heat half the oil in a large frying pan and fry the pork for 4-5 mins until browned. Once done, remove and set aside. You may need to do this in batches. Use remaining oil to fry the onions for 8-10 mins until soft and starting to brown. Then add the garlic and paprika, and cook for 1-2 mins more. Return the pork to the pan and pour in the stock, tomatoes and sugar. Bring to the boil, then turn down and simmer for 20-30 mins until the sauce has thickened.\nTo make the dumplings, combine all the ingredients, apart from the unchopped oregano leaves, with enough cold water to make a scone-like dough. Roll into approximately 30 walnut-size balls. Stir the peppers into the goulash. Tuck in the dumplings, cover the pan with a lid and cook for 25-30 mins until the dumplings are puffed up. Allow to cool and freeze for up to 2 months, or serve scattered with reserved oregano and some soured cream.\nIf frozen, defrost then re-heat in the microwave on medium for 4-6 mins for a single portion, and longer for larger servings or gently on the hob, covered, until piping hot.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-517488_12-626b604.jpg", "nutrients": {"calories": "476 calories", "fatContent": "25 grams fat", "saturatedFatContent": "10 grams saturated fat", "carbohydrateContent": "27 grams carbohydrates", "sugarContent": "5 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "38 grams protein", "sodiumContent": "0.84 milligram of sodium"}}