{"title": "Black tahini chocolate cookies", "time": 28, "yields": "20 item(s)", "ingredients": ["50g salted butter , softened", "125g light brown muscovado sugar", "125g golden caster sugar", "1 egg , beaten", "200g self-raising flour", "2 tbsp cocoa powder", "200g milk chocolate , broken into chunks", "100g white chocolate , melted, for drizzling", "100g black sesame seeds (available at Waitrose), plus extra for decorating", "100g flavourless oil", "30g maple syrup"], "instructions": "First, make the black tahini. Toast the sesame seeds in a small pan over a gentle heat until you can smell the sesame aroma. Transfer to a mini processor and blitz. Pour in the oil gradually until a paste forms. Add the maple syrup and blitz again. Tip into a small bowl until ready to use.\nHeat oven to 180C/160C fan/gas 4 and line two baking sheets with parchment. In a large bowl, beat the butter and sugars together until pale and fluffy. Add the egg and 80g of black tahini paste, and beat to combine. Tip in the flour, cocoa and milk chocolate chunks, and beat until fully incorporated.\nUsing an ice cream scoop, ball the dough into about 20 pieces and place on the baking sheets. Press each ball lightly so it’s a little flatter, leaving plenty of room between them, as they will spread.\nBake for 6-8 mins until still soft in the middle – they will harden as they cool. Leave to cool on the sheets for a few mins before transferring to wire racks to cool completely.\nOnce cooled, drizzle white chocolate zigzags all over the cookies and sprinkle some black sesame seeds on top. Will keep in an airtight container for 3 days.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/black-tahini-chocolate-cookies-1ea06e1.jpg", "nutrients": {"calories": "254 calories", "fatContent": "13 grams fat", "saturatedFatContent": "5 grams saturated fat", "carbohydrateContent": "29 grams carbohydrates", "sugarContent": "21 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "3 grams protein", "sodiumContent": "0.2 milligram of sodium"}}