{"title": "Caramelised honey and tahini cookies", "time": 30, "yields": "18 item(s)", "ingredients": ["150g honey", "150g salted butter , cubed", "75g dark brown soft sugar", "75g caster sugar", "100g tahini", "1 large egg , plus 1 large yolk", "250g plain flour", "¼ tsp bicarbonate of soda", "1 tsp sea salt flakes", "1 tbsp mixed black & white sesame seeds"], "instructions": "Bring the honey to a boil in a small pan set over a medium-high heat. Boil for 5 mins until it has darkened and smells nutty – don’t worry if it looks quite dark, this will add flavour. Whisk briefly, then remove from the heat and carefully whisk in the butter until melted. Transfer to a heatproof bowl and leave to cool.\nTip both the sugars, tahini, egg and yolk into the bowl with the honey mix, then beat to combine. In a separate bowl, mix the flour and bicarb together, then gradually pour the wet ingredients into the dry and mix until it comes together into a dough. Chill for 3 hrs, or overnight.\nHeat the oven to 180C/160C fan/gas 4 and line two baking trays with baking parchment. Roll the dough into 18 even balls (weigh for accuracy, if you like – they should be around 45g each), and arrange on the trays spaced 5cm apart. Gently press down with the back of a spoon to slightly flatten the tops, then sprinkle over the sea salt flakes and sesame seeds and bake for 10-12 mins.\nTap the tray on a work surface to slightly flatten the cookies. Leave to cool on the trays for 10 mins, then transfer to a wire rack to cool completely. Will keep in an airtight container for up to three days.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/honey-and-tahini-cookies-c76e5fe.jpg", "nutrients": {"calories": "217 calories", "fatContent": "11 grams fat", "saturatedFatContent": "5 grams saturated fat", "carbohydrateContent": "25 grams carbohydrates", "sugarContent": "14 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "3 grams protein", "sodiumContent": "0.5 milligram of sodium"}}