{"title": "Choc chunk, cashew & cranberry cookies", "time": 22, "yields": "30 item(s)", "ingredients": ["100g pack cashew nuts , or more if you like", "140g unsalted butter , at room temperature, plus extra for greasing", "250g plain flour", "½ tsp baking powder", "200g white caster sugar", "100g crunchy cashew nut butter , or use peanut butter", "1 large egg , beaten", "2 tbsp golden syrup", "200g bar chocolate , 50% cocoa solids, chopped into 1cm chunks", "50g dried cranberries (optional)"], "instructions": "Heat oven to 180C/160C fan/gas 4. Scatter the cashews over a baking tray and toast for 5-7 mins until golden. Cool, then roughly chop.\nMeanwhile, grease and line 2 baking sheets with parchment. Sift the flour, baking powder and 1/2 tsp salt into a large bowl, then stir in the sugar. Cut the butter into rough cubes, and add this and the nut butter to the bowl. Rub together until the mixture resembles damp breadcrumbs.\nUsing a cutlery knife, work the egg and syrup into the bowl to make a soft dough. Tip in the chocolate, nuts and cranberries (if using), and stir to combine. Try not to overwork the dough at this point.\nRoll slightly heaped tablespoons of dough into balls and place onto each baking sheet, leaving plenty of room for the cookies to spread. Bake for 12 mins or until golden at the edges and risen in the middle. Let them cool for 5 mins, then move to a rack to cool completely. Repeat until all the dough is shaped and baked. To make ahead, freeze the raw cookies on a baking sheet, then transfer to a freezer bag or box once solid. Bake from frozen, adding 5 mins to the cooking time.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/choc-chunk-cashew-cranberry-cookies-d706b18.jpg", "nutrients": {"calories": "178 calories", "fatContent": "9 grams fat", "saturatedFatContent": "4 grams saturated fat", "carbohydrateContent": "21 grams carbohydrates", "sugarContent": "13 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "3 grams protein", "sodiumContent": "0.1 milligram of sodium"}}