{"title": "Easter egg cookies", "time": 75, "yields": "20 item(s)", "ingredients": ["175g butter , softened", "200g light brown soft sugar", "100g golden caster sugar", "1 tbsp vanilla extract", "1 large egg", "250g plain flour", "½ tsp bicarbonate of soda", "50g white chocolate , chopped into chunks", "100g bar dark chocolate , chopped into chunks", "100g mini chocolate eggs , lightly crushed with a rolling pin, leaving some larger pieces to decorate"], "instructions": "Heat oven to 190C/170C fan/gas 5. Line two baking sheets with baking parchment. Tip the butter, sugars and vanilla into a bowl. Beat with a hand-held electric whisk until pale and fluffy. Add the egg and beat again. Tip in the flour, bicarb and a pinch of salt, then use a spatula to mix together before adding the chocolate chunks and about half the crushed mini eggs (set aside the larger pieces) and mix again until everything is combined.\nScoop golf-ball-sized mounds of cookie dough onto the baking sheets, making sure you leave plenty of space between each one. (You should fit 4-6 cookies on each, so you’ll have to bake in batches to make the total 20 cookies.) Push the remaining mini egg pieces into the tops. Can be frozen at this point for up to three months. Defrost thoroughly in the fridge before baking. Bake for 15-18 mins, swapping the sheets around halfway through. For soft and chewy cookies, the cookies should be golden around the edges but still pale and soft in the middle. If you prefer a biscuit texture, you will need to bake them a little longer.\nRemove from the oven and leave to cool for 10 mins before transferring to a wire rack, then bake the second batch. Continue until all the cookies are baked. Will keep in an airtight container for up to a week.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/easter-egg-cookies-88ee62a.jpg", "nutrients": {"calories": "241 calories", "fatContent": "11 grams fat", "saturatedFatContent": "7 grams saturated fat", "carbohydrateContent": "31 grams carbohydrates", "sugarContent": "21 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "2 grams protein", "sodiumContent": "0.3 milligram of sodium"}}