{"title": "Freezer biscuits", "time": 30, "yields": "30 item(s)", "ingredients": ["200g pack butter , softened", "200g soft brown sugar", "2 eggs", "1 tsp vanilla extract", "200g self-raising flour", "140g oats", "50g chopped nuts such as pecan , hazelnuts or almonds", "50g desiccated coconut", "50g raisin , or mixed fruit"], "instructions": "When the butter is really soft, tip it into a bowl along with the sugar. Using an electric hand whisk or exercising some arm muscle, beat together until the sugar is mixed through. Beat in the eggs, one at a time, followed by the vanilla extract and a pinch of salt, if you like. Stir in the flour and oats. The mixture will be quite stiff at this point. Now decide what else you would like to add – any or all of the flavours are delicious – and stir through.\nTear off an A4-size sheet of greaseproof paper. Pile up half the mixture in the middle of the sheet, then use a spoon to thickly spread the mixture along the centre of the paper. Pull over one edge of paper and roll up until you get a tight cylinder. If you have problems getting it smooth, then roll as you would a rolling pin along a kitchen surface. You’ll need it to be about the width of a teacup. When it is tightly wrapped, twist up the ends and then place in the freezer. Can be frozen for up to 3 months.\nTo cook, heat oven to 180C/fan 160C/gas 4 and unwrap the frozen biscuit mix. Using a sharp knife, cut off a disk about ½cm wide. If you have difficulty slicing through, dip the knife into a cup of hot water. Cut off as many biscuits as you need, then pop the mix back into the freezer for another time. Place on a baking sheet, spacing them widely apart as the mixture will spread when cooking, then cook for 15 mins until the tops are golden brown. Leave to cool for at least 5 mins before eating.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-559569_11-7f6dc8b.jpg", "nutrients": {"calories": "138 calories", "fatContent": "8 grams fat", "saturatedFatContent": "5 grams saturated fat", "carbohydrateContent": "16 grams carbohydrates", "sugarContent": "8 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "2 grams protein", "sodiumContent": "0.21 milligram of sodium"}}