{"title": "Jammy star cookies", "time": 90, "yields": "20 serving(s)", "ingredients": ["175g cold unsalted butter, cubed", "250g plain flour, plus extra for dusting", "100g golden icing sugar", "1 tsp vanilla extract", "1 egg yolk", "50g unsalted butter, softened", "160g icing sugar", "120g seedless raspberry or strawberry jam", "2 star cutter, around 6cm and 3cm"], "instructions": "Blitz the butter, flour and a pinch of salt in a food processor until the mixture resembles fine breadcrumbs. Add the sugar and blitz again. Add the vanilla and egg yolk and blend until balls of dough have formed. Tip the dough onto a work surface and knead briefly to make a smooth ball. Cut into two equal pieces, pat them into discs, then wrap and chill for at least 30 mins. Line two baking sheets with baking parchment.\nRemove the dough from the fridge 15 mins before you roll it out. Lightly flour your work surface and rolling pin. Unwrap 1 piece of dough and roll it out to the thickness of a 50p coin. Use a 6cm star cutter to stamp out stars (you should get about 15) and transfer to a baking sheet.\nUnwrap and roll out the other piece of dough. Stamp out 15 more stars and transfer to the second baking sheet. Stamp holes from the middle of 15 of the biscuits using the smaller cutter. Cover and chill for 15 mins. Heat the oven to 180C/160C fan/gas 4. Bake for 10-15 mins (the stars with a hole need less time), cool for 5 mins, then transfer to a wire rack to cool completely.\nMeanwhile, make the filling. Whisk the butter, sugar and 50g of the jam with an electric whisk. Transfer to a piping bag with a small round nozzle, or snip off the end to make a ½cm opening. Put the remaining jam in another piping bag and snip off the end to make a slightly smaller hole.\nPipe blobs of the filling around the edge of each whole biscuit, leaving a space in the centre. Fill the space with jam, then sandwich a biscuit with a hole cut out on top of each one. Will keep in an airtight container for up to three days.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/jammy-star-cookies-66b6120.jpg", "nutrients": {"calories": "198 calories", "fatContent": "9 grams fat", "saturatedFatContent": "6 grams saturated fat", "carbohydrateContent": "27 grams carbohydrates", "sugarContent": "17 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "1 grams protein", "sodiumContent": "0.01 milligram of sodium"}}