{"title": "Orange pumpkin face cookies", "time": 55, "yields": "12 item(s)", "ingredients": ["140g butter , softened", "175g plain flour", "50g icing sugar", "finely grated zest 1 medium orange", "100g mascarpone", "1 tsp icing sugar", "25g plain chocolate (55% cocoa solids is fine), melted", "50g icing sugar", "about 1 tbsp orange juice"], "instructions": "Preheat the oven to fan 160C/ conventional 180C/gas 4. Put the butter in a bowl and beat with a wooden spoon until smooth. Add the flour, icing sugar and orange zest and beat together to make a softish dough. Knead into a ball and wrap in cling film. Chill for 1 hour.\nRoll the dough out on a lightly floured surface to a thickness of about 3mm. Cut 24 circles with a 7.5 cm round plain cutter. Put them on a couple of baking sheets.\nUsing a small sharp knife, cut out Hallowe’en faces on 12 of the circles. Gather up the spare biscuit dough and press into pumpkin stem shapes, trimming with a sharp knife. Press to the top of each biscuit with a knife to join. Make lines on the face biscuits with the back of a roundbladed knife, to look like the markings on a pumpkin. Bake all the biscuits for about 15 minutes until pale golden. Leave to set for a while, then cool completely on a wire rack.\nMix the glaze ingredients to make a smooth, runny icing, adding a bit more juice if needed, then set aside. For the filling, beat the mascarpone with the icing sugar, then stir in the cooled melted chocolate.\nSpread the filling over the cooled plain biscuits, then press the ‘face’ ones on top – do this just before you want to eat them, otherwise they go soft. Brush with the glaze, using a clean paint brush or pastry brush. Eat the same day.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-45800_12-c54e83b.jpg", "nutrients": {"calories": "219 calories", "fatContent": "14 grams fat", "saturatedFatContent": "9 grams saturated fat", "carbohydrateContent": "22 grams carbohydrates", "sugarContent": "10 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "2 grams protein", "sodiumContent": "0.25 milligram of sodium"}}