{"title": "Red velvet cookies", "time": 35, "yields": "18 serving(s)", "ingredients": ["175g soft salted butter", "200g light brown soft sugar", "100g caster sugar", "1 large egg", "2 tsp vanilla extract", "½-1 tbsp red food colouring gel, depending on strength", "225g plain flour", "25g cocoa powder", "½ tsp bicarbonate of soda", "150g white chocolate chips or chunks", "2 tbsp soft cheese", "6 tbsp icing sugar"], "instructions": "Beat the butter and sugars together with an electric whisk until pale and fluffy. Beat in the egg, vanilla and food colouring until you have a bright red batter. Sieve over the flour, cocoa and bicarb. Fold everything together to make a stiff evenly-coloured dough, then fold in the chocolate chips.\nPut the dough on a sheet of baking parchment, fold the parchment over the dough and mould into a sausage shape about 6cm wide. Chill until ready to bake. Will keep for a week in the fridge or one month in the freezer.\nHeat the oven to 190C/170C fan/gas 5. Cut the cookie dough into 1cm thick slices using a sharp knife and arrange on two large baking sheets lined with baking parchment well-spaced apart so they have room to spread in the oven. Bake in batches, keeping the unbaked cookies on the sheet in the fridge while the rest are baking.\nBake in the middle of the oven for 13-15 mins until the cookies are crisp at the edges, but still soft in the centre. Leave to cool on the baking sheet for a few minutes, then transfer to a wire rack to cool completely. Beat the soft cheese in a small bowl to a loose consistency, then stir in the icing sugar. Use a piping bag or spoon to drizzle the icing over the cookies. Un-iced cookies keep for five days in an airtight container, or two days iced.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/red-velvet-cookies-d61b8b7.jpg", "nutrients": {"calories": "268 calories", "fatContent": "12 grams fat", "saturatedFatContent": "7 grams saturated fat", "carbohydrateContent": "36 grams carbohydrates", "sugarContent": "26 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "3 grams protein", "sodiumContent": "0.3 milligram of sodium"}}