{"title": "Rye Christmas pudding cookies", "time": 34, "yields": "16 item(s)", "ingredients": ["180g butter, softened", "160g dark muscovado sugar", "40g golden caster sugar", "1 large egg", "2 tbsp brandy or cognac", "200g self-raising flour", "80g dark rye flour", "160g leftover Christmas pudding, torn into bite-sized chunks", "30g flaked almonds", "clotted cream or vanilla ice cream, to serve (optional)"], "instructions": "Line a large plate or freezerproof container with baking parchment and set aside. Tip the butter and sugars into a stand mixer, or use an electric whisk, and beat until pale, creamy and well combined. Beat in the egg until combined, then stir in the brandy or cognac.\nCombine the flours and 1 tsp sea salt in a medium bowl. Fold the dry ingredients into the wet, followed by the Christmas pudding pieces and the almonds. Divide the dough into 16 equal pieces, weighing for accuracy, if you like, and roll each piece into a ball using your hands.\nArrange the dough balls, well spaced apart, on the prepared plate or in the container and chill in the freezer for 1 hr. If the balls don’t fit in one layer, stack them with a sheet of baking parchment between each layer to prevent sticking. Will keep, well wrapped in the freezer, for up to three months.\nHeat the oven to 190C/170C fan/ gas 5 and line one large or two smaller baking trays with baking parchment. Arrange the chilled dough balls on the prepared trays, ensuring they’re well spaced apart as they will spread during baking. Flatten each ball down slightly until they’re about 3cm high. Bake for 14 mins, then remove from the oven and immediately scatter over a pinch of sea salt. Leave to cool completely on the trays to firm up. Sandwich the cooled cookies with clotted cream or ice cream just before serving, if you like.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/11/Rye-Christmas-pudding-cookies-0a27f5a.jpg", "nutrients": {"calories": "248 calories", "fatContent": "12 grams fat", "saturatedFatContent": "6 grams saturated fat", "carbohydrateContent": "31 grams carbohydrates", "sugarContent": "17 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "3 grams protein", "sodiumContent": "0.7 milligram of sodium"}}