{"title": "Show your spots cookie sandwiches", "time": 42, "yields": "20 item(s)", "ingredients": ["200g butter , softened", "140g icing sugar", "1 tsp vanilla extract", "2 large eggs , 1 beaten for glazing", "350g plain flour , plus extra for dusting", "147g bag Smarties", "4 tbsp hundreds and thousands", "100g butter , softened", "140g icing sugar", "¼ tsp vanilla extract"], "instructions": "In a food processor, whizz the butter, icing sugar and vanilla until smooth. Add 1 egg and blend to combine, then tip in the flour and blitz once more. Scoop the dough into a ball and wrap in cling film. Chill for 30 mins.\nHeat oven to 200C/180C fan/gas 6. Dust 2 large baking trays with flour. Break the dough into large cherry-sized pieces. Roll into balls and put on the baking trays, spaced a little apart. Squash down the balls slightly with 3 fingers. Bake (in batches, if necessary) for 8 mins – the cookies will still be very pale at this stage.\nRemove the cookies from the oven. While still warm, quickly brush the tops with the beaten egg, then dip half in the hundreds & thousands, and press a few Smarties onto each of the remaining cookies – do this while the egg is still wet, so the toppings will stick once cooked. Bake for a further 4 mins. Leave to cool on wire racks.\nTo make the icing, beat together the butter, icing sugar and vanilla. Once the cookies are completely cool, use the icing to sandwich together the 2 different cookies. Un-iced cookies can be made up to 4 days ahead and kept in an airtight container. You can fill with the icing up to 1 day ahead.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1124456_11-07df056.jpg", "nutrients": {"calories": "270 calories", "fatContent": "14 grams fat", "saturatedFatContent": "9 grams saturated fat", "carbohydrateContent": "32 grams carbohydrates", "sugarContent": "19 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "3 grams protein", "sodiumContent": "0.3 milligram of sodium"}}