{"title": "Snow globe cookies", "time": 71, "yields": "10 serving(s)", "ingredients": ["175g plain flour, plus extra for dusting", "100g cold butter, cubed", "50g caster sugar", "1 tsp vanilla extract", "1tbsp milk", "vegetable oil, for the parchment", "30 (about 160g) glacier mints, or other clear mint-flavoured boiled sweets", "200g royal icing sugar", "6tbsp sprinkles"], "instructions": "Blitz the flour, butter and caster sugar together in a food processor until the mix looks like breadcrumbs. Add the vanilla and milk, and pulse to larger crumbs. Briefly knead on a lightly floured surface into a smooth ball, then wrap and chill for at least 30 mins. Line two large baking sheets with baking parchment, then lightly oil the parchment.\nHeat the oven to 180C/160C fan/gas 4. Roll the chilled dough out on a floured work surface to the thickness of a £1 coin. Stamp out rounds using an 8cm cutter, then cut holes from the middles using a 5cm cutter. Cut small holes in the tops of the biscuits using the tip of a round piping nozzle or a straw – this is where you’ll thread the ribbon for hanging. Re-roll the offcuts and continue to stamp out biscuits until all the dough is used – you’ll need an even amount, as you’ll be sandwiching the biscuits together (you should get about 20). Carefully transfer to the prepared sheets.\nBake for 6 mins until just golden at the edges. Meanwhile, put the mints or sweets in a food processor or pestle and mortar, and blitz or crush until finely broken up. After 6 mins, remove the biscuits from the oven and spoon the crushed mints into the cut-out middles (use about 1 heaped tsp per biscuit). Bake for 5 mins more until the mints have just melted, but haven’t started to colour (they will turn golden if left too long). The middles will look bubbly, but will settle as they cool. If the melted mints haven’t reached the edges, use a metal skewer to carefully ease the molten middles to the sides. Leave on the sheets to harden, then transfer to a wire rack to cool completely.\nTo make the icing, mix the icing sugar with 5-6 tsp water until you have a thick, pipeable icing. Spoon into a piping bag fitted with a small round nozzle. Decorate the bottoms of the biscuits (the melted mints will be flush with the bottoms, so this will leave more room for the sprinkles) by flooding them with icing, or piping on patterns or snowflakes. Leave to dry completely, setting aside the leftover icing in the piping bag.\nOnce the biscuits are dry, carefully flip one over onto a clean tea towel so you won’t damage the icing. Pipe a little of the reserved icing around the biscuit, being careful not to get too close to the middle or edges – the icing will spread when you sandwich the biscuits together. Spoon a teaspoon of sprinkles into the clear middle, making sure not to touch the icing, then sandwich with another biscuit, matching up the ribbon holes. Leave to dry completely before shaking, as the sprinkles will stick to any wet icing. Repeat with the remaining biscuits, icing and sprinkles. Thread ribbons through the holes and hang for decorations, or store in an airtight container for up to one week.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/09/Snow-globe-cookies-3d291ff.jpg", "nutrients": {"calories": "320 calories", "fatContent": "9 grams fat", "saturatedFatContent": "5 grams saturated fat", "carbohydrateContent": "570 grams carbohydrates", "sugarContent": "41 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "2 grams protein", "sodiumContent": "0.2 milligram of sodium"}}