{"title": "Chicken & sweetcorn tacos", "time": 60, "yields": "4 serving(s)", "ingredients": ["250g plain flour , plus extra for dusting", "2 tbsp rapeseed oil", "2 tbsp taco or fajita seasoning (see tip, below)", "5-6 skinless chicken breasts, sliced", "¼ red cabbage , finely shredded", "3 limes , 1 juiced, 2 cut into wedges", "small bunch of coriander , chopped", "4 sweetcorn cob , kernels sliced off, or 400g frozen sweetcorn", "400g can black beans , drained and rinsed", "2 garlic cloves , crushed", "4 tbsp fat-free yogurt , to serve", "chilli sauce , to serve"], "instructions": "Combine the flour with half the oil and a small pinch of salt in a bowl. Pour over 125-150ml warm water, then bring together into a soft dough with your hands. Cut into six equal pieces, then cut four of the pieces in half again, so you have eight small pieces and two large. Roll all the pieces out on a floured work surface until they’re as thin as you can get them.\nHeat a dry frying pan over a medium-high heat and cook the small and large tortillas for 2-3 mins on each side until golden and toasted (do this one at a time). Leave the large tortillas to cool, then cover and reserve for use in the lunchboxes (see tip below). Keep the small tortillas warm in foil.\nSprinkle the taco seasoning over the chicken in a bowl, and toss to combine. Toss the cabbage with the lime juice, half the coriander and some seasoning in another bowl, then leave to pickle.\nMeanwhile, heat two frying pans over a high heat. Divide the remaining oil between the pans and fry the sweetcorn and a pinch of salt until sizzling and turning golden, stirring occasionally – you want the sweetcorn to char slightly, as this adds flavour, so you may need to leave it to cook undisturbed for a bit. While the sweetcorn cooks and chars, fry the chicken in the larger pan until cooked through and golden (you may need to do this in batches).\nTip the black beans and garlic into the sweetcorn and stir to warm through. Squeeze over two of the lime wedges.\nReserve two spoonfuls each of the chicken (about 1 chicken breast) and sweetcorn mix for use in the lunchboxes (see tip, below), then serve the rest in bowls alongside the cabbage, yogurt, lime wedges, remaining coriander, chilli sauce and tortillas for everyone to dig into.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chicken-sweetcorn-tacos-f01abbf.jpg", "nutrients": {"calories": "382 calories", "fatContent": "8 grams fat", "saturatedFatContent": "1 grams saturated fat", "carbohydrateContent": "45 grams carbohydrates", "sugarContent": "5 grams sugar", "fiberContent": "7 grams fiber", "proteinContent": "30 grams protein", "sodiumContent": "0.4 milligram of sodium"}}