{"title": "Healthy roast dinner", "time": 65, "yields": "2 serving(s)", "ingredients": ["285g medium potatoes, thickly sliced", "4 small carrots (160g), halved lengthways", "2 x 80g red onions, cut into quarters", "170g large Brussels sprouts (about 8-10), trimmed", "2½ tsp rapeseed oil", "2 tsp thyme leaves", "2 tsp balsamic vinegar", "1 large garlic clove, finely grated", "2 pinches of English mustard powder", "170g thick, lean fillet steak", "½ tsp vegetable bouillon powder"], "instructions": "Heat the oven to 180C/160C fan/gas 4. Bring a large pan of water to the boil and cook the potatoes for 5 mins. Drain, reserving the water.\nToss the potatoes, carrots, onions and sprouts with 2 tsp of the oil to coat. Arrange on a non-stick baking sheet, spaced apart. Scatter with 1 tsp of the thyme, grind over some black pepper, then roast for 30 mins.\nMeanwhile, mix 1 tsp of the vinegar with the garlic, remaining thyme and oil, the mustard and plenty of black pepper. Rub this over the steak, put in a shallow dish and set aside. Mix the rest of the vinegar with the bouillon and 125ml of the reserved water from step 1, then set aside. After 30 mins, turn the veg over and roast for 15 mins more.\nMeanwhile, heat a small non-stick frying pan over a medium-high heat. Lift the steak out of the marinade, shake off the excess and fry for 2-3 mins on each side until cooked to your liking. Remove to a board and leave to rest. Pour the leftover marinade into the frying pan and bubble until thickened slightly to make a gravy. Slice the steak and serve with the roast veg and gravy on the side.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2021/09/Healthy-roast-dinner-8757ce1.jpg", "nutrients": {"calories": "370 calories", "fatContent": "11 grams fat", "saturatedFatContent": "3 grams saturated fat", "carbohydrateContent": "38 grams carbohydrates", "sugarContent": "15 grams sugar", "fiberContent": "12 grams fiber", "proteinContent": "24 grams protein", "sodiumContent": "0.6 milligram of sodium"}}