{"title": "Pork & squash goulash cobbler", "time": 55, "yields": "2 serving(s)", "ingredients": ["1 tsp olive oil", "250g lean pork fillet, trimmed of any visible fat and cut into chunks", "3 celery sticks, chopped (160g)", "160g butternut squash, peeled and cut into cubes", "1 green pepper, deseeded and diced", "100g button mushrooms, stalks pulled out, and large ones halved", "½ tsp caraway seeds, plus a pinch for sprinkling", "2 tsp smoked paprika", "1 tsp vegetable bouillon powder", "2 tbsp tomato purée", "2 garlic cloves, finely grated", "160g cooked cabbage, to serve", "100g spelt wholemeal flour", "2 tsp baking powder", "1 tsp olive oil", "100g pot natural yogurt", "drop of milk, to glaze (optional)"], "instructions": "Heat the oil in an ovenproof non-stick pan, then stir-fry the pork for 5-7 mins until it starts to brown. Tip in the celery, squash, pepper and mushrooms with their stalks, then cook for a few minutes more.\nStir in the caraway and paprika, then pour in 350ml boiling water, the bouillon, tomato purée and garlic. Cover the pan and simmer for 20 mins until the veg is tender, then remove the lid and simmer for another 5 mins to reduce a little.\nHeat the oven to 220C/200C fan/gas 7. For the cobbler topping, put the flour in a bowl and stir in the baking powder. Combine the oil and yogurt, then stir that into the flour. Bring the mix together into a dough using a cutlery knife. Knead very lightly on a clean work surface, then form into a sausage shape about the width of a large cucumber. Slice evenly into six rounds and arrange on top of the goulash. Brush with a little milk to glaze, if you like, and scatter over a pinch of caraway seeds. Bake for 15-20 mins until golden and cooked – you can tell by lifting one to see if the mixture has set beneath. Serve with the cooked cabbage on the side, if you like.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2021/08/Pork-squash-goulash-cobbler-5f6632e.jpg", "nutrients": {"calories": "469 calories", "fatContent": "12 grams fat", "saturatedFatContent": "3 grams saturated fat", "carbohydrateContent": "46 grams carbohydrates", "sugarContent": "11 grams sugar", "fiberContent": "11 grams fiber", "proteinContent": "38 grams protein", "sodiumContent": "1.6 milligram of sodium"}}