{"title": "Roast chicken & roots", "time": 105, "yields": "4 serving(s)", "ingredients": ["1.6kg whole chicken", "zest and juice 1 lemon", "2 tbsp cold-pressed rapeseed oil", "4-5 thyme sprigs , leaves roughly chopped", "500g butternut squash , cut into chunks", "300g carrots , cut into chunks", "300g parsnips , peeled and cut into long batons", "1 medium red onion , cut into thin wedges", "1 garlic bulb , cloves separated", "100g baby spinach leaves"], "instructions": "Heat oven to 200C/180C fan/gas 6. Put the chicken in a large roasting tin. Remove any trussing elastic and re-tie the chicken’s legs with string, if you like. Rub the lemon juice into the chicken, then rub in 1 tbsp of the oil and sprinkle with the thyme and plenty of seasoning. Roast for 25 mins.\nMix the squash, carrots, parnsips and onion in a bowl with the remaining oil, lemon zest and plenty of ground black pepper, and toss together well.\nTake the chicken out of the oven and put on a plate. Scatter the vegetables into the tin, nestling the garlic cloves underneath, then put the chicken on top. Return to the oven for a further 45 mins, turning the veg after 20 mins until the chicken is cooked and the vegetables are tender and lightly browned.\nTake the chicken out and place on a warmed platter. Cover with foil and leave to rest for 10 mins. Cook the spinach in a saucepan with a drizzle of water, and season with black pepper. Scatter the vegetables around the chicken and serve with the spinach. Squeeze the garlic out of the skins and smear over the chicken, if you like.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/roast-chicken-roots-cc967f4.jpg", "nutrients": {"calories": "524 calories", "fatContent": "24 grams fat", "saturatedFatContent": "5 grams saturated fat", "carbohydrateContent": "28 grams carbohydrates", "sugarContent": "17 grams sugar", "fiberContent": "11 grams fiber", "proteinContent": "42 grams protein", "sodiumContent": "0.5 milligram of sodium"}}