{"title": "Vegan shepherd's pie", "time": 110, "yields": "8 item(s)", "ingredients": ["1.2kg floury potatoes, such as Maris Piper or King Edward", "50ml vegetable oil", "30g dried porcini mushrooms, soaked in hot water for 15 mins, then drained (reserve the liquid)", "2 large leeks, chopped", "2 small onions, chopped", "4 medium carrots (about 300g), cut into small cubes", "1 vegetable stock cube (make sure it's vegan - we used Kallo)", "3 garlic cloves, crushed", "2 tbsp tomato purée", "2 tsp smoked paprika", "1 small butternut squash, peeled and cut into small cubes", "½ small pack marjoram or oregano, leaves picked and roughly chopped", "½ small pack thyme, leaves picked", "½ small pack sage, leaves picked and roughly chopped", "4 celery sticks, chopped", "400g can chickpeas", "300g frozen peas", "300g frozen spinach", "20ml olive oil", "small pack flat-leaf parsley, chopped", "tomato ketchup, to serve (optional)"], "instructions": "Put the unpeeled potatoes in a large saucepan, cover with water, bring to the boil and simmer for 40 mins until the skins start to split. Drain and leave to cool a little.\nMeanwhile, heat the vegetable oil in a large heavy-based sauté pan or flameproof casserole dish. Add the mushrooms, leeks , onions, carrots and the stock cube and cook gently for 5 mins , stirring every so often. If it starts to stick, reduce the heat and stir more frequently, scraping the bits from the bottom. The veg should be soft but not mushy.\nAdd the garlic, tomato purée, paprika, squash and herbs. Stir and turn the heat up a bit, cook for 3 mins, add the celery, then stir and cook for a few more mins.\nTip in the chickpeas along with the water in the can and reserved mushroom stock. Add the peas and spinach and stir well. Cook for 5 mins, stirring occasionally, then season, turn off and set aside. There should still be plenty of liquid and the veg should be bright and a little firm.\nPeel the potatoes and discard the skin. Mash 200g with a fork and stir into the veg. Break the rest of the potatoes into chunks, mix with the olive oil and parsley and season.\nDivide the filling into the pie dishes and top with the potatotes. Heat oven to 190C/170C fan/gas 5 and bake the pies for 40-45 mins, until the top is golden and the filling is heated through. If making individual pies, check after 20 mins. Best served with tomato ketchup – as all great shepherd’s pies are.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/vegan-shepherds-pie-d0ee305.jpg", "nutrients": {"calories": "348 calories", "fatContent": "11 grams fat", "saturatedFatContent": "1 grams saturated fat", "carbohydrateContent": "43 grams carbohydrates", "sugarContent": "10 grams sugar", "fiberContent": "13 grams fiber", "proteinContent": "11 grams protein", "sodiumContent": "0.5 milligram of sodium"}}