{"title": "Afghan-style chicken korma with dried sour plums", "time": 75, "yields": "6 serving(s)", "ingredients": ["chana dhal", "dried sour plums, or 100g dried sour cherries", "sunflower oil", "8 chicken bone-in pieces (use thighs if you like), skin removed", "onion, finely chopped", "ginger, peeled and finely chopped", "garlic cloves, finely chopped", "ground turmeric", "tomatoes, chopped", "green chillies, halved, deseeded and finely sliced", "Greek yogurt", "chicken stock (or use water)", "red chilli, finely sliced", "coriander", "lime wedges", "flatbreads or cooked rice"], "instructions": "Put the chana dhal in a bowl, cover with water and leave to soak for 3 hrs. Meanwhile, put the dried plums or cherries in a second bowl, cover with warm water and leave to soak for 1 hr.\nHeat the oil in a deep 30cm frying pan, and brown the chicken pieces in batches, seasoning as you go. Transfer the browned chicken to a bowl as you cook.\nAdd the onions to the pan and fry over a medium-low heat for 8-10 mins until soft and pale gold. This takes a bit of time. Add the ginger and garlic, and cook for another 3 mins, then add the turmeric. Stir everything together until the spices are fragrant.\nDrain the chana dhal and tip into the pan along with the tomatoes and chillies. Continue to cook, stirring occasionally until the tomatoes have collapsed slightly. Stir in the yogurt, stock and some more seasoning. Return the chicken pieces and any resting juices to the pan, then drain the plums and mix these in. Bring everything to just under the boil (it’s important that the mixture doesn’t fully boil, or the yogurt will curdle), then turn the heat down to low. Cover and cook for about 15 mins, then remove the lid and cook for 15-20 mins more until the chicken is cooked through and the liquid has thickened.\nScatter over the sliced chillies and coriander, then serve with lemon or lime wedges, and flatbreads or rice.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/11/Afghan-chicken-korma-with-sour-dried-plums-b49f9b8.jpg", "nutrients": {"calories": "349 calories", "fatContent": "16 grams fat", "saturatedFatContent": "6 grams saturated fat", "carbohydrateContent": "23 grams carbohydrates", "sugarContent": "18 grams sugar", "fiberContent": "4 grams fiber", "proteinContent": "27 grams protein", "sodiumContent": "0.4 milligram of sodium"}}