{"title": "Cardamom butter chicken", "time": 85, "yields": "4 serving(s)", "ingredients": ["2 garlic cloves , roughly chopped", "thumb-sized piece ginger , chopped", "2 green chillies , chopped (leave seeds in if you like it hot)", "small bunch coriander , leaves picked, stalks roughly chopped", "3 tbsp ghee , or vegetable oil", "2 onions , sliced", "2 tsp each turmeric, garam masala and ground cumin", "1 tsp ground fenugreek", "4 chicken breasts , cut into 2.5cm cubes", "4 cloves", "12 cardamom pods , seeds removed", "1 cinnamon stick", "400g can tomato", "150ml pot yogurt", "50ml double cream", "chapatis and rice , to serve"], "instructions": "Place the garlic, ginger, chillies and coriander stalks in the small bowl of a food processor with a good pinch of salt, and blend to a fine paste – or grind to a paste using a pestle and mortar.\nHeat 2 tbsp of the ghee or oil in a large pan, add the onions and cook slowly for 15-20 mins until golden and caramelised. Tip in the garlic-ginger paste, turn up the heat and cook for a further 5 mins. Add the ground spices and cook for 2 mins more until fragrant. Scoop the spicy onion mixture out of the pan into a bowl.\nAdd the remaining ghee or oil to the pan and cook the chicken over a medium-high heat until browned all over. Tip into a bowl, cover and set aside.\nReturn the onion mixture to the pan along with the whole spices, tomatoes and a can full of water (400ml). Bring to the boil, then cover and simmer gently for 40 mins.\nReturn the chicken to the pan and cook, uncovered, for a further 10 mins until the sauce has thickened and the chicken is cooked through. Stir in the yogurt and cream, season well and scatter with coriander leaves. Serve with chapatis and rice.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-984573_10-53c2a85.jpg", "nutrients": {"calories": "460 calories", "fatContent": "32 grams fat", "saturatedFatContent": "16 grams saturated fat", "carbohydrateContent": "12 grams carbohydrates", "sugarContent": "9 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "32 grams protein", "sodiumContent": "0.4 milligram of sodium"}}