{"title": "Coconut & tamarind chicken curry", "time": 80, "yields": "10 serving(s)", "ingredients": ["20 skinless, boneless chicken thighs", "juice 3 limes", "2 tsp coarsely ground black pepper", "2 tsp turmeric", "6 tbsp vegetable oil , for frying", "3 tbsp tamarind pulp", "400ml coconut milk", "1 x 160ml can coconut cream", "2 tbsp coriander , chopped", "4-6 tbsp vegetable oil", "3 tsp mustard seed", "3 tbsp fresh or dried curry leaf", "4 onions , finely diced", "8 garlic cloves , crushed", "75g ginger , finely shredded", "1 tbsp paprika", "3 x 400g cans chopped tomatoes", "450ml chicken stock", "2 tbsp golden muscovado sugar"], "instructions": "Put the chicken in a big mixing bowl, add the lime juice, pepper and turmeric, and mix well. (It’s best to use gloves for this as the turmeric stains fingers.) Set aside for 1 hr.\nMake the sauce. Heat the oil in a big pan, toss in the mustard seeds followed by the fresh curry leaves (if you are using dried leaves, add them later with the tomatoes) and fry until it releases a warm, nutty aroma – about 30 secs.\nAdd the onions, put on the lid, and cook over a low heat for 10-15 mins until meltingly soft, stirring now and then. Take the lid off, turn up the heat, add the garlic and ginger, and fry for 1 min until it gives off a toasty aroma. Stir in the paprika and continue cooking for another 30 secs.\nAdd the tomatoes, stock and sugar (and dried curry leaves if using). Cook, uncovered, for 15-20 mins until the sauce has thickened and reduced by one-third.\nHeat oven to 180C/160C fan/gas 4. Meanwhile, fry the chicken. Heat 6 tbsp oil in a frying pan and cook in batches until golden. You may need a little extra oil. Keep warm.\nPour any excess oil from the frying pan and add a ladleful of water – swirl it around and scrape up any juices with a spoon before adding to the tomato sauce.\nPut the chicken in a deep roasting tin or ovenproof casserole and pour over the sauce. Cover with foil and oven cook for 15 mins until the chicken is tender. Skim off any oil from the top of the sauce.\nTake the chicken pieces out of the tin and transfer to a serving dish. Pour the sauce into a pan and bring to a simmer. Stir in the tamarind pulp, coconut milk and half the coconut cream. Adjust the flavour by adding more sugar or tamarind. Ladle the sauce over the chicken, drizzle with the remaining coconut cream, and scatter with coriander before serving.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-856507_10-469f92e.jpg", "nutrients": {"calories": "466 calories", "fatContent": "24 grams fat", "saturatedFatContent": "8 grams saturated fat", "carbohydrateContent": "24 grams carbohydrates", "sugarContent": "20 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "40 grams protein", "sodiumContent": "1.1 milligram of sodium"}}