{"title": "Creamy chicken & mango curry", "time": 70, "yields": "8 serving(s)", "ingredients": ["12 boneless, skinless chicken thighs", "2 tsp turmeric", "2 tbsp sunflower oil", "2 onions , 1 chopped, 1 quartered", "2 large ripe mangoes", "6 tbsp good-quality korma paste", "100g ginger , roughly chopped", "2 tsp ground cumin", "1 tbsp black onion seed (kalonji or nigella)", "400g can light coconut milk", "600ml chicken stock", "few coriander sprigs, basmati rice, naan bread, mango chutney, lime pickle and our sides (see 'goes well with'), to serve (optional)"], "instructions": "Toss the chicken thighs with 1 tsp of the turmeric and some salt. Heat the oil in a big frying pan or wide flameproof casserole, and brown the thighs well on both sides. Remove from the pan. Add the chopped onion and cook for 5 mins until softened.\nRoughly cut all the flesh from one of the mangoes, scraping as much as you can from the stone. Put into a food processor with the korma paste, ginger and quartered onion. Whizz to a paste, then tip into the pan and gently cook until softened.\nStir in the remaining turmeric, cumin and onion seeds and turn up the heat for a couple of mins. Return the chicken to the pan. Stir in the coconut milk and stock. Bring to a gentle simmer, then cover and cook for 20 mins.\nUncover the pan and cook for another 25-30 mins until the chicken is really tender, adding a few drops of water to keep it saucy.\nSlice the remaining mango and stir in to heat through while you shred the chicken with two forks. Season and serve scattered with the coriander, with basmati rice, naan bread, chutney, lime pickle and our sides, if you like.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1159456_11-0822cce.jpg", "nutrients": {"calories": "384 calories", "fatContent": "17 grams fat", "saturatedFatContent": "6 grams saturated fat", "carbohydrateContent": "17 grams carbohydrates", "sugarContent": "14 grams sugar", "fiberContent": "3 grams fiber", "proteinContent": "41 grams protein", "sodiumContent": "1.2 milligram of sodium"}}