{"title": "Cumin-scented chicken curry", "time": 50, "yields": "6 serving(s)", "ingredients": ["12large chicken thighs , bone in", "4 tbsp vegetable oil or sunflower oil", "2 tsp cumin seed", "2medium onions , sliced", "3cm piece of fresh root ginger , peeled and shredded", "3fat garlic cloves , shredded", "3plump green chillies , halved lengthways (leave in some or all of the seeds if you like a hot curry)", "½ tsp turmeric", "½ tsp garam masala", "2 tsp paprika", "2large peppers , one red and one yellow or orange, seeded and cut into rough chunks", "2 tbsp tomato purée", "250ml tub natural yogurt", "3 tbsp chopped coriander , to serve"], "instructions": "Pull the skin off the chicken using kitchen paper to get a good grip. Set the chicken aside. Heat the oil in a large pan over a medium heat – a wok is great for this. Fry the cumin seeds for just a few secs until they give off a lovely nutty aroma, then tip in the onions and turn the heat down low. Cook with the lid on until the onions are soft and squidgy, but not yet starting to colour – 10 mins.\nScatter in the ginger, garlic and chillies and fry for a minute or so, then sprinkle in the turmeric, garam masala and paprika. Stir in the chicken and peppers and continue frying for about 10 mins until the spice mixture clings to the chicken and the onions turn russet brown. Add a splash of water if they start to catch on the bottom of the pan.\nStir the tomato purée into the yogurt, turn down the heat a fraction and swirl the yogurt into the pan followed by 125ml/4fl oz cold water. Bring to a simmer and cook gently without a lid for about 30-35 mins until the chicken is tender, stirring in a little more water if the sauce becomes dry – it should thicken and take on a warm reddish tinge. Add salt if you want to. (Will keep in the fridge for up to 2 days.) Reheat in a covered casserole in the oven at 200C/fan 180C/gas 6 for 20-30 mins or until bubbling (you may need to stir in a splash of water if the sauce is too thick). Scatter over coriander before serving.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-871500_11-5ae89bf.jpg", "nutrients": {"calories": "810 calories", "fatContent": "59 grams fat", "saturatedFatContent": "16 grams saturated fat", "carbohydrateContent": "11 grams carbohydrates", "fiberContent": "2 grams fiber", "proteinContent": "60 grams protein", "sodiumContent": "0.76 milligram of sodium"}}