{"title": "Home-style chicken curry", "time": 45, "yields": "4 serving(s)", "ingredients": ["1 large onion", "6 garlic cloves, roughly chopped", "50g ginger, roughly chopped", "4 tbsp vegetable oil", "2 tsp cumin seeds", "1 tsp fennel seeds", "5cm cinnamon stick", "1 tsp chilli flakes", "1 tsp garam masala", "1 tsp turmeric", "1 tsp caster sugar", "400g can chopped tomatoes", "8 chicken thighs, skinned, boneless (about 800g)", "250ml hot chicken stock", "2 tbsp chopped coriander"], "instructions": "Roughly chop 1 large onion, transfer to a small food processor, and add 3 tbsp of water - process to a slack paste. You could use a stick blender for this or coarsely grate the onion into a bowl – there’s no need to add any water if you are grating the onion. Tip into a small bowl and leave on one side.\nPut 6 roughly chopped garlic cloves and 50g roughly chopped ginger into the same food processor and add 4 tbsp water – process until smooth and spoon into another small bowl. Alternatively, crush the garlic to a paste with a knife or garlic press and finely grate the ginger.\nHeat 4 tbsp vegetable oil in a wok or sturdy pan set over a medium heat.\nCombine 2 tsp cumin seeds and 1 tsp fennel seeds with a 5cm cinnamon stick and 1 tsp chilli flakes and add to the pan in one go. Swirl everything around for about 30 secs until the spices release a fragrant aroma.\nAdd the onion paste – it will splutter in the beginning. Fry until the water evaporates and the onions turn a lovely dark golden - this should take about 7-8 mins.\nAdd the garlic and ginger paste and cook for another 2 mins – stirring all the time.\nStir in 1 tsp garam masala, 1 tsp turmeric, and 1 tsp caster sugar and continue cooking for 20 secs before tipping in a 400g can chopped tomatoes.\nContinue cooking on a medium heat for about 10 mins without a lid until the tomatoes reduce and darken.\nCut 8 skinless, boneless chicken thighs into 3cm chunks and add to the pan once the tomatoes have thickened to a paste.\nCook for 5 mins to coat the chicken in the masala and seal in the juices, and then pour over 250ml hot chicken stock.\nSimmer for 8-10 mins without a lid until the chicken is tender and the masala lightly thickened – you might need to add an extra ladleful of stock or water if the curry needs it.\nSprinkle with 2 tbsp chopped coriander and serve with Indian flatbreads or fluffy basmati rice and a pot of yogurt on the side.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-908515_10-0551430.jpg", "nutrients": {"calories": "382 calories", "fatContent": "17.7 grams fat", "saturatedFatContent": "3 grams saturated fat", "carbohydrateContent": "10.7 grams carbohydrates", "sugarContent": "7.4 grams sugar", "fiberContent": "2.1 grams fiber", "proteinContent": "46.8 grams protein", "sodiumContent": "0.8 milligram of sodium"}}