{"title": "John's Thai chicken curry", "time": 35, "yields": "2 serving(s)", "ingredients": ["1 tbsp vegetable oil", "400ml can coconut milk", "1 tbsp Thai red curry paste (I like the ones that come in plastic tubs - Mae Ploy is a good brand)", "2 garlic cloves , grated", "thumb-sized piece ginger , grated", "6 fresh or dried lime leaves", "2 lemongrass stalks, bashed", "1 chicken stock cube", "1 tsp palm sugar", "1 sweet potato , peeled and cut into chunks", "1 tsp Thai fish sauce", "handful coriander leaves", "handful beansprouts", "2 long red chillies , sliced", "2 dried rice noodles nests (100g)", "2 chicken breasts , cut into bite-sized pieces"], "instructions": "1 In a large, heavy-based pan, heat the vegetable oil with 1 tbsp of the coconut milk. When it’s hot and starting to splatter, add the red curry paste. Stir and cook gently over a medium-low heat for 1-2 mins – it should start to change colour. Add the garlic, ginger, lime leaves and lemongrass, and turn up the heat a little. Stir and smell it – it will start to change from the smell of raw garlic and spices to roasted ones. As it turns dark red, add the stock cube and the palm sugar – it will melt and become even darker and richer. Add the sweet potato and the fish sauce, then stir until coated in the paste. Add the coconut milk and 200ml water . Stir, bring to the boil , then turn down to a simmer and cook for 12 mins.\nMeanwhile, mix the coriander, beansprouts and chilli. Cook and drain the noodles following pack instructions, then tip into in a large serving bowl. Taste the curry and season with some more fish sauce or sweeten with a little sugar if necessary. Turn up the heat and bring to the boil, then tip the chicken into the sauce. Return to the boil and simmer for 5-7 mins.\nRemove the lemongrass, then spoon the chicken over the noodles and sprinkle with the coriander, chilli and beansprout s to serve.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/johns-thai-green-curry-4165af8.jpg", "nutrients": {"calories": "830 calories", "fatContent": "43 grams fat", "saturatedFatContent": "30 grams saturated fat", "carbohydrateContent": "69 grams carbohydrates", "sugarContent": "14 grams sugar", "fiberContent": "5 grams fiber", "proteinContent": "37 grams protein", "sodiumContent": "2.6 milligram of sodium"}}