{"title": "Lighter massaman chicken curry", "time": 70, "yields": "4 serving(s)", "ingredients": ["1 tbsp coriander seed", "2 tsp cumin seed", "seeds from 5 cardamom pods", "3 cloves", "½ tsp crushed dried chilli", "2 tsp rapeseed oil", "100g shallot , finely chopped", "3 garlic cloves , finely chopped", "2.5cm piece ginger , finely grated", "1 plump lemongrass stalk, tough ends and outside layer removed, finely chopped", "4 tbsp light coconut milk (from the can, below)", "¼ tsp ground black pepper", "25g unsalted, unroasted peanut", "2 tsp rapeseed oil", "140g small shallot (6-7), halved", "1 cinnamon stick , broken in half", "400ml can light coconut milk", "500g skinless, boneless chicken breast , cut into bite-sized pieces", "200g sweet potato , cut into 2.5cm chunks", "175g green bean , stem ends trimmed", "1 tbsp fish sauce", "2 tsp tamarind paste", "75ml chicken stock", "coriander or Thai basil leaves (or both), to garnish", "a small handful of peanuts , to garnish"], "instructions": "To make the curry paste, heat a small heavy-based frying pan and drop in all the seeds and the cloves. Dry-fry over a medium heat, shaking the pan often, for 1-2 mins to release their flavours – until they start popping in the pan. Mix in the chillies, then grind finely using a pestle and mortar or a spice grinder. Set aside.\nHeat the oil in the same pan. Tip in the shallots and garlic, and fry over a medium heat for 5-6 mins, stirring occasionally, until a deep, rich golden brown. Stir in the ground spices and stir-fry for 1 min. Spoon into a mini processor with the ginger, lemongrass and coconut milk. Blitz until it is as smooth as you can get it, then stir in the black pepper. Can be kept in the fridge for several days.\nTo make the curry, dry-fry the peanuts in a small frying pan for about 2 mins to give them extra colour and flavour. Set aside. Heat the oil in a large sauté pan, tip in the shallots and fry over a medium heat, turning occasionally, for 8-10 mins until they are well browned all over and softened. Remove and set aside. Put the cinnamon stick and curry paste in the sauté pan and cook for 1 min. Pour in 100ml of the coconut milk. Let it bubble for 2 mins, stirring occasionally, until it’s like a thick paste. Tip in the chicken and stir-fry in the paste over a high-ish heat for 6-8 mins or until cooked.\nMeanwhile, steam the sweet potato chunks for 8-10 mins and the beans for about 5 mins. Remove the pan of chicken from the heat and stir in the remaining coconut milk, the fish sauce, tamarind paste and stock. Lay the sweet potatoes and shallots in the curry and warm through gently over a very low heat – overheating or overcooking may cause the coconut milk to curdle and thicken. If you need to thin the sauce slightly, stir in 1-2 spoons of water. Remove the cinnamon.\nLay a bunch of the beans to one side of each serving bowl or plate. Spoon the curry over one end of the beans and serve scattered with the coriander, Thai basil and peanuts.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1176542_11-c66368f.jpg", "nutrients": {"calories": "348 calories", "fatContent": "15.8 grams fat", "saturatedFatContent": "1.5 grams saturated fat", "carbohydrateContent": "18 grams carbohydrates", "sugarContent": "8.3 grams sugar", "fiberContent": "4.4 grams fiber", "proteinContent": "36.4 grams protein", "sodiumContent": "1.1 milligram of sodium"}}