{"title": "Low-fat chicken biryani", "time": 120, "yields": "5 serving(s)", "ingredients": ["3 garlic cloves , finely grated", "2 tsp finely grated ginger", "¼ tsp ground cinnamon", "1 tsp turmeric", "5 tbsp natural yogurt", "600g boneless, skinless chicken breast , cut into 4-5cm pieces", "2 tbsp semi-skimmed milk", "good pinch saffron", "4 medium onions", "4 tbsp rapeseed oil", "½ tsp hot chilli powder", "1 cinnamon stick , broken in half", "5 green cardamom pods , lightly bashed to split", "3 cloves", "1 tsp cumin seed", "280g basmati rice", "700ml chicken stock", "1 tsp garam masala", "handful chopped coriander leaves"], "instructions": "In a mixing bowl, stir together the garlic, ginger, cinnamon, turmeric and yogurt with some pepper and ¼ tsp salt. Tip in the chicken pieces and stir to coat (see step 1, above). Cover and marinate in the fridge for about 1 hr or longer if you have time. Warm the milk to tepid, stir in the saffron and set aside.\nHeat oven to 200C/180C fan/gas 6. Slice each onion in half lengthways, reserve half and cut the other half into thin slices. Pour 1½ tbsp of the oil onto a baking tray, scatter over the sliced onion, toss to coat, then spread out in a thin, even layer (step 2). Roast for 40-45 mins, stirring halfway, until golden.\nWhen the chicken has marinated, thinly slice the reserved onion. Heat 1 tbsp oil in a large sauté or frying pan. Fry the onion for 4-5 mins until golden. Stir in the chicken, a spoonful at a time, frying until it is no longer opaque, before adding the next spoonful (this helps to prevent the yogurt from curdling). Once the last of the chicken has been added, stir-fry for a further 5 mins until everything looks juicy. Scrape any sticky bits off the bottom of the pan, stir in the chilli powder, then pour in 100ml water, cover and simmer on a low heat for 15 mins. Remove and set aside.\nCook the rice while the chicken simmers. Heat another 1 tbsp oil in a large sauté pan, then drop in the cinnamon stick, cardamom, cloves and cumin seeds. Fry briefly until their aroma is released. Tip in the rice (step 3) and fry for 1 min, stirring constantly. Stir in the stock and bring to the boil. Lower the heat and simmer, covered, for about 8 mins or until all the stock has been absorbed. Remove from the heat and leave with the lid on for a few mins, so the rice can fluff up. Stir the garam masala into the remaining 1½ tsp oil and set aside. When the onions are roasted, remove and reduce oven to 180C/160C fan/gas 4.\nSpoon half the chicken and its juices into an ovenproof dish, about 25 x 18 x 6cm, then scatter over a third of the roasted onions. Remove the whole spices from the rice, then layer half of the rice over the chicken and onions. Drizzle over the spiced oil. Spoon over the rest of the chicken and a third more onions. Top with the remaining rice (step 4) and drizzle over the saffron-infused milk. Scatter over the rest of the onions, cover tightly with foil and heat through in the oven for about 25 mins. Serve scattered with the mint and coriander.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1136462_11-7b940b5.jpg", "nutrients": {"calories": "485 calories", "fatContent": "11.7 grams fat", "saturatedFatContent": "1.5 grams saturated fat", "carbohydrateContent": "51.7 grams carbohydrates", "sugarContent": "7.1 grams sugar", "fiberContent": "2.7 grams fiber", "proteinContent": "40.1 grams protein", "sodiumContent": "0.6 milligram of sodium"}}