{"title": "Sali murghi", "time": 75, "yields": "8 serving(s)", "ingredients": ["2½ tbsp ghee or vegetable oil", "8 chicken thighs", "1 cinnamon stick", "5 green cardamom pods , bashed, seeds removed", "1 tsp cumin seeds", "2 onions , finely chopped", "2 green chillies , roughly chopped", "3 garlic cloves , roughly chopped", "5cm piece ginger , roughly chopped", "1 tsp ground coriander", "1 tsp ground garam masala", "1 tsp Kashmiri chilli powder", "½ tsp turmeric", "3 medium tomatoes , around 300g, finely chopped (or blitzed)", "2 tbsp white wine vinegar", "2 tsp jaggery (or soft brown sugar)", "150g dried apricots (use the soft, ready-to-eat type)", "½ small pack coriander , chopped", "1 large potato , peeled and sliced into matchsticks (see tip below)", "vegetable oil , for shallow frying"], "instructions": "Melt 1 tbsp of the ghee in a pan and add the chicken, skin-side side down. Once the skin is golden and crisp (around 5 mins), remove from the pan and set aside (you may need to do this in batches). Melt the remaining ghee in the pan, add the cinnamon, cardamom and cumin seeds, and fry until fragrant – around 5 mins. Stir in the onions along with a big pinch of salt and fry for 5 mins until browning in places.\nBlitz the green chilli with the garlic and ginger, add to the pan and cook for 2 more mins, then stir in the spices and cook for a few mins more, splashing in a little water to prevent the spices from sticking. Tip in the chopped tomatoes.\nReturn the chicken to the pan, coating it with the curry base, then splash in the white wine vinegar followed by the jaggery. Add 100ml water, then cover and simmer for 30 mins. Remove the lid and stir in the apricots and coriander, then cook for 10-15 mins longer, until the gravy reduces.\nMeanwhile, make the sali. Pat the potato matchsticks dry with kitchen paper. Pour vegetable oil into a small, deep saucepan until it’s a few cm deep, and heat over a medium-high heat. Add a handful of the potato matchsticks at a time and fry for around a minute, until golden and crisp. Remove with a slotted spoon, drain on kitchen paper and season generously. Serve the curry with the sali piled on top.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/sali-murghi-4507342.jpg", "nutrients": {"calories": "385 calories", "fatContent": "23 grams fat", "saturatedFatContent": "8 grams saturated fat", "carbohydrateContent": "18 grams carbohydrates", "sugarContent": "16 grams sugar", "fiberContent": "5 grams fiber", "proteinContent": "24 grams protein", "sodiumContent": "0.3 milligram of sodium"}}