{"title": "Thai chicken curry", "time": 40, "yields": "4 serving(s)", "ingredients": ["2 shallots, or 1 small onion", "1 stalk lemongrass", "1 tbsp vegetable oil", "3-4 tsp red Thai curry paste", "4 boneless and skinless chicken breasts, cut into bite-size pieces", "1 tbsp fish sauce", "1 tsp sugar, brown is best", "4 lime leaves", "400ml can coconut milk", "20g pack fresh coriander"], "instructions": "Peel shallots or onion and cut in half from top to root. Lay the cut sides flat on a board and thinly slice. Very finely slice the lemongrass, starting at the thinner end, stopping towards the base when it gets tough (often described as ‘woody’ and white in the centre).\nHeat the oil in a wok or large saucepan for a couple of minutes until the oil separates (it looks more liquid at this point). Add the shallots or onion. Fry for 3-5 mins, until soft and translucent. Stir in the curry paste and cook for 1 min, stirring all the time.\nAdd chicken pieces and stir until they are coated. Add the lemongrass, fish sauce, sugar, lime leaves and coconut milk. Bring slowly to the boil, then reduce heat and simmer, uncovered, for 15 mins until the chicken is cooked. Stir the curry a few times while it cooks, to stop it sticking and to keep the chicken submerged.\nWhile the chicken is cooking, strip the leaves from the coriander stalks, gather into a pile and chop very roughly. Taste the curry and add a little more curry paste and salt if you think it needs it. Stir half the coriander into the curry and sprinkle the rest over the top. Serve with Thai jasmine or basmati rice.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1035606_11-4cddcf3.jpg", "nutrients": {"calories": "388 calories", "fatContent": "26 grams fat", "saturatedFatContent": "16 grams saturated fat", "carbohydrateContent": "6.1 grams carbohydrates", "sugarContent": "4 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "31 grams protein", "sodiumContent": "1.35 milligram of sodium"}}