{"title": "Cheesy ham hock, spinach & ricotta lasagne", "time": 105, "yields": "6 serving(s)", "ingredients": ["70g butter", "70g plain flour", "1l whole milk", "1 bay leaf", "80g grated parmesan or gruyère", "2 tsp Dijon mustard", "pinch of cayenne pepper", "600g spinach", "250g ricotta", "1 whole nutmeg , for grating", "300g ham hock , shredded, or thick-cut ham, chopped", "12 dried lasagne sheets", "50g grated mozzarella"], "instructions": "Melt the butter in a pan until foaming, then stir in the flour to make a paste. Cook for 2 mins. Remove from the heat and gradually whisk in the milk. Add the bay leaf, return to the heat, and bring to a simmer. Cook for 4-5 mins, whisking continuously until thickened. Remove from the heat and whisk in 50g parmesan, the mustard and cayenne pepper. Season to taste.\nPut the spinach in a large pan with 50ml boiling water, cover and leave for 2-3 mins to wilt. Drain and leave to cool. Put the spinach in a clean tea towel and squeeze out any excess water. Transfer to a food processor and pulse to roughly chop, then add the ricotta and pulse again to combine. Grate in some nutmeg, then season.\nHeat the oven to 200C/180C fan/gas 6. Remove the bay leaf from the sauce, then spoon a quarter into the bottom of a 24 x 28cm baking dish. Top with a third of the ricotta and spinach mixture, a third of the ham, then 4 lasagne sheets (overlap them slightly if needed). Repeat with the remaining ingredients, finishing with a layer of sauce. Top with the remaining parmesan and the mozzarella. Bake for 45-50 mins or until golden, covering halfway through if it’s starting to brown.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/cheesy_ham_hock_spinach_ricotta_lasagne-ba32dc8.jpg", "nutrients": {"calories": "606 calories", "fatContent": "30 grams fat", "saturatedFatContent": "18 grams saturated fat", "carbohydrateContent": "47 grams carbohydrates", "sugarContent": "10 grams sugar", "fiberContent": "3 grams fiber", "proteinContent": "36 grams protein", "sodiumContent": "2.4 milligram of sodium"}}