{"title": "Chicken & mushroom hot-pot", "time": 60, "yields": "4 serving(s)", "ingredients": ["50g butter or margarine, plus extra for greasing", "1 onion, chopped", "100g button mushrooms, sliced", "40g plain flour", "1 chicken stock cube or 500ml fresh chicken stock", "pinch of nutmeg", "pinch of mustard powder", "250g cooked chicken, chopped", "2 handfuls of a mixed pack of sweetcorn, peas, broccoli and carrots, or pick your favourites", "2 large potatoes, sliced into rounds", "knob of butter, melted"], "instructions": "Heat oven to 200C/180C fan/gas 6. Put the butter in a medium-size saucepan and place over a medium heat. Add the onion and leave to cook for 5 mins, stirring occasionally. Add the mushrooms to the saucepan with the onions.\nOnce the onion and mushrooms are almost cooked, stir in the flour – this will make a thick paste called a roux. If you are using a stock cube, crumble the cube into the roux now and stir well. Put the roux over a low heat and stir continuously for 2 mins – this will cook the flour and stop the sauce from having a floury taste.\nTake the roux off the heat. Slowly add the fresh stock, if using, or pour in 500ml water if you’ve used a stock cube, stirring all the time. Once all the liquid has been added, season with pepper, a pinch of nutmeg and mustard powder. Put the saucepan back onto a medium heat and slowly bring it to the boil, stirring all the time. Once the sauce has thickened, place on a very low heat. Add the cooked chicken and vegetables to the sauce and stir well. Grease a medium-size ovenproof pie dish with a little butter and pour in the chicken and mushroom filling.\nCarefully lay the potatoes on top of the hot-pot filling, overlapping them slightly, almost like a pie top.\nBrush the potatoes with a little melted butter and cook in the oven for about 35 mins. The hot-pot is ready once the potatoes are cooked and golden brown.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chicken-mushroom-hot-pot-07d16a5.jpg", "nutrients": {"calories": "343 calories", "fatContent": "15 grams fat", "saturatedFatContent": "7 grams saturated fat", "carbohydrateContent": "29 grams carbohydrates", "sugarContent": "3 grams sugar", "fiberContent": "3 grams fiber", "proteinContent": "22 grams protein", "sodiumContent": "1.1 milligram of sodium"}}