{"title": "Crispy chicken strips", "time": 30, "yields": "4 serving(s)", "ingredients": ["150ml buttermilk , or skimmed milk mixed with 2 tsp lemon juice then left for 5 mins", "2 large skinless chicken breasts or 4 small pieces pork escalope", "50g panko breadcrumbs", "1 tbsp rapeseed oil", "2 tbsp ketchup", "1 tsp soy sauce", "½ tsp white wine vinegar", "2 large or 4 small carrots (about 300g), peeled and grated", "½ lemon , juiced", "1 tbsp olive oil", "baked potatoes , to serve"], "instructions": "Pour the buttermilk into a wide, shallow bowl. Cut each chicken breast in half horizontally and pat dry with kitchen paper. Turn them over in the buttermilk, leave in the dish and chill for 1 hr. Meanwhile, for the salad, mix the carrot with the lemon juice and olive oil. Mix the sauce ingredients together in another bowl and set both aside.\nHeat a large, non-stick frying pan, tip in the breadcrumbs and toast in the dry pan for 2-3 mins until pale brown, stirring regularly so they don’t burn. Tip into a bowl and break up any large clumps.\nHeat oven to 230C/210C fan/gas 8. Tip the crumbs onto a large plate, then lift the chicken breasts from the buttermilk, and roll them in the crumbs, making sure they are coated evenly.\nHeat ½ tbsp of oil in a non-stick frying pan. Fry the chicken for 1-2 mins over a medium-high heat, then turn it over, adding the rest of the oil and fry for 1 min more.\nTransfer the chicken to a baking sheet and bake for 5 mins, then rest for 5 mins and cut into strips. Serve the chicken and the carrot salad with the sauce and baked potatoes.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chicken-katsu-dippers-faff4ff.jpg", "nutrients": {"calories": "229 calories", "fatContent": "7 grams fat", "saturatedFatContent": "1 grams saturated fat", "carbohydrateContent": "18 grams carbohydrates", "sugarContent": "9 grams sugar", "fiberContent": "3 grams fiber", "proteinContent": "21 grams protein", "sodiumContent": "0.7 milligram of sodium"}}