{"title": "Harissa fish pie", "time": 105, "yields": "0 serving(s)", "ingredients": ["700g sweet potatoes (3-4 small ones or 2 large ones)", "3 tbsp rapeseed oil", "pinch of cumin", "pinch of smoked paprika", "1 onion, finely chopped", "1 red pepper, finely chopped", "350ml semi-skimmed milk", "350g fish pie mix (make sure it contains smoked haddock)", "225g frozen king prawns, defrosted", "2½ tbsp harissa paste", "2 tbsp cornflour", "30ml double cream", "200g spinach, roughly chopped", "steamed green beans, to serve"], "instructions": "Heat the oven to 180C/160C fan/gas 4. Prick the sweet potatoes with a fork and cook for 50 mins-1 hr or until the flesh is soft (or in the microwave on high for 5-7 mins). Remove the skin and mash the flesh with 2 tbsp of the oil, the cumin and paprika. Set aside and keep warm.\nMeanwhile, heat a frying pan with the remaining 1 tbsp oil, and cook the onions and peppers over a medium heat until soft, about 7 mins. Warm the milk in a pan over a low-medium heat and add the fish pie mix and the prawns. Cook for 4 mins until the prawns have just turned pink, then scoop out the fish and prawns. Reserve the milk.\nAdd the harissa paste to the onions and peppers and cook for 2 mins. Stir through the cornflour, then add the reserved milk bit by bit, stirring as you go, followed by the cream. Add the spinach and cook for 2 mins until it softens, then add the fish and prawns, stirring carefully to avoid breaking them up.\nPour the fish mixture into an ovenproof dish, approximately 25 x 18cm. Carefully spoon the sweet potato on top, going from end- to-end and meeting in the middle. Carefully spread out with a knife, then go over it with a fork to make ridges. Bake for 20 mins, then grill for 10 mins on the hottest setting. Serve with the green beans.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2021/03/Harissa-fish-pie-9a1d880.jpg", "nutrients": {"calories": "539 calories", "fatContent": "20 grams fat", "saturatedFatContent": "5 grams saturated fat", "carbohydrateContent": "52 grams carbohydrates", "sugarContent": "27 grams sugar", "fiberContent": "9 grams fiber", "proteinContent": "34 grams protein", "sodiumContent": "1.1 milligram of sodium"}}