{"title": "Lighter spaghetti & meatballs", "time": 65, "yields": "4 serving(s)", "ingredients": ["1 tsp rapeseed oil", "280g spaghetti", "200g green lentils (well drained weight from a 400g can)", "250g lean minced pork (max 8% fat)", "½ tsp finely chopped rosemary", "½ tsp Dijon mustard", "1 garlic clove , crushed", "1 tbsp rapeseed oil", "2 shallots , finely chopped", "2 garlic cloves , finely chopped", "500g cherry tomatoes , preferably on the vine, halved", "2 tsp tomato purée", "pinch of chilli flakes", "2 tbsp chopped oregano , plus a few chopped leaves to garnish"], "instructions": "Heat oven to 200C/180C fan/gas 6. Line a baking sheet with foil and brush with 1 tsp oil. Mash the lentils in a bowl with the back of a fork to break down a bit, but not completely. Stir in the pork, rosemary, mustard, garlic, some pepper to generously season, and mix well with the fork to distribute the lentils evenly. Divide the mixture into 4. Form each quarter into 5 small balls – to give you 20 in total – squeezing the mixture together well as you shape it. Lay the meatballs on the foil and roll them around in the oil to coat all over. Bake for 15 mins until cooked and lightly browned. Remove (leave the oven on) and set aside.\nWhile the meatballs cook, heat 2 tsp of the oil for the sauce in a large non-stick frying pan. Tip in the shallots and garlic, and fry on a medium heat for 3-4 mins until softened and tinged brown. Pour in the remaining 1 tsp oil, lay the tomatoes in the pan so most of them are cut-side down (to help release the juices), raise the heat and fry them for 3-4 mins or until the tomatoes are starting to soften and release their juices. Don’t stir, or they may lose their shape. Splash in 125-150ml water so it all bubbles, and gently mix in the tomato purée. Lower the heat and simmer for 2 mins to create a juicy, chunky sauce. Season with the chilli flakes, oregano, pepper and a pinch of salt, and give it a quick stir, adding a drop more water if needed – you want it thick enough to coat the meatballs.\nPour the sauce into a casserole dish, add the meatballs and spoon the sauce over them to coat. Cover with foil and bake for 10 mins while you cook the spaghetti.\nBoil a large saucepan of water. Add the spaghetti, stir and bring back to the boil. Cook for 10-12 mins, or following pack instructions, until al dente. Drain well, season with pepper and serve with the meatballs, sauce and a light sprinkling of oregano.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/lighter-spaghetti-meatballs-fb343c6.jpg", "nutrients": {"calories": "473 calories", "fatContent": "11.6 grams fat", "saturatedFatContent": "2.8 grams saturated fat", "carbohydrateContent": "60.6 grams carbohydrates", "sugarContent": "7.6 grams sugar", "fiberContent": "8.8 grams fiber", "proteinContent": "27.3 grams protein", "sodiumContent": "0.4 milligram of sodium"}}