{"title": "Pepper steak with noodles", "time": 27, "yields": "4 serving(s)", "ingredients": ["2 tbsp light soy sauce", "4 tbsp shaohsing wine (or dry sherry)", "3 garlic cloves, crushed", "1-inch piece of ginger, peeled and grated", "450g steak (skirt steak works well)", "1 tbsp vegetable oil", "2 tbsp cornflour", "1 tbsp sesame oil", "1 onion, cut into thick slices", "1 red and 1 yellow pepper, both cut into 1-inch pieces", "pinch of sesame seeds", "1-2 tsp crushed black peppercorns", "500g cooked noodles, to serve"], "instructions": "Mix 1 tbsp of the soy with 1 tbsp of the shaohsing wine, 1 crushed garlic clove and half the ginger. Pour over the steak and leave for at least 20 mins or up to 1 hr. Heat a frying pan over a high heat until very hot. Take the steak out of the marinade and scrape off as much of it as you can. Rub with the vegetable oil and put in the frying pan. Leave for 2 mins, then gently move it around to catch any bits of char, which will add to the flavour. After another 30 seconds, turn the steak and cook for 2½ mins on the other side. Transfer to a plate and set aside.\nMix the cornflour into the remaining soy sauce and shaohsing wine and add 150ml water. Heat the sesame oil in a wok or frying pan over a medium-high heat and add the onion. Cook for 1 min, stirring, then add the peppers. Cook for 4 mins, stirring regularly. Once they are starting to soften with bits of char on them, add the remaining garlic and ginger, and soy mixture. As soon as the sauce starts to thicken, remove from the heat.\nSlice the steak thinly and add to the wok, just stirring through. Sprinkle with the sesame seeds and crushed peppercorns and serve with the noodles.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2021/03/Pepper-steak-with-noodles-d582f5c.jpg", "nutrients": {"calories": "479 calories", "fatContent": "15 grams fat", "saturatedFatContent": "4 grams saturated fat", "carbohydrateContent": "47 grams carbohydrates", "sugarContent": "7 grams sugar", "fiberContent": "6 grams fiber", "proteinContent": "36 grams protein", "sodiumContent": "1.2 milligram of sodium"}}