{"title": "Spinach & ricotta cannelloni", "time": 90, "yields": "10 item(s)", "ingredients": ["3 tbsp olive oil", "8 garlic cloves, crushed", "3 tbsp caster sugar", "2 tbsp red wine vinegar", "4 x 400g cans chopped tomatoes", "small bunch basil leaves", "2 x 250g tubs mascarpone", "3 tbsp milk", "85g parmesan (or vegetarian alternative), grated", "2 x 125g balls mozzarella, sliced", "1kg spinach", "100g parmesan (or vegetarian alternative), grated", "3 x 250g tubs ricotta", "large pinch grated nutmeg", "400g dried cannelloni"], "instructions": "First make the tomato sauce. Heat the oil in a large pan and fry the garlic for 1 min. Add the sugar, vinegar, tomatoes and some seasoning and simmer for 20 mins, stirring occasionally, until thick. Add the basil and divide the sauce between 2 or more shallow ovenproof dishes (see Tips for freezing, below). Set aside. Make a sauce by beating the mascarpone with the milk until smooth, season, then set aside.\nPut the spinach in a large colander and pour over a kettle of boiling water to wilt it (you may need to do this in batches). When cool enough to handle squeeze out the excess water. Roughly chop the spinach and mix in a large bowl with 100g Parmesan and ricotta. Season well with salt, pepper and the nutmeg.\nHeat oven to 200C/180C fan/gas 6. Using a piping bag or plastic food bag with the corner snipped off, squeeze the filling into the cannelloni tubes. Lay the tubes, side by side, on top of the tomato sauce and spoon over the mascarpone sauce. Top with Parmesan and mozzarella. You can now freeze the cannelloni, uncooked, or you can cook it first and then freeze. Bake for 30-35 mins until golden and bubbling. Remove from oven and let stand for 5 mins before serving.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1259591_6-6382b2d.jpg", "nutrients": {"calories": "711 calories", "fatContent": "47 grams fat", "saturatedFatContent": "27 grams saturated fat", "carbohydrateContent": "44 grams carbohydrates", "sugarContent": "15 grams sugar", "fiberContent": "5 grams fiber", "proteinContent": "30 grams protein", "sodiumContent": "1.59 milligram of sodium"}}