{"title": "Beef & beetroot curry", "time": 200, "yields": "6 serving(s)", "ingredients": ["750g raw beetroot , stalks trimmed to 1cm", "finger-length piece ginger , chopped", "3 garlic cloves", "1 whole red chilli , seeds and all", "small bunch coriander , ½ leaves reserved to serve, remaining leaves and stalks roughly chopped", "6 cardamom pods", "2 tbsp tomato paste", "2 tbsp treacle", "2 tbsp ground cumin", "1 tbsp ground coriander", "2 tsp fennel seed", "¼ tsp ground cloves", "3 tbsp sunflower oil", "1 ½kg British feather blade beef (or other stewing beef), cut into big chunks", "2 onions , chopped", "2 beef stock cubes", "2 tsp garam masala", "naan bread , basmati rice and raita or natural yogurt, to serve"], "instructions": "Put the beetroot in a large pan of water, bring to the boil and simmer until tender – check with a skewer; you may need to remove smaller ones first while the larger ones carry on cooking. Drain and cool, then put on rubber gloves to peel the skin and remaining stalks. Chop into large chunks and set aside two-thirds for later.\nPut the remaining one-third beetroot in a food processor or blender with the ginger, garlic, chilli, chopped coriander, cardamom pods, tomato paste, treacle, cumin, ground coriander, fennel seeds, cloves and 2 tsp ground black pepper. Whizz to a paste.\nHeat oven to 160C/140C fan/gas 3. Heat half the oil in a big flameproof casserole. Fry the beef chunks in batches until browned all over, removing to a dish as you go. Add the remaining oil, lower the heat, then tip in the onions and fry gently until softened, scraping up the beefy bits. Tip in the spice paste and fry for 5 mins until really fragrant. Return the beef and stock cubes with enough boiling water from a kettle to cover. Bring to a simmer, then put on the lid and bake for 2 hrs.\nUncover and bake for a further 30 mins until the beef is really tender. Put back on the hob and stir in the garam masala and reserved beetroot to heat through. Season well with salt, scatter with coriander leaves and serve with naan, basmati rice and raita or yogurt, if you like.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1217464_11-3f4c69f.jpg", "nutrients": {"calories": "467 calories", "fatContent": "22 grams fat", "saturatedFatContent": "7 grams saturated fat", "carbohydrateContent": "19 grams carbohydrates", "sugarContent": "16 grams sugar", "fiberContent": "4 grams fiber", "proteinContent": "51 grams protein", "sodiumContent": "1.4 milligram of sodium"}}