{"title": "Beetroot, lentil, celeriac & hazelnut salad", "time": 140, "yields": "8 serving(s)", "ingredients": ["1 large or 2 medium-sized beetroots", "drizzle of extra virgin olive oil", "175g puy lentils", "650ml vegetable stock", "1 bay leaf", "2 thyme sprigs", "1 lemon , juiced", "400g celeriac", "35g hazelnuts , halved and toasted", "2 tbsp chopped flat-leaf parsley", "1 tbsp red wine vinegar", "¾ tsp Dijon mustard", "1 tbsp crème de cassis", "good pinch of sugar", "4 ½ tbsp extra virgin olive oil (a fruity one, not a grassy Tuscan one)", "90ml hazelnut oil"], "instructions": "Heat oven to 190C/170C fan/gas 5. Scrub the beets but don’t peel them. Put them in a roasting tin lined with plenty of foil, drizzle with olive oil and season. Pull the foil around them to make a kind of tent (don’t wrap the beets tightly) and seal the edges. Bake for 1-2 hrs until completely tender right through – the time will depend on the size of the beets.\nTo make the dressing, combine the vinegar and mustard in a jug, then season. Add the remaining ingredients and whisk until amalgamated.\nPut the lentils in a pan with the stock, bay and thyme. Bring to the boil, then turn down to a very gentle simmer. Cook for 12-15 mins until the lentils are just tender. The stock will be absorbed as the lentils cook (if this happens before the lentils are ready, just add some boiling water). Drain the lentils (if there is any liquid left) and set aside.\nFill a bowl with water and add the lemon juice. Peel the celeriac and cut it into matchsticks, dropping them into the acidulated water to stop the flesh discolouring. Steam or boil the celeriac until just tender.\nPeel the cooked beets and cut the flesh into small wedges or matchsticks. Drain the celeriac and pat dry. Discard the bay and toss the lentils with the celeriac, hazelnuts, parsley and most of the dressing. Season to taste, then transfer to a serving dish. Season the beets and add them to the salad, spooning the rest of the dressing over the top.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/beetroot-salad-9b9dc15.jpg", "nutrients": {"calories": "383 calories", "fatContent": "28 grams fat", "saturatedFatContent": "3 grams saturated fat", "carbohydrateContent": "17 grams carbohydrates", "sugarContent": "5 grams sugar", "fiberContent": "8 grams fiber", "proteinContent": "9 grams protein", "sodiumContent": "0.6 milligram of sodium"}}