{"title": "Beetroot & blackberry cured salmon", "time": 10, "yields": "6 serving(s)", "ingredients": ["800-1kg side of salmon , pin-boned and scaled", "90g brown sugar", "125g sea salt", "80g blackberries or elderberries", "2 raw beetroots , peeled and chopped", "3 juniper berries , crushed", "4 tbsp gin", "1 bunch of dill , finely chopped", "6 white peppercorns , crushed", "1 tbsp freshly grated horseradish", "2 tbsp gin"], "instructions": "In a food processor, combine the ingredients for the beetroot and berry cure. Unravel some cling film but keep it attached to the roll. Spoon a bit of the cure on the cling film then lay the salmon, skin-side down, on top and pack the rest of cure over the flesh. Roll the fish tightly in cling film to create a package. Put the package in a shallow baking dish or shallow-sided tray and lay another tray on top. Weigh the tray down with a couple of tins and put in the fridge for two days, turning the salmon over occasionally.\nOn the second day, remove the salmon from its wrapping and scrape off any excess cure. Gently rinse the remaining cure off the salmon and pat dry with kitchen towel. In a bowl, combine the chopped dill with the peppercorns, horseradish and gin. Prepare another piece of cling film for the salmon and cover all over with the herb mix. Wrap the salmon up again as before. Put it in the baking tray, weigh it down, and leave, for at least another 8 hrs. Remove the salmon from its wrapping and transfer to a board. Finely slice and serve with sourdough crackers and pickles. Will keep in the fridge for up to three days.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/beetroot-blackberry-cured-salmon-ea3e809.jpg", "nutrients": {"calories": "396 calories", "fatContent": "25 grams fat", "saturatedFatContent": "5 grams saturated fat", "carbohydrateContent": "3 grams carbohydrates", "sugarContent": "3 grams sugar", "fiberContent": "1 grams fiber", "proteinContent": "34 grams protein", "sodiumContent": "3.8 milligram of sodium"}}