{"title": "Better beetroot brownies", "time": 60, "yields": "12 serving(s)", "ingredients": ["500g whole raw beetroot , washed", "100ml rapeseed oil", "250g good-quality dark chocolate (70% cocoa, dairy-free if you want, chopped)", "3 large eggs", "200g golden caster sugar", "2 tsp vanilla extract", "140g plain flour", "75g cocoa powder", "1 tsp baking powder", "50g walnut piece , roughly chopped", "100g icing sugar", "1 tbsp beetroot juice"], "instructions": "Heat oven to 180C/160C fan/gas 4. Grease and line a 20 x 30cm cake tin with baking parchment. Boil the beetroots in a pan of boiling salted water for 15-20 mins or until tender. Drain and leave to cool before peeling (wear clean rubber gloves to peel if you want to avoid beet-stained hands). Chop one-third of the cooked beetroots into small cubes and blitz the remainder in a blender or food processor to a paste. Sit the paste in a sieve over a bowl – just until you have collected 1-2 tbsp juice. Save this for the icing, and mix the oil into the purée.\nMelt the chocolate slowly in a heatproof bowl over a pan of barely simmering water and leave to cool slightly. Use an electric whisk to beat the eggs, sugar and vanilla together in a large mixing bowl until light, fluffy and tripled in size. Carefully fold the eggs into the beetroot mixture, followed by the melted chocolate. Fold in the flour, cocoa powder and baking powder, then add walnuts and the chopped beetroot.\nPour into your prepared tin and bake for 20-25 mins. The brownies should still be slightly gooey in the middle. Allow to cool. Mix enough reserved beetroot juice with the icing sugar to get a runny icing – dilute with water if you need. Remove brownies from the tin, drizzle with the icing and cut into squares.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1239516_8-e22902d.jpg", "nutrients": {"calories": "408 calories", "fatContent": "20 grams fat", "saturatedFatContent": "6 grams saturated fat", "carbohydrateContent": "50 grams carbohydrates", "sugarContent": "41 grams sugar", "fiberContent": "3 grams fiber", "proteinContent": "7 grams protein", "sodiumContent": "0.4 milligram of sodium"}}