{"title": "Crab, leek & cheddar tart", "time": 100, "yields": "6 serving(s)", "ingredients": ["250g plain flour, plus extra for dusting", "150g cold butter, cut into cubes", "1 large egg yolk", "10g butter", "2 leeks (about 500g), sliced into 2cm rings", "200ml double cream", "100ml crème fraîche", "1 large egg, plus 3 egg yolks", "200g white crabmeat", "35g cheddar, grated"], "instructions": "Put the flour, butter and a good pinch of salt into a food processor, and blitz until the mix resembles breadcrumbs. Combine the yolk with 1½ tbsp very cold water, then add this to the mixture and blitz again until the pastry comes together into a ball (you may need to add a little more water).\nLightly dust a rolling pin and a large sheet of baking parchment with flour. Roll the pastry out on the parchment, and use it to line a 23cm loose-bottomed tart tin. Chill for 1 hr until firm. Heat the oven to 200C/180C fan/gas 6 with a baking sheet inside.\nFor the filling, heat the butter in a heavy-bottomed pan over a medium heat, add the leeks, stir, season and add 2 tbsp water. Cover, reduce the heat to low and cook for 15 mins until the leeks are soft. Uncover, turn up the heat and cook until any liquid has evaporated. Remove from the heat and leave to cool.\nPrick the base of the pastry case all over with a fork, then line with baking parchment and baking beans. Bake on the hot baking sheet for 12 mins, remove the parchment and beans, then bake for 13 mins more. Leave to cool slightly, then spoon the leeks into the pastry case.\nMix together the double cream, crème fraîche, whole egg and egg yolks. Season well, then gently fold in the crabmeat. Carefully pour the filling over the layer of leeks, then scatter over the cheese.\nReturn the tart to the baking sheet in the oven and bake for 35-40 mins, or until the pastry is golden and the filling is just set in the middle (it will continue to cook as it cools). Leave to cool for 15 mins, then remove from the tin and serve.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/11/Crab-leek-and-cheddar-tart-f78d99d.jpg", "nutrients": {"calories": "712 calories", "fatContent": "54 grams fat", "saturatedFatContent": "32 grams saturated fat", "carbohydrateContent": "35 grams carbohydrates", "sugarContent": "3 grams sugar", "fiberContent": "4 grams fiber", "proteinContent": "18 grams protein", "sodiumContent": "1 milligram of sodium"}}