{"title": "Creamed leek tart", "time": 180, "yields": "12 serving(s)", "ingredients": ["300g plain flour , plus extra for dusting", "140g unsalted butter , cut into small pieces, plus extra for greasing", "1 medium egg", "4 tbsp iced water", "85g unsalted butter", "800g leek , sliced lengthways then into 2.5cm/1in pieces", "½ tbsp plain flour", "300ml milk", "200ml double cream", "2 medium eggs", "4 medium egg yolks , beaten together with the other eggs", "100g gruyère , grated", "1 tsp English mustard"], "instructions": "Pulse the flour and butter in a food processor until you have fine crumbs. Add the egg yolk and water, and bring together into a ball. Do not knead. Roll the pastry in cling film and chill for at least 1 hr.\nMeanwhile, heat the butter in a pan, then add the leeks. Cook over a low heat for 20-25 mins until soft, stirring often. Season to taste. Stir in the flour, cook for 3-4 mins, stirring, then stir in the milk and cream. Once smooth, simmer for 15 mins to cook out the flour. Season well, then cool. If making ahead, cover the surface with cling film and chill for up to 2 days. Stir the eggs and egg yolks into the mix, along with the grated cheese and the mustard.\nHeat oven to 190C/170C fan/gas 5. Roll out the pastry on a floured surface to about 5mm/¼in thick, and gently lay it over a 23cm loose-bottomed tart tin. Using a small ball of pastry to help, gently press the pastry into the sides of the tin. Trim, leaving a slight overhang. Line the pastry with baking paper, fill with baking beans, then bake for 15 mins. Remove the beans and paper, and bake for 10 mins more or until golden and biscuity. Cool on a wire rack. Turn oven down to 180C/160C fan/gas 4.\nSpoon the leek mix into the case and smooth the top. Bake for 30 mins until set and golden. Rest the tart for 15-20 mins before you slice it, and serve warm. If making ahead, chill the tart. Once cooled, for up to 2 days, or freeze for a week. Defrost in fridge, then warm in the oven for 20 mins before serving.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-90451_11-829d395.jpg", "nutrients": {"calories": "414 calories", "fatContent": "32 grams fat", "saturatedFatContent": "18 grams saturated fat", "carbohydrateContent": "24 grams carbohydrates", "sugarContent": "3 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "9 grams protein", "sodiumContent": "0.23 milligram of sodium"}}