{"title": "Leek, cheddar & bacon loaf sandwich", "time": 85, "yields": "10 serving(s)", "ingredients": ["500g pack bread mix", "2 tbsp olive oil", "200g smoked bacon lardon", "2 tbsp butter", "3 large fat leeks , thinly sliced", "little flour , for dusting", "200g mature cheddar , diced", "2 eggs , beaten separately", "10 sage leaves, thinly shredded", "2 tbsp grated parmesan"], "instructions": "Make up the bread mix following pack instructions, using the 2 tbsp oil and the recommended amount of water. Leave in an oiled bowl, covered with oiled cling film, somewhere warm-ish to rise for 1 hr.\nMeanwhile, put the lardons in a big, cold frying pan. Heat gently at first so the fat runs from the lardons before they crisp up – about 10 mins. Remove with a slotted spoon. Add the butter and leeks to the pan and cook to soften. Cool.\nRoll out the dough on a lightly floured surface to a rectangle about 20 x 70cm. Mix the lardons, leeks, cheddar, one of the eggs, the sage and some seasoning. Spoon the filling down one long edge of the rectangle, then brush the edge with some remaining egg. Fold the other half of the dough over the filling and pinch together the edges, but not the ends, to seal into a long sausage. Carefully shape into a ring on a floured baking tray, around a floured empty jar or tin. Pinch together the open ends to finish the ring. Brush all over with egg, scatter with Parmesan and cover with a clean tea towel. Leave to rise for 15-20 mins.\nHeat oven to 200C/180C fan/gas 6. Bake for 30-40 mins until golden and the base sounds hollow when tapped. Eat in wedges.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1099463_11-99db342.jpg", "nutrients": {"calories": "333 calories", "fatContent": "19 grams fat", "saturatedFatContent": "9 grams saturated fat", "carbohydrateContent": "25 grams carbohydrates", "sugarContent": "1 grams sugar", "fiberContent": "2 grams fiber", "proteinContent": "16 grams protein", "sodiumContent": "1.6 milligram of sodium"}}