{"title": "Pheasant, leek & bacon pie", "time": 100, "yields": "6 serving(s)", "ingredients": ["50g butter", "200g streaky bacon , cut into chunks", "4 leeks , cut into large chunks", "3 celery sticks, sliced", "3 carrots , halved lengthways and sliced", "2 bay leaves", "3 tbsp plain flour", "300ml cider", "500ml chicken stock", "2 tbsp double cream", "6 pheasant breasts, skinned and cut into large chunks", "3 tbsp wholegrain mustard", "1 tbsp cider vinegar", "500g block puff pastry", "plain flour , for dusting", "egg beaten with a little milk, to glaze"], "instructions": "Heat the butter in a casserole dish and cook the bacon for 1 min until it changes colour. Add the leeks, celery, carrots and bay, and cook until they start to soften. Stir the flour into the veg until it goes a sandy colour, then splash in the cider and reduce. Pour in the chicken stock, stir, then add the cream. Season, then bring everything to a simmer. Add the pheasant and gently simmer for 20 mins until the meat and veg are tender. Stir through the mustard and vinegar, then turn off the heat and cool.\nHeat oven to 220C/200C fan/gas 7. Tip the mixture into a large rectangular dish. Roll the pastry out on a floured surface, place over the dish and trim round the edges, leaving an overhang. Brush the pastry with egg, then decorate with any leftover pastry, if you like. Sprinkle with a little sea salt. The pie can now be frozen for up to 1 month; defrost completely before baking. Bake for 30-35 mins until golden. Remove from the oven and leave to cool for 5 mins before serving.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-905451_10-6b9f537.jpg", "nutrients": {"calories": "777 calories", "fatContent": "48 grams fat", "saturatedFatContent": "22 grams saturated fat", "carbohydrateContent": "38 grams carbohydrates", "sugarContent": "8 grams sugar", "fiberContent": "5 grams fiber", "proteinContent": "47 grams protein", "sodiumContent": "2.75 milligram of sodium"}}