{"title": "Rhubarb & custard cocktail", "time": 15, "yields": "4 serving(s)", "ingredients": ["85g caster sugar", "300g chopped rhubarb", "100ml vodka", "100ml rhubarb syrup (see above)", "1 length rhubarb", "30ml advocaat", "75ml lemonade"], "instructions": "To make the rhubarb syrup, put the caster sugar in a saucepan with 75ml water. Heat very gently, so the sugar disappears but the water doesn’t bubble. Tip in the chopped rhubarb, cover with a tight-fitting lid and increase the heat a little so it begins to boil. Simmer, covered, for about 5 mins until the rhubarb is very tender but not disintegrating.\nTurn off the heat, and tip the pan’s contents into a fine sieve over a bowl. Use a wooden spoon to gently squeeze the rhubarb so that you get all the juices, but no pulp. Tip back into the pan and boil rapidly for a few mins until just syrupy. Pour into a jug – you should have about 125ml. Leave to cool completely. Any leftovers will keep in the fridge for up to 1 month.\nChill 4 cocktail glasses with ice or in your freezer. Shake the vodka and 100ml of the rhubarb syrup together with ice until mixed and chilled down. Make small shreds of rhubarb using a vegetable peeler and place into iced water – this will make them curl up.\nIn a separate jug, whisk together the advocaat and lemonade with more ice to lighten. Divide the vodka and rhubarb mixture between the glasses, straining through a small sieve to catch the ice.\nCarefully pour 25ml of your advocaat mixture into each glass over an upsidedown spoon (the mixture should float on the surface of the vodka syrup mixture). Drain the rhubarb shreds well and use to garnish your cocktails.", "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1243637_8-967b387.jpg", "nutrients": {"calories": "126 calories", "fatContent": "1 grams fat", "carbohydrateContent": "10 grams carbohydrates", "sugarContent": "10 grams sugar", "proteinContent": "1 grams protein"}}